[
  {
    "Id": "1278546",
    "ThreadId": "554461",
    "Html": "The TypeScript team has moved development from CodePlex to GitHub.  You can read about the move on the blog post here: <a href=\"http://blogs.msdn.com/b/typescript/archive/2014/07/21/new-compiler-and-moving-to-github.aspx\" rel=\"nofollow\">http://blogs.msdn.com/b/typescript/archive/2014/07/21/new-compiler-and-moving-to-github.aspx</a>\r<br />\n<br />\nAs a result, we're moving the forums as well.  As part of the move to GitHub, we're organizing the forums a bit more:<br />\n<ul>\n<li>For questions about how to use TypeScript and how to work with various JavaScript libraries and patterns, please use the TypeScript StackOverflow site.  This helps users have a one-stop place to find the best answers and get started quickly. </li>\n<li>\nFor feature requests and design discussions, please post to the TypeScript issues on GitHub <br />\n</li>\n</ul>\nThis discussion area on CodePlex will currently remain open for the time being, but will not be monitored by the TypeScript team as they were in the past.<br />\n",
    "PostedDate": "2014-07-28T15:54:14.663-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1278712",
    "ThreadId": "554461",
    "Html": "I think you should update this page: <a href=\"https://typescript.codeplex.com/discussions\" rel=\"nofollow\">https://typescript.codeplex.com/discussions</a>\r<br />\nI mean this part: &quot;Use this discussion page to discuss the language specification (docx, pdf), to provide feedback on code checkins, and to ask project questions. To report a bug on the CodePlex project, use the Issue Tracker. To ask questions about using TypeScript, use StackOverflow.&quot;<br />\n",
    "PostedDate": "2014-07-29T05:07:28.82-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1279634",
    "ThreadId": "554461",
    "Html": "Good catch!  Updated.<br />\n",
    "PostedDate": "2014-07-31T09:10:53.35-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]