[
  {
    "Id": "1091377",
    "ThreadId": "456585",
    "Html": "I have a project where I used to compile to multiple files, and everything worked fine. I decided to move to a single file output, and it started compiling classes in the wrong order.\r<br />\n<br />\nThere is no circular dependency, basically some hierarchy in different folders, something like this\r<br />\n<br />\n\\App &lt;- app classes depends on Lib\r<br />\n\\Scripts\\Lib &lt;- libraries written in typescript, depends on declaration files only\r<br />\n\\Views\\Name\\View.ts &lt;- view code, depends on App classes\r<br />\n<br />\nTypeScript compiles all of them to a single file, but it orders the output incorrectly. It puts classes from &quot;\\App&quot; before &quot;\\Script\\Lib&quot;, but not all of them. It seems that some ordering is being done, but something messes it up before the final output.\r<br />\n<br />\nI noticed that the output order changes depending on which file I change first. It also changes the order of the output if I move a file to another folder and fix the references, even if I don't change the actual hierarchy of classes.\r<br />\n<br />\nIt is erratic behavior, I couldn't find the exact pattern that causes it, but it is definitely happening.\r<br />\n<br />\nIs anyone else seeing this behavior?<br />\n",
    "PostedDate": "2013-09-11T11:43:05.837-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1091499",
    "ThreadId": "456585",
    "Html": "Yes there are issues around single file output class ordering.  There's a work item here: <a href=\"https://typescript.codeplex.com/workitem/913\" rel=\"nofollow\">https://typescript.codeplex.com/workitem/913</a><br />\n",
    "PostedDate": "2013-09-11T16:44:03.203-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1091943",
    "ThreadId": "456585",
    "Html": "I'd like to note for the dev team that there are issues with regular inheritance, not only with circular references.\r<br />\n<br />\nI saw paulb's comments that some things are by design, but this doesn't seem like it.\r<br />\n<br />\nMy code is quite simple, A extends B, C extends B, but depending on which folder the files are, they are compiled in the wrong order and this keeps changing depending on which file I change later.\r<br />\n<br />\nThis seems to happen only if you have classes in different directories, and makes it impossible to use single file output for anything other than samples.<br />\n",
    "PostedDate": "2013-09-12T15:28:22.253-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1092692",
    "ThreadId": "456585",
    "Html": "This discussion has been copied to a work item. Click <a href=\"https://typescript.codeplex.com/workitem/1686\" rel=\"nofollow\">here</a> to go to the work item and continue the discussion.<br />\n",
    "PostedDate": "2013-09-14T07:43:04.163-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1092889",
    "ThreadId": "456585",
    "Html": "@Nivo\r<br />\n<br />\nThanks for reporting, we need a little more information here.\r<br />\n<br />\n Does this happen in Visual Studio with Compile on Save, or when doing a build? Does this happen when doing a command line compile? If so what is the exact command line you use?\r<br />\n<br />\nCan you add this information to the <a href=\"https://typescript.codeplex.com/workitem/1686\" rel=\"nofollow\">workitem</a>?<br />\n",
    "PostedDate": "2013-09-15T10:46:18.387-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]