[
  {
    "Id": "1043450",
    "ThreadId": "443618",
    "Html": "First time poster, so hopefully I'm asking in the right forum. \r<br />\n<br />\nTrying to figure out if I'm missing something here. I've got the latest VS 2012, Web Essentials 2.7, and TypeScript 0.8.3.1 (via Node). No matter what, I can't get my @param JSDoc comments to show up in the intellisense. \r<br />\n<br />\nFor simple method defined like this:<br />\n<pre><code>/** \n* Repeat str several times. \n* @param str The string to repeat. \n* @param times How many times to repeat the string. \n*/\nrepeatIt(str, times): string {\n    return &quot;hi&quot;;\n}</code></pre>\n\nIf I then type &quot;this.repeatIt&quot; to see the intellisense, it shows the signature, and the &quot;Repeat str several times&quot;, but neither of the @param docs.\r<br />\n<br />\nIs there some setting or update I am missing that enables this?\r<br />\n<br />\nThanks,\r<br />\n<br />\nBrian<br />\n",
    "PostedDate": "2013-05-14T09:20:59.903-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1043550",
    "ThreadId": "443618",
    "Html": "You're doing things correctly. This works as you expect with the latest Typescript bits in the develop branch sans Web Essentials. It is possible there is a bug here in 0.8.3 and/or Web Essentials but I don't have a machine with them in front of me to check at the moment.<br />\n",
    "PostedDate": "2013-05-14T14:10:43.88-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1043560",
    "ThreadId": "443618",
    "Html": "Thanks! Good to know it's not some stupid oversight on my part, I was kind of going crazy since it seems like it should &quot;just work&quot;. Thanks, let me know what you're able to find out.\r<br />\n<br />\nJust so I'm clear, is using the Web Essentials VS plugin discouraged? It seemed like a no-brainer to install it since it seemed to add a fair number of extra TS features.\r<br />\n<br />\nRegards,\r<br />\n<br />\nBrian<br />\n",
    "PostedDate": "2013-05-14T14:26:16.953-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1043610",
    "ThreadId": "443618",
    "Html": "It appears to work correctly for me with 0.8.3 + VS2012 Ultimate. \r<br />\n<br />\nWeb Essentials is not discouraged by any means. It certainly has some very nice functionality. It simply isn't supported by us in an official sense. We don't have the resources to be constantly testing our new features against every new release of Web Essentials, especially as things conflict (ex it has its own version of the Compile On Save feature). We do check it out periodically and some folks on the team use it to varying degrees so hopefully it should never be completely busted but it's quite possible there are some bad interactions along the edges at any given time and whether we can spend time fixing them is generally a matter of where the root cause is and who is actually doing the 'wrong' thing.<br />\n",
    "PostedDate": "2013-05-14T17:38:33.75-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1043890",
    "ThreadId": "443618",
    "Html": "@brian428 - have you tried the official VS plugin for TypeScript rather than WebEssentials + the Node version?  I'd be curious to see if that fixes the issue.<br />\n",
    "PostedDate": "2013-05-15T07:09:52.367-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1043903",
    "ThreadId": "443618",
    "Html": "I <em>believe</em> I have both the &quot;TypeScript Plugin&quot; installed as well as Web Essentials 2.7. The first thing I did after setting up VS was download and run the TypeScriptSetup.0.8.3.1.msi that I downloaded from the TS site. Only after this did I read about the additional features that Web Essentials adds, so I then installed Web Essentials 2.7 as well.\r<br />\n<br />\nThat said, I'm a bit of a VS noob and I don't see anything in the Tools &gt; Add-In Manager or Tools &gt; Extensions and Updates that seems to mention the TypeScript Plugin. Is there a place where I can look to confirm that VS is using the plugin? I could also just try re-running the .msi, I suppose.\r<br />\n<br />\nThanks,\r<br />\n<br />\nBrian<br />\n",
    "PostedDate": "2013-05-15T07:30:54.473-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]