[
  {
    "Id": "924322",
    "ThreadId": "398737",
    "Html": "\r\n<p>Hi,</p>\r\n<p>It seems that Node.JS bits are there, but severely crippled. It'd be great to see some changes in that area;</p>\r\n<ul>\r\n<li>Ability to require(&quot;xxx.ts&quot;) files from javascript. (I created a module for this though:&nbsp;https://github.com/eknkc/typescript-require)\r\n</li><li>Exporting TypeScriptCompiler as a CommonJS module in Node.JS </li><li>REPL! </li><li>A better compiler cli. Say, I want to compile my scripts down into another folder, there is no such option. Or I just want to eval some argument. You should go ahead and copy CoffeeScript cli completely.\r\n</li><li>A sane compiler interface. Let me pass some TS source into a function and receive javascript. Don't make me create weird file writers and manually resolve dependencies on disk and shit like that. If I wanted to write C#, I would.\r\n</li></ul>\r\n<p>Overall, I love love the language, it's plain great. Just keep node community happy :)</p>\r\n",
    "PostedDate": "2012-10-09T15:43:11.84-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "924323",
    "ThreadId": "398737",
    "Html": "\r\n<p>BTW, do you accept pull request if I were to work on some patches? I really don't know how open source is a Microsoft Open Source project.</p>\r\n<p>And, do you have an official Github mirror?</p>\r\n",
    "PostedDate": "2012-10-09T15:44:28.967-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "924429",
    "ThreadId": "398737",
    "Html": "<p>I am not sure what the TypeScipt team is intending to do with the node.js definitions.</p>\r\n<p>They certainly don't intend them to be the finished state at this moment - that is why they are in the Samples folder. For example their jQuery UI .d.ts file covers just Draggable and Droppable components etc.</p>\r\n<p>I am working on some definitions for TypeScript here:</p>\r\n<p><a href=\"https://github.com/borisyankov/DefinitelyTyped\">https://github.com/borisyankov/DefinitelyTyped</a></p>\r\n<p>I also have copied their definitions in the repo, if you do changes, your pull requests are welcome there.</p>",
    "PostedDate": "2012-10-09T20:10:21.15-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "926059",
    "ThreadId": "398737",
    "Html": "<p>@borisyankov<br />See also&nbsp;https://github.com/soywiz/typescript-node-definitions</p>",
    "PostedDate": "2012-10-12T18:33:56.01-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]