[
  {
    "Id": "1135260",
    "ThreadId": "473430",
    "Html": "I accidentally deleted the reference paths at the top of my (VS 2013) file and TS 0.9.5 still found everything.  Is TS now automatically referencing all the ts files in my project? in my directory? Under what if any circumstances should or must I include a reference path in my ts file?<br />\n",
    "PostedDate": "2013-12-12T13:24:44.87-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1135277",
    "ThreadId": "473430",
    "Html": "Yes, Visual Studio now implicitly references files within a project. See <a href=\"http://blogs.msdn.com/b/typescript/archive/2013/12/05/announcing-typescript-0-9-5.aspx\" rel=\"nofollow\">http://blogs.msdn.com/b/typescript/archive/2013/12/05/announcing-typescript-0-9-5.aspx</a>\r<br />\n<br />\nUsing _references.ts\r<br />\n<br />\nWith the previous improvements to the Visual Studio experience, we've moved to projects implicitly referencing the .ts files contained in the project.  This cut down on having to explicitly reference your files in the project, bringing the experience much closer to C#.  Unfortunately, it also did not work well when using the option to concatenate your output .js file.\r<br />\n<br />\nWe're continuing to improve this experience.  Starting with 0.9.5, you can now add an _references.ts file to your project.  This file will be the first passed to the compiler, allowing you more control over the order the generated .js file when used in combination with the Combine JavaScript output into file option (the equivalent of using the --out commandline option).<br />\n",
    "PostedDate": "2013-12-12T14:31:51.53-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1135846",
    "ThreadId": "473430",
    "Html": "Thanks.  Still having a little trouble.  Can you tell me what exactly they mean by &quot;contained in the project&quot;.  Is that the folder? or is it using the csproj file?  I've got a TS file in a subfolder and tsc is not finding my referenced types defined in a parent folder.<br />\n",
    "PostedDate": "2013-12-14T11:56:24.737-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1136305",
    "ThreadId": "473430",
    "Html": "@GaryB611, In the phrase &quot;contained in the project&quot; project refers to the Visual Studio project - not the folder.\r<br />\n<br />\nDo you have Build Action set to &quot;TypeScriptCompile&quot; for the files in the parent folder?<br />\n",
    "PostedDate": "2013-12-15T12:01:13.26-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1221471",
    "ThreadId": "473430",
    "Html": "I'm not finding this to be true for a couple of my files. I can't get some of my files to compile unless I make sure the references are included.<br />\n",
    "PostedDate": "2014-03-11T08:15:43.48-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]