[
  {
    "Id": "1136065",
    "ThreadId": "473815",
    "Html": "I'm building a node.js project using TypeScript. I'm not using Visual Studio for this. I have about 70-80 .ts files and around 25000 lines of code and there are some complex code paths due to heavy use of promises (via the Q library). My project takes almost 30 seconds to compile, which, for this size of project, is frustratingly slow, given (a) the lack of intellisense and (b) the fact that I'm making frequent changes that I need to test. I know the VS plugin provides intellisense, but it's based on the TypeScript compiler and so is of course still extremely slow to update given that my project is so slow to compile. As a result, I'm using Sublime Text instead.<br />\n<br />\nTo the TypeScript dev team - is there any way I can provide you with a copy of my project (just the TS files and the command line I use to compile? Would this help you find some of the performance issues with the compiler? There are a couple of files in my project that compile much, much slower than all the rest, and they are literally only a few hundred lines of source. I don't know what's special about them, but they would perhaps provide an opportunity to see &quot;code in the wild&quot; that is causing problems for the compiler.<br />\n",
    "PostedDate": "2013-12-15T02:43:55.303-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1136766",
    "ThreadId": "473815",
    "Html": "The best way to help us repro is to file an issue with the issue tracker, and provide some of the slow-compiling files as attachments onto the issue.  That way we can try to work out what patterns seem to be giving the compiler trouble.\r<br />\n<br />\nOut of curiosity - what version of TypeScript are you using?  <br />\n",
    "PostedDate": "2013-12-16T09:21:33.047-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1136847",
    "ThreadId": "473815",
    "Html": "Ok I will try to isolate the problem code down to a small subset and open an issue for it.\r<br />\n<br />\nI'm using 0.9.5, though the performance seems pretty on par with 0.9.1[.1].<br />\n",
    "PostedDate": "2013-12-16T12:01:55.403-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1136884",
    "ThreadId": "473815",
    "Html": "I've created an issue here: <a href=\"https://typescript.codeplex.com/workitem/2022\" rel=\"nofollow\">https://typescript.codeplex.com/workitem/2022</a><br />\n",
    "PostedDate": "2013-12-16T13:42:54.91-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]