[
  {
    "Id": "920812",
    "ThreadId": "397773",
    "Html": "\r\n<p>How can I provide additional command line options to the TS compiler (like --module, etc.) when building from Visual Studio 2012 for the Web?</p>\r\n<p>&nbsp;</p>\r\n<p>Thank you!</p>\r\n",
    "PostedDate": "2012-10-02T12:35:48.37-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "920827",
    "ThreadId": "397773",
    "Html": "\r\n<p>&#43;1</p>\r\n<p>We need this. I've already spent a bunch of time unloading my project, editing the command-line, reloading the project, finding that I broke something, and repeating...</p>\r\n<p>It seems like we'll need to do this on almost every new project, including the following common scenarios:</p>\r\n<ul>\r\n<li>target ES5 for properties (--target) </li><li>target AMD modules for browsers (--module) </li><li>output single file for browsers (--out) </li></ul>\r\n<p>How about right-click -&gt; Properties -&gt; Build for this? Also, see this discussion for more build stuff we'd love to see:</p>\r\n<p><a href=\"http://typescript.codeplex.com/discussions/397767\">http://typescript.codeplex.com/discussions/397767</a></p>\r\n",
    "PostedDate": "2012-10-02T12:59:59.823-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "921599",
    "ThreadId": "397773",
    "Html": "<p>We are very aware of the need for greater compiler option support within Visual Studio.&nbsp; As billyzkid outlined, you can modify the command-line in the project file currently.&nbsp; It's not ideal, and we plan to improve this over coming releases, but for our preview release, the story is quite limited.&nbsp; (Another option is use the @file switch for the TSC command, and reference this in the project build command - that way you can modify this file rather than your project for every setting change).</p>",
    "PostedDate": "2012-10-03T17:39:25.11-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "922103",
    "ThreadId": "397773",
    "Html": "<p>Why is it a compilation step? &nbsp;Why not use a custom tool to generate the files on the fly (and show the .js files nested under the .ts file)? &nbsp;The problem with compilation is that it may force you out of a debug session.</p>",
    "PostedDate": "2012-10-04T13:16:32.31-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]