[
  {
    "Id": "1043936",
    "ThreadId": "443759",
    "Html": "I am building a web framework for typescript (hope to push an early preview out soon).\r<br />\nI am in love with a lot of the great things of Typescript. But one thing i find very tedious is adding all the references to other TS files. This must be an automateable task and can safe me a lot of time. Because when starting a new project like my framework lots of things move around quit often, also if i miss to remove a reference it have unnessecary code (--out compilation).\r<br />\n<br />\nIs there anything available yet? If not my idea was to build a little node.js app that watches all .ts files in a folder (start it via .bat) and then looks into them on every change and adds all needed references and removes all unneeded ones.\r<br />\n<br />\nAny other thoughts or ideas to that problem?<br />\n",
    "PostedDate": "2013-05-15T08:19:08.977-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1043946",
    "ThreadId": "443759",
    "Html": "\r\n<div dir=\"ltr\">I use a _references.ts file which contains references to all the .ts files in the project, and is referenced from all of them.\r\n<div><br>\r\n</div>\r\n<div style=\"\">I do like the idea of a watcher that maintains that _references.ts file automatically though.</div>\r\n</div>\r\n<div><br clear=\"all\">\r\n<div>\r\n<div dir=\"ltr\"><b><font face=\"arial black, sans-serif\" color=\"#666666\">Mark Rendle</font></b>\r\n<div><font><i>Founder & CEO</i></font></div>\r\n<div><font><i>Oort Corporation</i></font></div>\r\n<div><font><i>Makers of</i> <a href=\"https://zud.io/\" target=\"_blank\"><b><font color=\"#0000ff\">Zudio</font></b></a></font></div>\r\n</div>\r\n</div>\r\n<br>\r\n<br>\r\n<div></div>\r\n</div>\r\n",
    "PostedDate": "2013-05-15T08:44:24.483-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1043948",
    "ThreadId": "443759",
    "Html": "The problem with a _references.ts that contains everything is that with the --out parameter all code gets bundled into the final javascript file that gets transferred to the client. A lot of waste plus ti can/will contain Node,js code that can not run on the client.<br />\n",
    "PostedDate": "2013-05-15T08:52:49.97-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1044082",
    "ThreadId": "443759",
    "Html": "What kind of framework are you working on? I am also working on a framework built on top of express. I have a great TypeScript building solution for Node.js platform ready which solves many problems especially for things like frameworks ... Contact me if you are interested, I need testers before publish ...<br />\n",
    "PostedDate": "2013-05-15T12:55:49.937-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1044400",
    "ThreadId": "443759",
    "Html": "TobiasHei: Then make multiple typescript projects, Shared, Client, Server. Each project has its own References.ts and Client and Server contains reference to Shared project References.ts\r<br />\n<br />\nThis T4 template does generate References.ts file for you (with references to all .ts and .d.ts files in project, and references to other projects Reference.ts files - based on visual studio project references)\r<br />\n<a href=\"http://pastebin.com/mYAFsesG\" rel=\"nofollow\">http://pastebin.com/mYAFsesG</a><br />\n",
    "PostedDate": "2013-05-16T03:50:59.333-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]