[
  {
    "Id": "929916",
    "ThreadId": "400175",
    "Html": "\r\n<p>I happen to read upon this article which is the writer's opinion about why we don't need TypeScript. &nbsp;After reading it, I didn't like what he's saying but he does have a point &quot;no need for more complex javascript&quot;.</p>\r\n<p><a href=\"http://webreflection.blogspot.com/2012/10/javascript-made-everyone-crazy.html\">http://webreflection.blogspot.com/2012/10/javascript-made-everyone-crazy.html</a></p>\r\n<p>&nbsp;</p>\r\n<p>What is your thought on the writer's Honest Opinion. &nbsp;Please no flaming war here, let's be civil because I'm so exciting to want to use TypeScript but it's not quite ready for prime time just yet.</p>\r\n<p>Thanks...</p>\r\n",
    "PostedDate": "2012-10-20T18:26:29-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "930062",
    "ThreadId": "400175",
    "Html": "<p>I love JavaScript... I came to JavaScript from C# so like many at first I thought the langauge was nuts.&nbsp; But then once I got the hang of thinking about things the JavaScript way I fell in love.&nbsp; I realized that in C# I spent way too much time defining types and I felt that I could be 2 - 3 times as productive in JavaScript because I spent less time defining types.&nbsp;&nbsp;But then I started working on a large JavaScript project with 7 other developers and that's when the problems with JavaScript really started to show.</p>\r\n<p>Fundamentally, the problem with JavaScript isn't the language it's the fact there's no compile step.&nbsp; We tend to think of compiling as the process of coverting what you typed into some lower level representation (which JavaScript doesn't need) but it also serves another&nbsp;purpose which is to validate that what you typed&nbsp;looks basically&nbsp;correct (something JavaScript needs badly.)&nbsp; TypeScript adds a bunch of new constructs like classes, interfaces, and modules, all of which are great (and completely optional) but the most important thing it adds is a compile step where it does a static analysis of your code to make sure everything looks basically correct.</p>\r\n<p>If you're an individual developer working on a small to medium sized JavaScript project you have less of a need for TypeScript (although I'd argue there's plenty of benefit to be had for individual developers.)&nbsp; If you're on a team, however, and working on a medium to large sized JavaScript project there's tons of benefit to using TypeScript, even if the only thing you use are the type annotations.&nbsp;</p>\r\n<p>To give you an example... Lets say you and I are part of a team of 10 developers and we're working on a decent sized&nbsp;project with some 30,000 - 50,000 lines of JavaScript (yes there are plenty of projects with that much code.)&nbsp; A developer on our team, Joe, needs me to change&nbsp;the way a set of functions I wrote work.&nbsp; These changes require me to have to change the parameters passed to that function.&nbsp; I make the changes and Joe's happy.&nbsp; The problem is you use the functions too&nbsp;and my changes now have likely broken everyplace where you use the function.&nbsp; In the JavaScript world I would need to do a global search to see if I can find everyplace you're using the functions so I can fix your code for you.&nbsp; With TypeScript all I need to do is compile and it's going to give me a build break for anywhere I need to change.&nbsp; With TypeScript I simply need to keep fixing breaks until the project compiles and I can then be pretty certain that I've update all places that reference the code I changed.&nbsp; The more complex the change the more TypeScripts compile step is going to help you.</p>\r\n<p>That was a refactoring example but even when you're writing new code there's a benefit with using TypeScript... typeo's... ever misspelled a function name?&nbsp; with TYpeScript that's not going to happen because the compilers going to catch&nbsp;your typo.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</p>",
    "PostedDate": "2012-10-21T10:02:46.77-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "930064",
    "ThreadId": "400175",
    "Html": "\r\n<p>(they should have a delete... my reply was submitted twice)</p>\r\n",
    "PostedDate": "2012-10-21T10:03:23.21-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "930087",
    "ThreadId": "400175",
    "Html": "\r\n<p>People tend to forget that &quot;Statically&nbsp;typing&quot; has just as much value when you are talking &quot;communicating design,contract and intend&quot;...<br>\r\nAnd on projects with more than, hell 1 developer... that just becomes an extremely&nbsp;convenient&nbsp;tool to leverage that.<br>\r\n<br>\r\nAnd boy oh... The fact that I don't have to sit and look up one JavaScript method after another in some documentation somewhere is just lovely... And you could argue that that is a tooling issue, but how will you create that tool when all the type information\r\n is gone... If that was so easy, why doesn't we have it today?...<br>\r\n<br>\r\nAnd it's not that you&nbsp;couldn't&nbsp;do allot&nbsp;annotations&nbsp;etc. in pure JS it self to leverage that, and I doubt that they haven't got things on the Facebook&nbsp;teams as well that helps them to leverage these things directly in the source...\r\n and if not... then the bugs I often encounter in the &quot;not so used&quot; parts of facebug (hah!... lol... I actually typed that by accident somehow, but ill leave it as is :P )... suddenly&nbsp;doesn't&nbsp;surprise my that much anymore...<br>\r\n<br>\r\n(I name Facebook as he seems to be working on their engineering team)<br>\r\n<br>\r\nBtw...&nbsp;<br>\r\n<a href=\"http://channel9.msdn.com/Shows/Going&#43;Deep/Anders-Hejlsberg-and-Lars-Bak-TypeScript-JavaScript-and-Dart\">http://channel9.msdn.com/Shows/Going&#43;Deep/Anders-Hejlsberg-and-Lars-Bak-TypeScript-JavaScript-and-Dart</a><br>\r\n<br>\r\nIs an&nbsp;awesome&nbsp;watch, and might lighten up the subject a bit... I have so deep and true respect for those two...&nbsp;</p>\r\n",
    "PostedDate": "2012-10-21T11:29:38.047-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "930681",
    "ThreadId": "400175",
    "Html": "\r\n<p>I don't understand all the fuzz about it...&nbsp;<br>\r\ndoes anyone HAS to use TypeScript: no</p>\r\n<p>if someone wants to continue writing javascript without any type checking, without refactoring, without decent code completion... well that is their choice.</p>\r\n<p>I love any attempt to make the life of a developer better, I love to have the choice... I tried ScriptSharp, I tried Saltarelle and now I'm checking out TypeScript, and so far, I like TypeScript the most... It's still very close to javascript, so everything\r\n applying to javascript applies to TypeScript.</p>\r\n<p>If one doesn't like it, then don't use it... it's that simple.&nbsp;</p>\r\n",
    "PostedDate": "2012-10-22T13:33:26.33-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]