[
  {
    "Id": "1261677",
    "ThreadId": "550260",
    "Html": "Hello TypeScript team,\r<br />\n<br />\nI've been keeping an eye on the Repo and it seems that there have been 1.0.2 and 1.0.3 release branches created which represent about one and two months of work, respectively, beyond the currently officially released version 1.0.1.  Is there any plan to publicly release those versions (other than having them in the repos) like making an announcement around them?  Is there any reason we should <em>not</em> be using them?\r<br />\n<br />\nDo you have any news on when a new &quot;official&quot; public release might be coming?  In particular, it seems like work is continuing with regards to the VS plug-in and some existing bugs have been fixed.  Or will that be tied to the VS release schedule?\r<br />\n<br />\nThanks so much for your work on this project!<br />\n",
    "PostedDate": "2014-07-01T11:03:42.167-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1261870",
    "ThreadId": "550260",
    "Html": "<strong>sognibene wrote:</strong><br />\n<blockquote>\nDo you have any news on when a new &quot;official&quot; public release might be coming?<br />\n</blockquote>\nIf they answer that, I'll eat my hat.<br />\n",
    "PostedDate": "2014-07-02T03:04:27.557-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1261877",
    "ThreadId": "550260",
    "Html": "I would be more interested to know if changes in the develop branches will ends up in a release.\r<br />\nActually i'm working on some forks and I started from develop branches, since the internal for parser have changed a lot between 1.0.1 and develop I'm a little afraid that I have to rewrite everything ^^&quot;.<br />\n",
    "PostedDate": "2014-07-02T03:25:15.687-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1262222",
    "ThreadId": "550260",
    "Html": "Jonathan Turner posted on Twitter today that the latest fixes for the TypeScript VS plugin are available in VS 2013 Update 3 RC (which was released today and is supported as go-live).<br />\n<br />\n<a href=\"https://twitter.com/jntrnr/statuses/484385017145987073\" rel=\"nofollow\">https://twitter.com/jntrnr/statuses/484385017145987073</a><br />\n<br />\nDownload for VS 2013 Update 3 RC:<br />\n<a href=\"http://www.microsoft.com/en-us/download/details.aspx?id=43398\" rel=\"nofollow\">http://www.microsoft.com/en-us/download/details.aspx?id=43398</a><br />\n<br />\nI downloaded and installed it, and I can confirm that the TypeScript tools are included and the TypeScript version installed with it is 1.0.3 with a file date of June 25 - this is a plausible length of time after what was the final commit to the 1.0.3 branch until just yesterday.<br />\n<br />\nJonathan hadn't noticed that TypeScript was omitted from the Update 3 patch notes, so it seems that it was an oversight that it wasn't listed.<br />\n<br />\nI don't know if this confirms that TypeScript VS plugin releases will be tied to the VS release cycle or not, but if the performance issue is fixed then there's probably not a ton more that needs to be integrated into VS for basic functionality (and for projects that need more they should probably consider grunt-ts or some other flexible build solution).<br />\n<br />\nJudahGabriel Himango said that the patch fixed his performance issues with VS freezing on a big project.<br />\n<a href=\"https://twitter.com/JudahGabriel/status/484459948886085632\" rel=\"nofollow\">https://twitter.com/JudahGabriel/status/484459948886085632</a><br />\n",
    "PostedDate": "2014-07-02T19:35:57.53-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1262376",
    "ThreadId": "550260",
    "Html": "Just been working with 1.0.3 and things work almost as fast as Ryan closing out new issues.<br />\n",
    "PostedDate": "2014-07-03T06:59:53.93-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1262377",
    "ThreadId": "550260",
    "Html": "<strong>nabog wrote:</strong><br />\n<blockquote>\nJust been working with 1.0.3 and things work almost as fast as Ryan closing out new issues.<br />\n</blockquote>\nNow <em>that</em> is funny!<br />\n",
    "PostedDate": "2014-07-03T07:05:23.563-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]