[
  {
    "Id": "936407",
    "ThreadId": "401864",
    "Html": "\r\n<p>Hi, after converting a bunch of JavaScript projects to TypeScript we have run into a significant problem.</p>\r\n<p>While every project builds successfully when built individually, we get build errors like those below when multiple projects (e.g. under a solution folder) are built in parallel:</p>\r\n<p>------ Rebuild All started: Project: <strong>MyProject</strong>, Configuration: Release Any CPU ------</p>\r\n<p>16&gt; &nbsp;Couldn't write to file '<strong>MyFile.js</strong>'16&gt;EXEC : tsc.js(21005, 21) Microsoft JScript runtime error :\r\n<strong>Permission denied</strong></p>\r\n<p>16&gt; MyProject.csproj(68,5): error MSB3073: The command &quot;&quot;C:\\Program Files (x86)\\Microsoft SDKs\\TypeScript\\0.8.0.0\\tsc&quot; --module amd &quot;<strong>File1.ts</strong>&quot; &quot;<strong>File2.ts</strong>&quot;&quot; exited with code 1.</p>\r\n<p>&nbsp;</p>\r\n<p>It is not difficult to see that two or more projects, which have common &lt;reference&gt; includes to a shared component, are failing when attempting to compile that shared component, because the output file for that component is locked up.</p>\r\n<p>How do we circumvent this problem?</p>\r\n<p>Thanks.</p>\r\n<p>Noel</p>\r\n",
    "PostedDate": "2012-11-04T13:25:15.48-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "936822",
    "ThreadId": "401864",
    "Html": "This discussion has been copied to a work item. Click <a href=\"http://typescript.codeplex.com/workitem/371\">here</a> to go to the work item and continue the discussion.",
    "PostedDate": "2012-11-05T09:38:01.393-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "958521",
    "ThreadId": "401864",
    "Html": "\r\n<p>I originally highlighted this for TS 0.8.0.0. The initial error was &quot;Permission denied&quot;.</p>\r\n<p>From 0.8.1.0 the error now is &quot;Write to file failed&quot;.<br>\r\n<br>\r\n<span>We don't use TFS (as highlighted by others in the issue) and we still get this error when building multiple projects.</span></p>\r\n<p><span>This is a significant problem because it is no longer possible to build a solution containing multiple TypeScript files.</span></p>\r\n<p>Is it possible to provide an indication of when this will be fixed?</p>\r\n<p><span>Thanks.</span></p>\r\n",
    "PostedDate": "2012-12-19T08:35:25.437-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "962167",
    "ThreadId": "401864",
    "Html": "\r\n<p>Do you get the same error if you use node to run tsc.js? That may help you work around the issue until we can address it.</p>\r\n",
    "PostedDate": "2012-12-20T08:04:34.017-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]