[
  {
    "Id": "1240318",
    "ThreadId": "543982",
    "Html": "I am trying to get TypeScript to work on a web site project in VS2013 Update 2RC.  The web site is the older web site project (WSP) format that does not have a project file but instead just automatically includes all files in the folder structure.  I do not get the &quot;TypeScript File&quot; option when I select &quot;Add&quot; in VS.  I manually added a .ts file but VS is not auto compiling to .js.  I was able to manually run &quot;tsc&quot; from the command line to compile but would like to the auto integration working.  Is this possible in a WSP?  I see instructions for entries to add to the project file but the web site doesn't have a project file.  Can the entries be added to the solution file instead?<br />\n",
    "PostedDate": "2014-05-01T10:45:50.297-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1245756",
    "ThreadId": "543982",
    "Html": "same problem, with new web site or web application project :(<br />\n",
    "PostedDate": "2014-05-15T08:01:16.427-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1246381",
    "ThreadId": "543982",
    "Html": "The TypeScript language service needs a project file to load all files in the project. The reason is to ensure that the language service experience matches the results of the build process. For websites a project file is obviously not present, and thus we can not tell how these files will be built at build time, and we do not have a way of knowing. You can inform the language service about the files in your compilation unit by using /// references. A simple approach is to have an index.ts that has references to all your files, and all your files have a reference to it. this way when you open any .ts file in your project the language service can follow your /// references and find all other files in the project. your can also use the index.ts in your build script, and the compiler will walk the references at build time.<br />\n",
    "PostedDate": "2014-05-16T17:36:23.24-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1279793",
    "ThreadId": "543982",
    "Html": "I can create a typescript project just fine if I make it a project. But I have an existing web site in IIS (and I then mirror it on a server). I tried adding typescript and it created a solution and project file under &quot;documents&quot; (which is not ideal) but still offers me support for .ts files (no Typescript in Add New Item). Also I want to understand how to do both server side and client side Typescript in the same project. I already have default.aspx.cs\r<br />\n<br />\nI can explore it myself if there were a few hints as to the preferred approach -- starting with &quot;I open an IIS application without a *proj file in Visual Studio 2013&quot; and then .....<br />\n",
    "PostedDate": "2014-07-31T18:01:09.023-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]