[
  {
    "Id": "1086427",
    "ThreadId": "454936",
    "Html": "I recently updated all of my packages and tools.  Until recently TypeScript was part of WebEssentials.  I know it's been removed from WebEssentials, and I've downloaded and installed the 0.9.1 installer, but I must be missing a step.  I can create new TypeScript files, but they don't get compiled into JS files.  I've checked my setting in Tools &gt; Options but I don't see anything for TypeScript.\r<br />\n<br />\nI've searched around but haven't found anything on the subject - all references just say to download and install the 0.9.1 installer from Microsoft.\r<br />\n<br />\nI don't know if there are any compatibility issues, but my system is Win7 Pro, running VisualStudio Pro 2012 update 3.<br />\n",
    "PostedDate": "2013-08-29T18:05:38.147-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1086591",
    "ThreadId": "454936",
    "Html": "You need configure vs project to compile ts files:\r<br />\n<br />\n<a href=\"https://typescript.codeplex.com/wikipage?title=Compile-on-Save\" rel=\"nofollow\">https://typescript.codeplex.com/wikipage?title=Compile-on-Save</a>\r<br />\n<br />\nAlso every ts file should have buildAction = TypeScriptCompile<br />\n",
    "PostedDate": "2013-08-30T05:26:18.39-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1086917",
    "ThreadId": "454936",
    "Html": "Hi fabioparra,\r<br />\n<br />\nThanks for the tip.  The link seems to address compiling on save.  The problem I'm having is this not only are they not being compiled on saved - they aren't being compiled at all.  I have buildAction = TypeScriptCompile for each of the TypeScript files, yet doing a complete rebuild doesn't generate the .js files.  I went into Tools &gt; Options &gt; Text Editor &gt; TypeScript &gt; Project and turned automatic compile on, but they still weren't getting compiled.\r<br />\n<br />\nI then followed the instructions in the page you pointed me to, and added &lt;PropertyGroup&gt; and &lt;Import&gt; sections mentioned, and I'm now able to compile my TypeScript files into JavaScript files, but there still are some issues...<br />\n<ol>\n<li>I have to add:</li>\n</ol>\n<pre><code>    &lt;TypeScriptTarget&gt;ES5&lt;/TypeScriptTarget&gt;\n    &lt;TypeScriptIncludeComments&gt;true&lt;/TypeScriptIncludeComments&gt;\n    &lt;TypeScriptSourceMap&gt;true&lt;/TypeScriptSourceMap&gt;\n    ...\n    &lt;Import Project=&quot;$(MSBuildExtensionsPath32)\\Microsoft\\VisualStudio\\v$(VisualStudioVersion)\\TypeScript\\Microsoft.TypeScript.targets&quot; /&gt;</code></pre>\n\n...to every MVC project which is using TypeScript.  Not a big deal with the main project I'm working on (set it and forget it), but I constantly am creating new (temporary) MVC projects which I use to play around with and experiment with, and each time I do I have to re-add these configuration settings.<br />\n<ol>\n<li>\nPrior to the upgrade, opening a TypeScript file would display the TypeScript code and the generated JavaScript code side-by-side.  After upgrading, only the TypeSscript code is displayed.<br />\n</li>\n<li>\nPrior to the upgrade, if there was an error in an opened TypesScript file, the file would not compile and there would be an error in the JavaScript pane of the editor.<br />\n</li>\n<li>\nPrior to the upgrade, in the Solution Explorer window the .js and the .js.map files were nested within the .ts file.  They aren't any longer and if I wish to open either, I have to turn on &quot;show all files&quot;.<br />\n</li>\n</ol>\nSo, at the moment I have a workaround (thanks again for the tip, fabioparra), but this seems a little clunky and I liked it better when WebEssentials included support form TypeScript.  I haven't heard of anyone else mentioning this, so I'm wondering if everything is working correctly on my system.  I installed TypeScriptSetup.0.9.1.1 (from the installer provided by Microsoft).  Is there anything else I need to install?  Or are we supposed to add those config changes to each csproj we work on?\r<br />\n<br />\nThanks for the help,\r<br />\n<br />\nJeff<br />\n",
    "PostedDate": "2013-08-31T09:16:16.933-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1087061",
    "ThreadId": "454936",
    "Html": "@jeffb42, \r<br />\n<br />\nAfter 0.9.0.1 TypeScript no longer includes the generated JavaScript files. For me this is a good thing, most importantly because it doesn't clutter up source control.\r<br />\n<br />\nBoth points 1 and 3 that you make are to do with inspecting the output generated by the TypeScript compiler.\r<br />\n<br />\nOut of curiosity why do you need to do that? Are you worried that the generated JavaScript is wrong?\r<br />\n<br />\nI personally un-installed web essentials after the first week in October 2012 and haven't had a need for the features it provides since.\r<br />\n<br />\nThe number of times I actually have to inspect a generated JavaScript file has fallen to perhaps once a week (although we always see the output when debugging in the browser, because we don't use source maps). This is mostly to do with increased confidence in the TypeScript compiler as the bugs get fixed and things become more stable.\r<br />\n<br />\nRegarding the MVC project issue, I would move the TypeScript files out of the MVC project and have them as a separate <strong><em>TypeScript</em></strong> project: File &gt; New &gt; Project &gt; TypeScript &gt; HTML Application with TypeScript . The correct project settings are included automatically for you.<br />\n",
    "PostedDate": "2013-09-01T04:04:53.393-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1087987",
    "ThreadId": "454936",
    "Html": "Thanks nabog!\r<br />\n<br />\nI didn't realize that the TypeScript compiler no longer generating the JS files (and when it didn't I thought something was wrong).\r<br />\n<br />\nThanks,\r<br />\n<br />\nJeff<br />\n",
    "PostedDate": "2013-09-03T17:40:50.543-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]