[
  {
    "Id": "1062243",
    "ThreadId": "448486",
    "Html": "TypeScript is awesome, yes.  But the 0.9.0 build is seriously problematic.\r<br />\n<br />\nWe are using TypeScript heavily on my current application.  We have 20-40 .ts files.  When I open the solution in VS (after installing 0.9.0) VS just hangs.  I can see tsc.exe spiking in Task Manager (it looks like it's compiling ts files).  After about 10 minutes Visual Studio finishes loading and I can see tsc.exe has chilled out.\r<br />\n<br />\nWhen I uninstall 0.9.0 (replace with 0.8.3.1) this problem goes away.\r<br />\n<br />\nFor the record, I disabled the Web Essentials add-in.\r<br />\n<br />\nAlso, we are using a patched tsc.js because of a bug we found with the compiler.<br />\n",
    "PostedDate": "2013-06-27T18:30:03.457-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1063113",
    "ThreadId": "448486",
    "Html": "Finding a lot of problems here too. I tried 0.9.0 for a while, and noticed <strong>all eight CPU cores of my Core i7 at 100%</strong> when compiling TypeScript.\r<br />\n<br />\nI've also tried the patch today 0.9.0.1 to see if it would fix problems, but it's nowhere near as stable as 0.8.x was. I was getting invalid encoding for an existing TypeScript file that worked file with 0.8.2.\r<br />\n<br />\nI've now reverted to 0.8.2 and will wait to see what 0.9.1 is like when that arrives.<br />\n",
    "PostedDate": "2013-07-01T04:17:44.543-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1063240",
    "ThreadId": "448486",
    "Html": "Qurango - we changed how file encoding worked for 0.9.  Now, if there are ANSI characters (or characters above the ASCII standard), you will need to save the files as UTF-8.  This is part of the general syntax tightening we've done in the new compiler.\r<br />\n<br />\nYou should definitely not be seeing all cores being pegged at 100%, as only one instance of tsc.exe should ever be running at once.  Can you confirm that you're not using the WebEssentials add-in also?<br />\n",
    "PostedDate": "2013-07-01T10:04:54-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1063241",
    "ThreadId": "448486",
    "Html": "kingdango - this should not happen with Web Essentials disabled.  I'll add copy this to a work item.<br />\n",
    "PostedDate": "2013-07-01T10:10:46.353-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1063244",
    "ThreadId": "448486",
    "Html": "This discussion has been copied to a work item. Click <a href=\"https://typescript.codeplex.com/workitem/1288\" rel=\"nofollow\">here</a> to go to the work item and continue the discussion.<br />\n",
    "PostedDate": "2013-07-01T10:14:23.287-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]