[
  {
    "Id": "1092981",
    "ThreadId": "457002",
    "Html": "A common practice when using Express middleware is to augment the request and response objects with additional functions and variables for use by controllers and views. Given that these are applied in an adhoc fashion and therefore don't represent the primary signature of the request and response objects they are applied to, I'm curious what others are doing to work around this when accessing those augmentations in code. Casting? What else?<br />\n",
    "PostedDate": "2013-09-15T22:12:37.38-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1093010",
    "ThreadId": "457002",
    "Html": "Hi,\r<br />\n<br />\nI know what you are referring to. The best approach i have found is to simply extend the base interface http.ServerRequest / Response with your additional methods and vars. Working through the interface, you can type cast the 'object' into its appropriate type, and just add additional methods and vars on that interface as they become known. (casting is going to be unavoidable at some point)\r<br />\n<br />\nYou can also extend interfaces. So, you can just extend ExpressServerRequest with what you need.. <a href=\"https://github.com/borisyankov/DefinitelyTyped/blob/master/express/express.d.ts#L120\" rel=\"nofollow\">https://github.com/borisyankov/DefinitelyTyped/blob/master/express/express.d.ts#L120</a>.\r<br />\n<br />\nside note, you may be interested in this project. <a href=\"https://github.com/sinclairzx81/appex\" rel=\"nofollow\">https://github.com/sinclairzx81/appex</a>\r<br />\n<br />\ngood luck.<br />\n",
    "PostedDate": "2013-09-16T00:58:27.543-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1093012",
    "ThreadId": "457002",
    "Html": "Yeah I was thinking of casting to interfaces that extend the base express request type, which seems along the lines of your suggestion. I don't think I'd touch the core express definitions though (purity and all).\r<br />\n<br />\nI'll check out appex, thanks.<br />\n",
    "PostedDate": "2013-09-16T01:02:55.11-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]