[
  {
    "Id": "932015",
    "ThreadId": "400688",
    "Html": "\r\n<p>I realize that the ECMAScript 6 proposal currently uses &quot;export&quot; instead of &quot;public&quot;, but does anyone else find this to be problematic? Coming from other languages, I find this inconsistency between class members and module members extremely annoying.&nbsp;</p>\r\n<p>Perhaps TypeScript could support using &quot;public&quot;/&quot;private&quot; modifiers on classes within modules\r\n<em>in addition</em> to the &quot;export&quot; keyword? Other than the cost of implementation, does anyone see any other costs?&nbsp;</p>\r\n",
    "PostedDate": "2012-10-24T14:29:48.88-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "932048",
    "ThreadId": "400688",
    "Html": "\r\n<p>You can't just be adding ambiguous syntax to languages because they're not like other languages. There is altogether too much of this &quot;make TypeScript more like C#/<a href=\"http://VB.NET/Smalltalk\">VB.NET/Smalltalk</a>&quot; nonsense going on round here. It's\r\n a superset of ECMAScript with early support for syntax from v6 of that language. It's not a damn free-for-all.</p>\r\n",
    "PostedDate": "2012-10-24T15:59:56.747-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "932098",
    "ThreadId": "400688",
    "Html": "<blockquote style=\"border: solid .1em #ccc; font-style: italic; margin: .25em 1em 0 1em; padding: 0 .25em 0 .25em;\"><strong>markrendle wrote:</strong><br />\r\n<p>You can't just be adding <strong>ambiguous </strong>syntax to languages because they're not like other languages. There is altogether too much of this \"make TypeScript more like C#/<a href=\"http://VB.NET/Smalltalk\">VB.NET/Smalltalk</a>\" nonsense going on round  here. It's a <strong>superset </strong>of ECMAScript with early support for syntax from v6 of that language. It's not a damn free-for-all.</p>\r\n</blockquote>\r\n<p>\"ambiguous\" - not at all&nbsp;ambiguous, as Java, C#, C++ and many other languages use public/private access modifiers for classes. I don't believe TypeScript should be just like C#, but I also don't think it should handicap what features it can and can not have based on a committee over which it has no influence.</p>\r\n<p>\"superset\" - A superset contains <em>greater than or equal to</em>&nbsp;the number of features of the original language. Saying \"this can't be in the language because its not in ECMAScript\" is equivalent to saying TypeScript shouldn't exist at all.</p>\r\n<p>In my opinion, the \"export\" keyword is surprising and non-intuitive. <em>TypeScript already uses public and private modifiers to denote accessibility. </em>Why should it be any different for class accessibility?&nbsp;It's likely the word \"export\" was chosen by the committee simply because its the dual of \"import\" (which is used to load modules). This seems like a weak reason to add&nbsp;inconsistency&nbsp;into a language.&nbsp;</p>",
    "PostedDate": "2012-10-24T20:59:03.28-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "932326",
    "ThreadId": "400688",
    "Html": "\r\n<p>If the export keyword is used by ECMAScript and TypeScript adds the word public to mean the same thing, then you've got ambiguous syntax and you've changed ECMAScript instead of extending it. There is no difference between what you're suggesting and a VB\r\n programmer asking for Dim as an alternative syntax to var.</p>\r\n<p>A superset should not change something which already exists, it should be additive.</p>\r\n<p>TypeScript will gain wider acceptance if it stays close to the ECMAScript syntax. As soon as you start adding in arbitrary changes like the one you propose, you change the entire philosophy of the project and lose all the credibility that TypeScript is working\r\n so hard and so well to achieve.</p>\r\n<div>On Oct 24, 2012 11:59 PM, &quot;MgSam&quot; &lt;<a href=\"mailto:notifications@codeplex.com\">notifications@codeplex.com</a>&gt; wrote:<br type=\"attribution\">\r\n<blockquote style=\"margin:0 0 0 .8ex; border-left:1px #ccc solid; padding-left:1ex\">\r\n<div>\r\n<p>From: MgSam</p>\r\n<div>\r\n<blockquote style=\"border:solid .1em #ccc; font-style:italic; margin:.25em 1em 0 1em; padding:0 .25em 0 .25em\">\r\n<strong>markrendle wrote:</strong><br>\r\n<p>You can't just be adding <strong>ambiguous </strong>syntax to languages because they're not like other languages. There is altogether too much of this &quot;make TypeScript more like C#/<a href=\"http://VB.NET/Smalltalk\" target=\"_blank\">VB.NET/Smalltalk</a>&quot; nonsense\r\n going on round here. It's a <strong>superset </strong>of ECMAScript with early support for syntax from v6 of that language. It's not a damn free-for-all.</p>\r\n</blockquote>\r\n<p>&quot;ambiguous&quot; - not at all ambiguous, as Java, C#, C&#43;&#43; and many other languages use public/private access modifiers for classes. I don't believe TypeScript should be just like C#, but I also don't think it should handicap what features it can and can not have\r\n based on a committee over which it has no influence.</p>\r\n<p>&quot;superset&quot; - A superset contains <em>greater than or equal to</em> the number of features of the original language. Saying &quot;this can't be in the language because its not in ECMAScript&quot; is equivalent to saying TypeScript shouldn't exist at all.</p>\r\n<p>In my opinion, the &quot;export&quot; keyword is surprising and non-intuitive. <em>TypeScript already uses public and private modifiers to denote accessibility.\r\n</em>Why should it be any different for class accessibility? It's likely the word &quot;export&quot; was chosen by the committee simply because its the dual of &quot;import&quot; (which is used to load modules). This seems like a weak reason to add inconsistency into a language.\r\n</p>\r\n</div>\r\n<div>\r\n<p>Read the <a href=\"http://typescript.codeplex.com/discussions/400688#post932098\" target=\"_blank\">\r\nfull discussion online</a>.</p>\r\n<p>To add a post to this discussion, reply to this email (<a href=\"mailto:typescript@discussions.codeplex.com?subject=[typescript:400688]\" target=\"_blank\">typescript@discussions.codeplex.com</a>)</p>\r\n<p>To start a new discussion for this project, email <a href=\"mailto:typescript@discussions.codeplex.com\" target=\"_blank\">\r\ntypescript@discussions.codeplex.com</a></p>\r\n<p>You are receiving this email because you subscribed to this discussion on CodePlex. You can\r\n<a href=\"https://typescript.codeplex.com/subscriptions/thread/project/edit\" target=\"_blank\">\r\nunsubscribe or change your settings</a> on codePlex.com.</p>\r\n<p>Please note: Images and attachments will be removed from emails. Any posts to this discussion will also be available online at\r\n<a href=\"http://codeplex.com\" target=\"_blank\">codeplex.com</a></p>\r\n</div>\r\n</div>\r\n</blockquote>\r\n</div>\r\n",
    "PostedDate": "2012-10-25T04:49:36.783-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "933799",
    "ThreadId": "400688",
    "Html": "\r\n<p>Here, here Mark. Well said.</p>\r\n<p>@MgSam: Exports&nbsp;are very frequently paired with the concept of modules in many languages. Public/private belong to class definitions. Exports belong to modules. The are not at all the same thing - if you think modules and classes are the same concept,\r\n then you need to think about that some more. The export keyword is _highly_ intuitive.</p>\r\n<p>You complain about your perception of ambiguity, but the greatest irony is that your&nbsp;&quot;fix&quot; would introduce it for real.</p>\r\n",
    "PostedDate": "2012-10-29T06:34:40.673-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]