[
  {
    "Id": "1127578",
    "ThreadId": "470744",
    "Html": "According to <a href=\"https://typescript.codeplex.com/discussions/430537\" rel=\"nofollow\">this thread</a>, type information from the JsDoc comments is ignored in favor of the TypeScript type. Does that mean that if one method has multiple signatures, the same JsDoc comment will be shared between them? Or does each method signature need its own JsDoc comment?\r<br />\n<br />\nIt feels that documenting the method in the following way is too redundant:<br />\n<pre><code>/**                                                                 \nValidates the input\n@method\n@param input Input element\n@returns true if validation passed\n*/\nvalidateInput(input: Element): boolean;\n/**\nValidates the input\n@method                                                             \n@param input Input element\n@returns true if validation passed\n*/\nvalidateInput(input: JQuery): boolean;\n</code></pre>\n\n... however that argument doesn't make sense if the same method has different behavior depending on its arguments (which is arguably a good API, but may exist)<br />\n",
    "PostedDate": "2013-11-21T08:15:17.58-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1127982",
    "ThreadId": "470744",
    "Html": "You've got it - it's intended that each overload would be documented separately.  As you point out, this gives you the flexibility to talk about when an overload is doing something different with the input (as might happen in libraries like jQuery), though like you say, this also means that you need to repeat yourself in the cases where the overloads function the same way.<br />\n",
    "PostedDate": "2013-11-22T09:19:29.593-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1288107",
    "ThreadId": "470744",
    "Html": "Hi. jonturner is probably right. This is intended feature. But...\r<br />\n<br />\nPlease take a look at this function. <a href=\"https://github.com/digitalbazaar/forge/blob/master/js/rsa.js#L802-L885\" rel=\"nofollow\">https://github.com/digitalbazaar/forge/blob/master/js/rsa.js#L802-L885</a> As you can see from comments there are a lot of ways to use it. If I need to make a type definitions for it (actually I do) with JSDoc Intellisense support, then I have to copy general function description like 10 times. This will make my definition 3 times longer than source function and also very hard to modify. In libraries like forge almost all functions have being made that way.\r<br />\n<br />\nCan you give me some tip about making definitions in such circumstances?<br />\n",
    "PostedDate": "2014-08-08T09:31:29.533-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1288109",
    "ThreadId": "470744",
    "Html": "Indeed, it would be useful if comments from one overload were inherited to others if they don't have more specific ones.<br />\n",
    "PostedDate": "2014-08-08T09:40:00.133-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]