[
  {
    "Id": "1058367",
    "ThreadId": "447463",
    "Html": "First off, a <em>huge</em> thank you to all of you who helped alpha and beta test 0.9 before it was released.  This helped tremendously in making sure the compiler and language service rewrite, along with all the new features, met the quality bar that we need as a community.  Your ongoing feedback is crucial in helping to shape the language and the tools.\r<br />\n<br />\nThe 0.9 release is now out the door, you can read more about it on our <a href=\"http://blogs.msdn.com/b/typescript/archive/2013/06/18/announcing-typescript-0-9.aspx\" rel=\"nofollow\">blog</a>.<br />\n\r<br />\nOne caveat for those who did do alpha/beta testing: we removed an experimental optimization in order to drive to a more stable release.  This optimization helped interactivity considerably, so you may notice that the 0.9 release, while much improved over 0.8 especially for large projects, is slower than the alpha or beta.  We're hoping to focus on optimizations now that the new architecture is in place.\r<br />\n<br />\nThanks again for all the time and energy you've put into this project.  It wouldn't be where it is today without your help.<br />\n",
    "PostedDate": "2013-06-18T12:25:44.977-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1058368",
    "ThreadId": "447463",
    "Html": "Thank you for the new release, for generics, for <code>export =</code>, etc. TS it's like a fresh breeze for us, .NET'ers, in the JS dynamic and unpredictable world. Looking forward for compilation speed improvements.<br />\n",
    "PostedDate": "2013-06-18T12:36:12.83-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1058369",
    "ThreadId": "447463",
    "Html": "I should clarify.  For 0.9, the interactive speed is faster than 0.8, though the new architecture is slower for compilation times.  We're working in improving this, and you should be able to follow the progress here using the 'develop' branch as those changes land.<br />\n",
    "PostedDate": "2013-06-18T12:39:48.583-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]