[
  {
    "Id": "934012",
    "ThreadId": "401173",
    "Html": "\r\n<p>I normally stay clear of all&nbsp;things Microsoft. I also groaned a little when I first heard about this project. &nbsp;But after taking time to look things over, I'm becoming a TypeScript convert.</p>\r\n<p>&nbsp;</p>\r\n<p>Things I like ..</p>\r\n<p>1. Output is JavaScript. &nbsp;Human Readable, <strong>Human Editable JavaScript!! OMG!!</strong></p>\r\n<p>2.&nbsp;Declaration&nbsp;files for&nbsp;existing&nbsp;JS. The&nbsp;--declarations flag on tsc is also very&nbsp;useful.</p>\r\n<p>3.&nbsp;Interfaces&nbsp;as signatures. &nbsp;</p>\r\n<p>3.5. &nbsp;Giving object literals inferred&nbsp;Interfaces&nbsp;</p>\r\n<p>4. Switching between AMD and commonjs at compile-time</p>\r\n<p>5. Inline with future ES standards. &nbsp;Arrow syntax!</p>\r\n<p>6. The ability to unify a JS style within a group.</p>\r\n<p>&nbsp;</p>\r\n<p>I've not been impressed by Darts (and Coffeescript's) sloppy JS output.&nbsp; I believe TypeScript has a bright future as long as it&nbsp;keeps to a rule that its output is Human Readable,&nbsp;Human Editable JavaScript. I believe the JS output today by\r\n TSC could not be&nbsp;identified&nbsp;as generated JS by a JavaScripter&nbsp;unfamiliar&nbsp;with TypeScript, &nbsp;things need to stay this way. ;)</p>\r\n<p>Please, please don't start throwing the kitchen sink of features at TypeScript. &nbsp;It's a perfect start. Future development should only been minor tweak here and there. &nbsp;Please don't cave to&nbsp;pressure&nbsp;to add a features that doen't match\r\n the (perceived) mission of TypeScript.</p>\r\n<p>&nbsp;</p>\r\n<p>Thank you!</p>\r\n<p>&nbsp;</p>\r\n<p>P.S. &nbsp;Intellisense&nbsp;for Mac (Intellisense for&nbsp;Sublime Text 2) ;)</p>\r\n",
    "PostedDate": "2012-10-29T17:21:04.047-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "934386",
    "ThreadId": "401173",
    "Html": "<p>Thanks for the compliments and suggestions</p>",
    "PostedDate": "2012-10-30T13:09:21.82-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]