[
  {
    "Id": "1109658",
    "ThreadId": "462853",
    "Html": "EDIT: to be more clear I am asking for this feature to be introduced in typescript.<br />\n<br />\nWe are building a library for typescript. It is intended for non-programmers and the users will spend most of the time setting properties and calling parametrized methods from the library.<br />\n<br />\n(A version of the library was Previously done in VBA). There With keyword usage was something very easy for users to understand and improved code readability/understandability a lot. <br />\n<br />\nWill something like below be possible in TypeScript?<br />\n<br />\nWith class{<br />\n .property = 123;<br />\n .MethodA (parameter);<br />\n .MethodB (parameter);<br />\n  globalVariable = .ReadResult();<br />\n.......<br />\n}<br />\n",
    "PostedDate": "2013-10-20T04:27:33.373-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1109730",
    "ThreadId": "462853",
    "Html": "\r\n<div>No, there is no &quot;with&quot; keyword and nothing like it.</div>\r\n<div><br>\r\n</div>\r\n<div>I'm not at all sure TypeScript is the best language for non-programmers to be using, since it is essentially a slightly-more-complicated version of JavaScript, which is itself a pretty complicated language.</div>\r\n<br>\r\n<br>\r\n<div id=\"orc-email-signature\" style=\"display:block\"><br>\r\n<div>—<br>\r\nSent from <a href=\"https://www.dropbox.com/mailbox\">Mailbox</a> for iPad</div>\r\n</div>\r\n<blockquote>\r\n<div id=\"ThreadNotificationFooter\"></div>\r\n</blockquote>\r\n",
    "PostedDate": "2013-10-20T11:03:36.52-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1109741",
    "ThreadId": "462853",
    "Html": "Maybe I should have put it another way, more clearer this time... will there be any support for a with keyword? I found it extremely useful on vba. All the non-programmers loved it because it was so spoken language like, improved readability and save a lot of typing.\r<br />\n<br />\nSide Note: As for typescript being hard on non programers... In my particular case the users will set some values to the custom library members and call some functions with parameters. That's all.<br />\n",
    "PostedDate": "2013-10-20T12:33:24.027-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1110163",
    "ThreadId": "462853",
    "Html": "JavaScript, and thus TypeScript, already has a 'with' statement but it generally leads to pain (<a href=\"http://yuiblog.com/blog/2006/04/11/with-statement-considered-harmful/\" rel=\"nofollow\">http://yuiblog.com/blog/2006/04/11/with-statement-considered-harmful/</a>). In TypeScript if you use a 'with' statement then anything within it will be resolved to type 'any' and you will lose a lot of the nice typechecking the language provides. You could instead use a simple var or import alias to shorten names where applicable, but you won't have the same syntax with a name preceded by a dot. \r<br />\n<br />\nAs far as I can tell the VBA syntax is barely any different from using a normal constructor but with named arguments (which TypeScript does not support), though even without them the Visual Studio completion help will fill in the blanks similarly as far as parameter names go.<br />\n",
    "PostedDate": "2013-10-21T11:34:18.753-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]