[
  {
    "Id": "1247925",
    "ThreadId": "546114",
    "Html": "LS,\r<br />\n<br />\nI have a Windows 8.1 machine with VS2013 and VS2012 installed.\r<br />\n<br />\nToday I installed the VS update 2 (real version not RC). I checked, but no Typescript template.\r<br />\n<br />\nI checked the Typescript website and installed Node.JS so that I could run: npm install -g typescript.\r<br />\n<br />\nAgain, no Typescript template (not on VS2012 and not on VS2013).\r<br />\n<br />\nI looked for a specific installation and after some searching I found version 1.0.1 as a download on a MS site.\r<br />\n<br />\nInstalled it, but again no Typescipt template.\r<br />\n<br />\nThan I read that you can run file with the VSIX extention. All very nice and it probably was included in in the 0.9 version, but I couldn't find that file at the specified location and I did find other Typescript files at that location.\r<br />\n<br />\nThan I read that you could unzip the MSI file and that this would reveal the .vsix file. Well the download offered from MS was an exe file and not a MSI file and when I unzip that exe file I get about 41 files with useless names.\r<br />\n<br />\nBesides that I have VS2013 and VS2012 on that system, it is nothing special. \r<br />\n<br />\nAnd no matter what I tried I don not get any typescript templates (if I am correct there would be a HTML version and a MVC version) not in VS 2012 and not in VS2013.\r<br />\n<br />\nDoes anyone have any suggestions as to what to try next??\r<br />\n<br />\nI would like to take Typescript for a test drive, but they make it close to impossible for me to do so.\r<br />\n<br />\n<br />\nKind regards,\r<br />\n<br />\n<br />\n<br />\nClemens Linders<br />\n",
    "PostedDate": "2014-05-21T06:13:01.427-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1247953",
    "ThreadId": "546114",
    "Html": "@Clemens\r<br />\n<br />\nTypeScript comes in-box with Visual Studio 2013 Update 2, so you shouldn't have to install anything extra to be able to create a TypeScript project. When you open a .ts file in VS, do you get syntax highlighting and intellisense?  If not it sounds like it's possible Update 2 did not update cleanly. \r<br />\n<br />\nJust to be clear, the npm package is not needed for using TypeScript from VS. It's a separate way of getting TypeScript targeting npm users. It doesn't contain the VS plugin. <br />\n",
    "PostedDate": "2014-05-21T07:07:13.187-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1247979",
    "ThreadId": "546114",
    "Html": "I would suggest to rerun the install and select &quot;repair&quot;.<br />\n",
    "PostedDate": "2014-05-21T07:45:22.37-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]