[
  {
    "Id": "1033135",
    "ThreadId": "440943",
    "Html": "I've just been getting into typescript, due to being much more comfortable with C# than Javascript, and so I've been trying to rewrite my small game library to use TS and canvas rather than XNA. I've gotten a few classes written up, and now i'm trying to use them in another TS project.\r<br />\n<br />\nTo keep things simple, I've put my classes into the new project directly, in the GameLib/Core/... folder. Now when I try to use this in my app, I can't get it to recognise these classes. Using:<br />\n<pre><code>/// &lt;reference path=&quot;GameLib\\Core\\Engine.ts&quot;&gt;</code></pre>\n\nWhich doesn't error, but I can't access the Engine class, or the &quot;Core&quot; module that it is within. Any ideas what I'm doing wrong?<br />\n",
    "PostedDate": "2013-04-19T09:57:36.61-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1033381",
    "ThreadId": "440943",
    "Html": "Obviously the first thing to ask is if you have your path right. Double check, because we all make dumb mistakes (I know I sure have). The next thing is that I noticed that you don't close your reference tag <code>&lt;reference ... /&gt;</code>. I have no idea if that even matters, but mine are always closed. Finally, if all else fails, you definitely might have found a bug in the compiler. I know that I've gotten some really weird scoping bugs before, so it's not impossible. If you're using Visual Studio, try to compile the code from the command line using <code>tsc</code> directly, that way you can be sure it's not a bug in the VS plugin.<br />\n",
    "PostedDate": "2013-04-20T08:17:31.173-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1033387",
    "ThreadId": "440943",
    "Html": "<strong>GJK wrote:</strong><br />\n<blockquote>\nThe next thing is that I noticed that you don't close your reference tag <code>&lt;reference ... /&gt;</code>. I have no idea if that even matters, but mine are always closed.<br />\n</blockquote>\nYep, that was the problem... mistake on my end xD<br />\n",
    "PostedDate": "2013-04-20T08:41:24.86-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]