[
  {
    "Id": "1035912",
    "ThreadId": "441628",
    "Html": "Collapse to definition (Edit -&gt; Outlining -&gt; Collapse to Definitions) is an extremly useful feature when it comes to getting an overview of the code structure in a file. When you do it in C# you get your code collapsed to the level of method signatures. In TypeScript version 0.8. it worked the same way. Now in version 0.9 it collapses to the topmost module, leaving one just element in the document and hiding everything else effectively rendering this feature useless.\r<br />\n<br />\nAt first I though it a bug, because<br />\n<ul>\n<li>there is not much sense in collapsing everything</li>\n<li>\nyou can achieve the same by running &quot;Toggle all Outlining&quot; (Edit -&gt; Outlining -&gt; Toggle all Outlinig&quot;<br />\n</li>\n</ul>\nSo I created a bug (<a href=\"https://typescript.codeplex.com/workitem/954\" rel=\"nofollow\">https://typescript.codeplex.com/workitem/954</a>) which was closed on the same day with the following reason:\r<br />\n&quot;This is by design.. it collapses the code to the definition of the module.&quot;\r<br />\n<br />\nI hope it's some sort of mistake, and you guys didn't really mean it's by design, so the bug should be reopened.\r<br />\n<br />\nOr... please give me a clue why you did it this way\r<br />\n<br />\nThank you<br />\n",
    "PostedDate": "2013-04-25T20:31:49.357-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1036082",
    "ThreadId": "441628",
    "Html": "I agree, seeing only the module and not the first level of its members seems less useful.  I'll reopen and assign to me for further investigation.<br />\n",
    "PostedDate": "2013-04-26T07:09:06.567-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1073227",
    "ThreadId": "441628",
    "Html": "I'd also like to be able to collapse nested functions.<br />\n",
    "PostedDate": "2013-07-25T15:39:52.033-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]