[
  {
    "Id": "1246601",
    "ThreadId": "545691",
    "Html": "Hello, I am trying to create a little typescript fork that add a new syntax element to the language.<br />\n<br />\nI don't understand the test strategy of the typescript compiler:<br />\nFor example what are Fidelity test and when should they be preferred to normal test cases ?<br />\nSame question for Fourslash tests ?<br />\n<br />\nAlso the diagnostic code seems to be generated, but the repository does not seems to contain the script generating them, should I had my new diagnostic code manually ?<br />\n<br />\n<br />\nRegards,<br />\nFrançois de Campredon<br />\n",
    "PostedDate": "2014-05-18T03:04:13.393-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1247096",
    "ThreadId": "545691",
    "Html": "Fidelity tests are only for the parser. Fourslash tests are for language service features (ex if you were adding a 'protected' keyword you would write fourslash tests to verify the completion list shows and doesn't show the protected member in various places). The tests in .../tests/cases/compiler and /tests/cases/conformance are for verifying error messages, type checking, and emit (obviously these then also verify parsing at a high level and you likely don't need to write Fidelity tests). <br />\n",
    "PostedDate": "2014-05-19T11:46:51.407-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1247133",
    "ThreadId": "545691",
    "Html": "Ok thanks a lot for your answer.\r<br />\nAnd for the diagnostic codes ? do you manage them manually or do you generate them ?<br />\n",
    "PostedDate": "2014-05-19T12:46:57.597-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1247141",
    "ThreadId": "545691",
    "Html": "We do have some scripts we use for that which we're currently in the process of cleaning up for checkin to the public repo. In the meantime you'll just have to manage them manually unfortunately.<br />\n",
    "PostedDate": "2014-05-19T13:13:01.037-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1247153",
    "ThreadId": "545691",
    "Html": "OK thanks a lot for your time, I guess I'll wait for this part.<br />\n",
    "PostedDate": "2014-05-19T13:42:44.027-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]