[
  {
    "Id": "1057894",
    "ThreadId": "447322",
    "Html": "It`s only me or other have noticed very low speed of TS 0.9 Beta compiler? In conjunction with WebEssensials 2012 it takes about 3-5 seconds when compiling one file.\r<br />\nThe latest 0.8.3.1 freezes as well when compiling about 50 .ts files.<br />\n",
    "PostedDate": "2013-06-17T12:15:38.867-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1058402",
    "ThreadId": "447322",
    "Html": "The 0.9 compiler is rewritten to have a much more flexible architecture and better interactive performance.  Part of this work unfortunately had some compile speed regressions, which we're working to address those in future releases.<br />\n",
    "PostedDate": "2013-06-18T13:51:53.627-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1059272",
    "ThreadId": "447322",
    "Html": "Thanks for reply. I've noticed that tcs.exe starts as many another tsc.exe instances as many .ts files are compiled. And each such instance consumes 50-100Mb of memory. Is there any solution to limit TS compiler instances amount at this time, as it really isn't usable to compile a project with 50+ ts files, it freezes for 15 seconds (moreover, overall computer become frozen) on each compilation.<br />\n<br />\nPS. I`m using 0.9 release, not beta now.<br />\n",
    "PostedDate": "2013-06-20T09:26:57.273-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1073714",
    "ThreadId": "447322",
    "Html": "I second this one: very-very slow.\r<br />\nThe higher the file is in the hierarchy (i.e. the more other files it references), the slower it compiles.\r<br />\nSome of my higher level files take as long as 30 seconds!\r<br />\n<br />\nAre there any news on this in the develop branch?\r<br />\nIs there an issue that I can upvote?<br />\n",
    "PostedDate": "2013-07-26T16:10:55.193-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1073769",
    "ThreadId": "447322",
    "Html": "I found the reason of such slowdown - Web Essentials 2012. By default is has the 'Compile <strong>all files</strong> on build' option enabled which causes it to run a <strong>separate</strong> TS compiler per each .ts file in the solution. Switching it off fixes this issue. TS by itself runs only one compiler instance for all specified .ts files which is great and fast.<br />\n",
    "PostedDate": "2013-07-27T00:23:16.023-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1076790",
    "ThreadId": "447322",
    "Html": "I agree that the compiler is very slow. We are starting the tsc from the script as described <a href=\"https://typescript.codeplex.com/discussions/450232\" rel=\"nofollow\">here</a>. It is bareable but not very fast at all. Can someone give us an estimate of when we can expect a better perfoming compiler. We would like to be able to decide to go back to 0.8 or not.<br />\n",
    "PostedDate": "2013-08-05T06:57:00.23-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]