[
  {
    "Id": "936000",
    "ThreadId": "401748",
    "Html": "\r\n<p>C# is already proven to be a great language, highly sophisticated and advanced, with awesome design-time tools, why not to benefit from all those tools, and honor existing developer knowledge? Will this be another showdown of Dart vs. TypeScript?</p>\r\n<p><a href=\"http://sharpkit.net/Live.aspx\">Here's a C# example for reference.</a></p>\r\n<p><a href=\"http://sharpkit.net/\"><br>\r\n</a></p>\r\n",
    "PostedDate": "2012-11-03T02:46:39.49-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "936152",
    "ThreadId": "401748",
    "Html": "<p>Do you really prefer to write the code on the left, instead of the code on the right?</p>",
    "PostedDate": "2012-11-03T13:59:07.24-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "936165",
    "ThreadId": "401748",
    "Html": "<p>Well, after managing and being involved in dozens of big JavaScript projects in the past 10 years, I can honestly say that I couldn't imagine my life without it. Of course that for a few lines of js you don't need it, but for that you don't need TypeScript as well. TypeScript, Dart, CoffeeScript and <a href=\"http://sharpkit.net\">SharpKit </a>are all solving the same problem: JavaScript productivity with large amounts of code. Try implementing a project with 10,000 lines of JavaScript code and then you tell me which side you prefer, the left or the right... :-)</p>",
    "PostedDate": "2012-11-03T14:20:49.21-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "936373",
    "ThreadId": "401748",
    "Html": "<p>I tried ScriptSharp and Saltarelle, and to be honest, at the time they were ok for me, but since TypeScript has come out, my preference definitely goes to TypeScript. C# language is just to much different from javascript. There are too many times you need to think about how the c# code has to be written to get the correct javascript equivalent. I'm no big fan of javascript but TypeScript makes it a lot better experience.</p>",
    "PostedDate": "2012-11-04T10:46:37.123-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "940893",
    "ThreadId": "401748",
    "Html": "\r\n<p>Typescript is meant to be a&nbsp;Super-set&nbsp;if JavaScript, not like CoffeeScript or Dart that merely translates into JavaScript... TypeScript comes from JavaScript and it returns to JavaScript... That is what I like about it, it gives regular JavaScript\r\n some structure...<br>\r\n<br>\r\nAnd most added features are taken from/inspired by/rooted in&nbsp;<span>ECMAScript 6&nbsp;</span>so that is fundamentally&nbsp;also&nbsp;aligned&nbsp;to JavaScript.<br>\r\n<br>\r\nSo when you state &quot;<span><span>honor existing developer knowledge?</span>&quot;... Well it&nbsp;DOES exactly&nbsp;that... developers here are just not&nbsp;referring&nbsp;to .NET/C# developers like you want, but instead the Core JavaScript developers out there...<br>\r\n<br>\r\nSo TypeScript does a very good job of <span>honoring&nbsp;</span>existing JavaScript developer knowledge out there.<br>\r\nAnd keep in mind that there are many &quot;NON-C#/.NET&quot; Developers out there that are using or can use TypeScript as well.&nbsp;</span></p>\r\n<p>I am a .NET/C# developer my self, and I do struggle with mistypes in both TypeScript and C# by now... however, I&nbsp;wouldn't&nbsp;have it any other way.</p>\r\n",
    "PostedDate": "2012-11-13T04:26:54.61-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "941208",
    "ThreadId": "401748",
    "Html": "\r\n<p>I think you posted on the wrong forum. The one you want is over here: <a href=\"http://scriptsharp.com/\">\r\nhttp://scriptsharp.com/</a></p>\r\n",
    "PostedDate": "2012-11-13T13:23:36.807-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]