[
  {
    "Id": "1201644",
    "ThreadId": "528623",
    "Html": "Hi. i'm using inheritance between two classes, the first (Lang) class declares a variable called _parse, of course, LangClient._parse doesn't exists. But I can't create it.\r<br />\n<br />\nerror TS2141: Class 'LangClient' cannot extend class 'Lang':<br />\n<pre><code>Types 'LangClient' and 'lang.Lang' define property '_config' as private.\n</code></pre>\n\nBut, just why? I declare a var private in the parent, I should be able to declare the same private in its childs.\r<br />\n<br />\nOkay, so what? I have to declare all my functions and attributes as public in the parent class if I want to the childs to be able to use them, but they are no private anymore...\r<br />\n<br />\nI think that we need a protected attribute, it's just impossible to make complex inheritance without the protected attribute...\r<br />\n<br />\nI don't want to make everything public to be able to use inheritance, that's really bad to do that, and that's what I did since the start because I didn't find any better solution. (Any solution at all actually...)<br />\n",
    "PostedDate": "2014-02-01T09:37:15.28-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1201649",
    "ThreadId": "528623",
    "Html": "Ok, I definitely don't get it.\r<br />\n<br />\nI use private attributes on methods and attributes, with the same inheritance.\r<br />\n<br />\nBut I improved my POO (better source code), so I don't call the private attributes/methods from the child.\r<br />\n<br />\nIt works... So, that means that even if they are private, the child get them.\r<br />\n<br />\nI'm not sure to understand everything here... Or, I'm pretty sure to don't understand anything at all.\r<br />\n<br />\nI guess the source code could help:\r<br />\n<br />\nLang (Parent)\r<br />\n<a href=\"http://pastebin.com/fqA0DCr1\" rel=\"nofollow\">http://pastebin.com/fqA0DCr1</a>\r<br />\n<br />\nLangServer\r<br />\n<a href=\"http://pastebin.com/2Y1TEdWf\" rel=\"nofollow\">http://pastebin.com/2Y1TEdWf</a>\r<br />\n<br />\nIf I wanted, from LangServer to call a private attributes/method, I'm sure I couldn't. So, what to do in this case? Because the improvment of my source code solved the issue, I don't call anymore private methods/attr directly from the child.\r<br />\n<br />\nWhat would be your solution if I had to do it?\r<br />\nThanks.<br />\n",
    "PostedDate": "2014-02-01T10:11:40.08-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1201650",
    "ThreadId": "528623",
    "Html": "This is a well known problem of typescript language. \r<br />\nYou need to choose a new name for private variable in the descendant.\r<br />\nThe second proble is the lack of protected members so all the properties are exposed to clients.\r<br />\nP.S. - You can not make them private because they will become inaccesible in derived classes.<br />\n",
    "PostedDate": "2014-02-01T10:14:56.063-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1201651",
    "ThreadId": "528623",
    "Html": "the only solution is to wait till the team will introduce protected members and maybe internal members.<br />\nP.S.  I'm crossing my fingers.<br />\n",
    "PostedDate": "2014-02-01T10:19:03.09-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]