[
  {
    "Id": "954085",
    "ThreadId": "406278",
    "Html": "\r\n<p>One of TypeScript's limiting factors seems to be its dependency on declaration files for popular frameworks such as jQuery, Bootstrap, D3, etc.</p>\r\n<p>I&nbsp;usually use&nbsp;DefinitelyTyped to locate my *.d.ts files, but I find they are often rapidly out-of-date with the latest release , inaccurate, and/or incomplete.</p>\r\n<p>The fact these need to be built by hand seems to be the issue. And it doesn't seem like many framework authors are investing the time in building them.</p>\r\n<p>I feel like TypeScript needs to automate building these files, or better yet, figure out a way to remove the dependency altogether. It would sweet if we could just reference .js files directly, and TypeScript dynamically builds the best declarations it can,\r\n and if it can't figure something out, then just &quot;any&quot; it.</p>\r\n<p>Thoughts?</p>\r\n<p>&nbsp;</p>\r\n",
    "PostedDate": "2012-12-10T09:56:00.657-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "954717",
    "ThreadId": "406278",
    "Html": "\r\n<p>The tension with having to maintain .d.ts files shows up a few places.&nbsp; Like you mention, it's up to the user to keep them up to date when using third-party .js libraries.&nbsp; It also comes up if you set up your project into subprojects and use the .d.ts files\r\n as the interface of each submodule.&nbsp; You'd have to make sure the .d.ts files stay up to date.</p>\r\n<p>The former, though, doesn't have a clean solution, at least not yet.&nbsp; We don't have a way yet of creating .d.ts from .js files, though there is some work going on now to make that easier (<a href=\"https://npmjs.org/package/jsdocts\">https://npmjs.org/package/jsdocts</a>&nbsp;for\r\n example).&nbsp; Likewise, if .js files pointed to the corresponding .d.ts files in a standard way, we could potentially support that.</p>\r\n<p>We can help with the latter by helping the user generate the .d.ts files as part of the compilation using the --declaration commandline option.</p>\r\n",
    "PostedDate": "2012-12-11T10:46:32.733-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]