[
  {
    "Id": "1045852",
    "ThreadId": "444245",
    "Html": "Hi All,\r<br />\n<br />\nAre you aware of any good resources around debugging TypeScript in Visual Studio?\r<br />\n<br />\nIn my situation I'm using Cassette ( <a href=\"http://getcassette.net/\" rel=\"nofollow\">http://getcassette.net/</a> ) to serve up my JavaScript to the browser - and maybe that's causing the issue.  The JavaScript I'm serving has been generated by my TypeScript. But for the life of me I've got no joy in getting Visual Studio to allow me to debug the TS when serving\r<br />\n<br />\nI'm wondering if I need to be serving up the *.js.map files as well?  I've tried it but it just generates errors.  (Fair enough - they're not legitimate script files I guess).  I can also see the following statement being generated which is map related:\r<br />\n<br />\n//@ sourceMappingURL=Index.js.map\r<br />\n<br />\nHowever, I've no clue what this is for.  Any idea of good places to look for info on this?<br />\n",
    "PostedDate": "2013-05-19T22:18:58.59-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1046064",
    "ThreadId": "444245",
    "Html": "The debugging support in TypeScript uses the source map format that a number of JS tools support, including browsers like Chrome as well.  The .map file maps from the output .js file back to the original .ts file.  If Visual Studio can't access the .map file, it won't be able to successfully debug directly on your original TS files.<br />\n\r<br />\nBy default, a new TypeScript HTML5 project will create a .map file as part of a debug build.  If you're using your own project not based on that template, you'll need to enable source map output yourself using the &quot;--sourcemap&quot; commandline option.<br />\n\r<br />\nI'm not familiar Cassette, though as you describe it may be introducing a layer of abstraction that's not compatible with the VS plugin.  It may be worth trying a simpler setup first to see if you can have success with that.<br />\n",
    "PostedDate": "2013-05-20T09:01:22.01-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1046302",
    "ThreadId": "444245",
    "Html": "That's a little frustrating.  I'm generating the map files and bundling them with Cassette but Visual Studio isn't picking up on it.  I have this:\r<br />\n<br />\n&lt;script src=&quot;/cassette.axd/asset/Scripts/Views/Home/Index.js?82d036dfdf39db3e4f486a9402dca05e83af0e03&quot; type=&quot;text/javascript&quot;&gt;&lt;/script&gt;\r<br />\n<br />\nAnd behind the scenes Index.js.map and Index.ts can be found too.   However, no joy with the TypeScript debugging.  This is a shame as the project I'm working on has a heavy reliance on Cassette.  Not sure what to do...  I could just rely on the JS debugging I suppose.<br />\n",
    "PostedDate": "2013-05-20T22:33:22.527-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1049069",
    "ThreadId": "444245",
    "Html": "Hi @JonTurner,\r<br />\n<br />\nI've been doing a little investigation on how we could get  TypeScript debugging to work with Cassette.  We've got a potential approach outlined at the end of this comment here: \r<br />\n<br />\n<a href=\"https://github.com/andrewdavey/cassette/issues/320#issuecomment-18488766\" rel=\"nofollow\">https://github.com/andrewdavey/cassette/issues/320#issuecomment-18488766</a>\r<br />\n<br />\nWhich to save you a click essentially says:\r<br />\n<br />\n&quot;... so my guess is that the VS debugger would hopefully play nice with Cassette if Cassette performed the following actions when serving in debug mode:<br />\n<ol>\n<li>\nCassette would need to amend the sourceMappingURL property of the generated JavaScript to point to the location of where Cassette was hosting the .js.map file.<br />\n</li>\n<li>\nCassette would need to amend the .js.map files file / and sources properties to reflect the location of where Cassette was hosting the .js and .ts files&quot;<br />\n</li>\n</ol>\nI don't suppose you'd know if the approach outlined above would likely work?\r<br />\n<br />\nI've been looking for some good documentation out there on how the Visual Studio Source Map debugging tooling works to confirm my theory but come up with nothing so far.  Any comments appreciated!<br />\n",
    "PostedDate": "2013-05-27T02:09:42.4-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]