[
  {
    "Id": "1122728",
    "ThreadId": "468418",
    "Html": "Hello,\r<br />\n<br />\nSince the TypeScript team is heads-down with coding right now and it's been a while since v0.9.1.1 was released, I figured that folks might find it useful to have an easy-to-use tool to help them grab and test out the latest TypeScript commits on the develop branch.  To assist with this, I've written a PowerShell script that I call &quot;TypeScript Canary&quot;.\r<br />\n<br />\n<a href=\"https://github.com/nycdotnet/TypeScriptCanary\" rel=\"nofollow\">https://github.com/nycdotnet/TypeScriptCanary</a>\r<br />\n<br />\nThis script uses Git and Node.js to clone/fetch the TypeScript develop branch from CodePlex, and allows you to select a specific commit to try out.  When you instruct it to use a commit, TypeScript Canary will back up your existing TypeScript version, checkout and compile the specified bits, and then overwrite your existing TypeScript bits with the built version.  Reverting to a previous version is as easy as finding the TypeScriptSourceCode\\backupTypeScriptFiles directory under your &quot;My Documents&quot; folder, opening the backup folder with the correct timestamp, and running the &quot;restore&quot; batch file there.\r<br />\n<br />\nPlease note that the latest bits from develop (v0.9.5) work great from the TSC compiler, but recent releases are not compatible with the old v0.9.1.1 VS plugin (the latest currently released).  As such, you have to test the very latest bits from the command-line or using some other compilation method.  If you want to use a more recent version than v0.9.1.1 in VS, commit <a href=\"https://typescript.codeplex.com/SourceControl/changeset/68cdf128fb5f61e95800f6ffa1c855e6dacc8514\" rel=\"nofollow\">68cdf128fb5f</a> from October 29 seems to mostly work in Visual Studio (I only noticed that the &quot;double dropdowns&quot; don't ever refresh).  Hopefully in the future, the TypeScript team will be willing to open source the plug-in (or at least provide nightlies in some fashion) so this could be improved further.\r<br />\n<br />\nNotes: This script will clone the TypeScript repo to your &quot;My Documents&quot; folder which will take approximately 2.5 GB; after the initial download, only deltas are pulled over the wire as with normal Git.  The TypeScript Canary script also requires that you have Node.js and Git installed and on the path.  Finally, if you're expecting Visual Studio integration, you will have had to already download and install the latest available official TypeScript plugin for Visual Studio - v0.9.1.1.\r<br />\n<br />\nUse this command to get everything set up and then follow the on-screen instructions from there:<br />\n<pre><code>powershell .\\GetLKGTypeScript.ps1\n</code></pre>\n\nIf you immediately get a PowerShell error, you may have to set up PowerShell to allow running local unsigned scripts: <a href=\"http://technet.microsoft.com/en-us/library/ee176961.aspx\" rel=\"nofollow\">http://technet.microsoft.com/en-us/library/ee176961.aspx</a>\r<br />\n<br />\nI hope that the TypeScript community finds this useful and I'd love to hear any feedback you may have.  Issue reports and pull requests accepted.\r<br />\n<br />\n-Steve Ognibene\r<br />\n@nycdotnet<br />\n",
    "PostedDate": "2013-11-12T21:04:17.46-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]