[
  {
    "Id": "1110523",
    "ThreadId": "463115",
    "Html": "Hey all,\r<br />\n<br />\nI want to debug my Typescript but I've hosted it within an MVC4 application. How can I tell the compiler to generate source maps? I know this is done for you when you create a Typescript HTML application.\r<br />\n<br />\nAdditionally, how can I tell the compiler to combine all my TS into a single JS file? It's annoying having to manually update my bundle every time I add a new TS file (and it's corresponding JS file).\r<br />\n<br />\nThanks!<br />\n",
    "PostedDate": "2013-10-22T05:56:56.597-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1111703",
    "ThreadId": "463115",
    "Html": "We're working on making this easier.  For the time-being, you'll need to unload your project, edit it, and add these lines with the other TypeScript* lines for your build type (Debug or Release)\r<br />\n<br />\nFor combining all the output into one .js file:\r<br />\n<br />\n&lt;TypeScriptOutFile&gt;myFile.js&lt;/TypeScriptOutFile&gt;\r<br />\n<br />\nAnd for turning on source maps:\r<br />\n<br />\n&lt;TypeScriptSourceMap&gt;true&lt;/TypeScriptSourceMap&gt;\r<br />\n<br />\nIf you edit the project for the default HTML5 application, you can get a better feel for the defaults it uses and what the XML looks like.<br />\n",
    "PostedDate": "2013-10-24T09:12:22.767-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1111905",
    "ThreadId": "463115",
    "Html": "Thanks! That worked. Now I'm running into a different issue that I thought was fixed (at least from what I read).\r<br />\n<br />\nIn my VS solution, I have a folder, Game, and in it are all my game classes. I thought I wouldn't need a reference to the individual files but it looks like I do because if I don't, I get compiler errors. I know there might be an issue with the declaration files, but the rest are all in the global scope which I thought are automatically referenced by TS.\r<br />\n<br />\nCould you shed some light on when/when aren't TS files auto-included as references?<br />\n",
    "PostedDate": "2013-10-24T18:52:03.807-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1112204",
    "ThreadId": "463115",
    "Html": "If you're inside of a TypeScript project (like the HTML5 template or a converted ASP.NET project), you should get all .ts files auto-referencing each other.  In old style projects that were made with TypeScript versions before, I believe, 0.9.1, the files would not auto-reference each other.  <br />\n",
    "PostedDate": "2013-10-25T11:17:21.747-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]