[
  {
    "Id": "1066685",
    "ThreadId": "449596",
    "Html": "I've never seen this until recently and now all of my computers are doing it.\r<br />\n<br />\nThe script maps for typescript debugging are causing IE to debug into that line as if it's executing a conditional comment or a razor directive.\r<br />\n<br />\nAny ideas what might be causing this?\r<br />\n<br />\nIE 11 doesn't do this, which I presume is because conditional comments are disabled out of quirks mode and thus it won't hit it.\r<br />\n<br />\nThanks!<br />\n",
    "PostedDate": "2013-07-10T10:00:34.203-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1066692",
    "ThreadId": "449596",
    "Html": "The recent source map spec recommends using //#, which I believe we've switched to in 0.9.1.  The recommendation I think avoids this very problem (though //@ is also still supported, it's not recommended)<br />\n",
    "PostedDate": "2013-07-10T10:36:30.113-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1066698",
    "ThreadId": "449596",
    "Html": "When's 0.9.1 coming? (0.9.0.1 seems to still gen //@ instead)<br />\n",
    "PostedDate": "2013-07-10T10:43:44.787-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1072829",
    "ThreadId": "449596",
    "Html": "Bump.\r<br />\n<br />\nThis is a pretty major issue because IE won't debug properly right now with typescript after the July patch tuesday patches for IE. Just errors on every page.\r<br />\n<br />\nReally need to get 0.9.1.0 out the door so that this is fixed.<br />\n",
    "PostedDate": "2013-07-25T08:04:38.307-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1072986",
    "ThreadId": "449596",
    "Html": "We don't generally give release dates, as we try to ship as the features get to the point they're ready for preview.  If you need fixes earlier, the compiler in the source repo should have the fix, which you can use as a stop-gap until we can get an official release out the door.  <br />\n",
    "PostedDate": "2013-07-25T11:59:32.007-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1077225",
    "ThreadId": "449596",
    "Html": "The problem is that right now as of the latest patch Tuesday, debugging isn't working in IE 10 because of this. It's a major issue. You guys at least need to release a point release that fixes the problem.<br />\n",
    "PostedDate": "2013-08-06T05:50:32.11-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1077711",
    "ThreadId": "449596",
    "Html": "Are the sourcemaps for 0.9.1, which I believe use //#, still cause debugging issues?  Just to be clear, neither IE10 nor IE11 support source maps, so we're just talking about debugging the JavaScript directly.<br />\n",
    "PostedDate": "2013-08-07T05:51:48.677-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1077811",
    "ThreadId": "449596",
    "Html": "0.9.1 now fixes the //#.\r<br />\n<br />\nBut IE does support typescript debugging directly into visual studio with the source maps. In IE 10 after the July patch tuesday, //@ got completely broken on the source maps being included and causes a debugger error in Vs.net on every single file. IE 11 beta ignores //@ entirely so you don't get any debugging at all prior to 0.9.1.\r<br />\n<br />\nHence until today, all Vs.net direct debugging into typescript was broken in IE fully patched.<br />\n",
    "PostedDate": "2013-08-07T09:12:09.613-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]