[
  {
    "Id": "920617",
    "ThreadId": "397711",
    "Html": "\r\n<p>Hi,</p>\r\n<p>Typescript looks great, so thanks a lot for sharing :)!</p>\r\n<p>One area where I can see it will be handy is handling complex objects passed from the server side to the client via json. On the server side I already have C# interfaces describing these objects, because I need the interfaces to write unit tests.</p>\r\n<p>On the client side, it would be very handy to be able to compile Typescript interfaces from those C# interfaces so I could regenerate them automatically with each compiler run.</p>\r\n<p>I know this is not possible yet, but I just wanted to make this suggestion in case it might be handy for other ASP.NET / MVC developers.</p>\r\n<p>Thanks,</p>\r\n<p>Adrian</p>\r\n",
    "PostedDate": "2012-10-02T07:44:06.31-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "920749",
    "ThreadId": "397711",
    "Html": "<p>At Microsoft we're also hard at work on the Roslyn project, which is <a href=\"http://msdn.microsoft.com/en-us/vstudio/roslyn.aspx\">out in CTP</a> and which offers a public&nbsp;high fidelity&nbsp;API over C# and VB source code. Based on Roslyn, anyone should be able to go build a converter from C# interfaces to TypeScript interfaces. I imagine that would be a very popular tool!</p>\r\n<p>Mads</p>",
    "PostedDate": "2012-10-02T10:50:06.073-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "920808",
    "ThreadId": "397711",
    "Html": "<p>well, if you have interface (in proper architecture always a separate assembly) you can using reflection and little coding write converter in no time.</p>",
    "PostedDate": "2012-10-02T12:30:32.523-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "941627",
    "ThreadId": "397711",
    "Html": "\r\n<p>+1</p>\r\n<p>This would be very useful in MVC scenarios when posting JSON that gets converted into C# POCOs on the server.</p>\r\n<p>This would be great to add to the Web Essentials project.</p>\r\n<p>&nbsp;</p>\r\n",
    "PostedDate": "2012-11-14T07:34:25.947-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "955721",
    "ThreadId": "397711",
    "Html": "\r\n<p>I hacked together a C# to TypeScript interface generator over here:&nbsp;<a href=\"http://typescript.codeplex.com/discussions/406685\">http://typescript.codeplex.com/discussions/406685</a></p>\r\n",
    "PostedDate": "2012-12-13T10:37:55.57-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]