[
  {
    "Id": "1073765",
    "ThreadId": "451570",
    "Html": "Hi,<br />\n<br />\nI ran into a problem when trying to work with version 0.9.0.1 in Visual Studio 2013 Preview:<br />\n<br />\nUsing the &quot;HTML Application with TypeScript&quot; project, template and type definition files for node.js and Express from the DefinitelyTyped repository, I tried to run a minimal script:<br />\n<br />\n/// &lt;reference path=&quot;./node.d.ts&quot; /&gt;<br />\n/// &lt;reference path=&quot;./express.d.ts&quot; /&gt;<br />\nimport express = require('express');<br />\nvar app = express();<br />\n<br />\nThe following warning message occurs: &quot;&quot;Unable to invoke type with no call signatures.&quot;.  Code completion does not work. For example, it fails when I try o complete &quot;app.g[et]&quot;<br />\n<br />\nTranspiling this file, however, works as expected.<br />\n<br />\nStrangely enough, the warning message disappears and code completion works for a brief period of time (a few seconds), when I switch from &quot;require('express');&quot; to  &quot;module('express');&quot; and then back to &quot;require('express');&quot;. After this brief period, the problems re-occur. <br />\n<br />\nAny help would be greatly appreciated as I am really looking forward to start developing in TypeScript.<br />\n<br />\nThanks,<br />\n<br />\nSebastian<br />\n",
    "PostedDate": "2013-07-26T23:48:15.127-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1073893",
    "ThreadId": "451570",
    "Html": "The following assignment appears to be working:\r<br />\n<br />\nvar app = &lt;Express&gt; express();<br />\n",
    "PostedDate": "2013-07-27T12:29:25.123-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1074889",
    "ThreadId": "451570",
    "Html": "What does express.d.ts have in it?<br />\n\r<br />\nYou can generally only call a module if what's returned from require is also callable.  With the older .d.ts files, this would not be the case as they returned only a single module.  With the newer compiler, there are typings that would let this work (using &quot;export =&quot; in the .d.ts file, for example), but I'm not sure yet if your express.d.ts uses the new style.<br />\n",
    "PostedDate": "2013-07-30T16:02:16.193-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]