[
  {
    "Id": "1237938",
    "ThreadId": "543304",
    "Html": "Is there actually any need to build / run tsc.exe during development?\r<br />\n<br />\nOr can i just rely on VS 2013 Update 2 doing its near instant compile-on-save?\r<br />\n<br />\nI gave it a try and in VS options i configured &quot;projects and solutions&quot; &gt; &quot;build and run&quot; &gt; &quot;On Run, when projects are out of date&quot; to &quot;Never build&quot;.\r<br />\n<br />\nThen instead of &quot;build&quot; + &quot;debug&quot;, i do &quot;save all&quot; + &quot;debug&quot;, and my build times went down from 18 seconds to about 0.05 seconds. Which was nice.\r<br />\n<br />\nSo far everything seems to work perfectly. Is relying entirely on the VS compile-on-save feature fine, or will i run into trouble?<br />\n",
    "PostedDate": "2014-04-25T03:23:34.957-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1238030",
    "ThreadId": "543304",
    "Html": "I'll let other people on here speak from experience, but in theory this should work fine. Compile-on-save works with the project settings, which should be the same rather you're building your project or doing the compile on save.  <br />\n",
    "PostedDate": "2014-04-25T06:51:52.013-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1239995",
    "ThreadId": "543304",
    "Html": "The only thing that may not work as well with that is when you reference external files (outside your project) and need to copy them into a sub-folder. For example, when you reference a lib during development, need to compile it, and copy it your own project. I do this via pre-build event, which requires a build. So it'll work great until I make a change to the lib, then I have to do a Rebuild to build both projects.\r<br />\n<br />\nOtherwise, compile on save has mainly always worked for me.<br />\n",
    "PostedDate": "2014-04-30T12:13:09.053-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]