[
  {
    "Id": "938095",
    "ThreadId": "402301",
    "Html": "\r\n<p>There is some discussion around external vs. internal modules that I wanted to post here to make sure that we aren't missing another aspect or using things incorrectly.</p>\r\n<p>There are people that are writing Backbone applications using a Backbone.d.ts. There are two use cases I want to discuss.</p>\r\n<ol>\r\n<li>Creating backbone applications with modules using an AMD loader (or CommonJS I suppose as well)\r\n</li><li>Creating backbone applications using plain JS </li></ol>\r\n<p>For those in camp 1, it is necessary that the backbone module be defined as external so that the module is able to be imported and included in the define() wrapper.</p>\r\n<p>For those in camp 2, it is necessary that the backbone module be defined as internal module in order to use the intellisense and\r\n<em>not</em>&nbsp;require the use of an import statement / define() wrapper.</p>\r\n<p>Is there some other way to define the module so that it can be used in both cases?</p>\r\n<p>I don't really want to have to create a fork just so that you can have either</p>\r\n<p>// required for those using import (1)<br>\r\ndeclare module &quot;Backbone&quot; {&nbsp;</p>\r\n<p>or</p>\r\n<p>// required for those not using import (2) and backbone already exists in the global scope<br>\r\ndeclare module Backbone {</p>\r\n<p>and still be able to get along with your code/intellisense.</p>\r\n",
    "PostedDate": "2012-11-07T10:46:52.103-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "944509",
    "ThreadId": "402301",
    "Html": "\r\n<p>anyone?</p>\r\n",
    "PostedDate": "2012-11-20T04:40:04.11-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "944673",
    "ThreadId": "402301",
    "Html": "\r\n<p>You might try your question on&nbsp;StackOverflow.&nbsp; Given that it's the holidays, and questions like these tend to get more eyes over there, you might have better luck.</p>\r\n",
    "PostedDate": "2012-11-20T09:02:35.173-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]