[
  {
    "Id": "994138",
    "ThreadId": "431412",
    "Html": "\r\n<p><span style=\"font-size:10pt\">We are actively building large-scale TypeScript projects, and are crippled by two critical bugs that are hampering our development efforts.</span></p>\r\n<p>Firstly, if a .js output file is marked as read-only on disk, the compiler fails the build. &nbsp;This is particulary painful when using TFS, as the output .js files MUST be part of a project in order to use Deployment Scripts through MSDeploy. &nbsp;Our\r\n build server often fails on this step, and it is nigh impossible to track down exactly which file is causing the issue.</p>\r\n<p>This issue has been reported here.</p>\r\n<p>http://typescript.codeplex.com/workitem/371</p>\r\n<p>Secondly, a large-enough TypeScript project will fail a build if the combined number of characters in the command line exceed 8192 characters. &nbsp;This issue is critical. &nbsp;Any project with more than 30 to 40 files will quickly break this barrier.\r\n &nbsp;We have been forced to break up our projects into many smaller ones to get around this issue. &nbsp; This problem causes issue #1.</p>\r\n<p>This second issue has been reported here:</p>\r\n<p>http://typescript.codeplex.com/workitem/597</p>\r\n<p>While I thoroughly agree that TypeScript is an excellent tool to tackle large-scale javascript development - without these two issues being fixed, we cannot create large multi-file projects, or use TFS ??</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n",
    "PostedDate": "2013-01-30T05:49:03.59-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "994214",
    "ThreadId": "431412",
    "Html": "\r\n<p>Thanks for the feedback.&nbsp; Looking at those two bugs:</p>\r\n<p>The first (#371) is slated to be fixed for the next release.&nbsp; I've gone ahead and updated the bug to reflect that.&nbsp;</p>\r\n<p>The second (#597) appears to already be fixed in the 'develop' branch.&nbsp; I see one changeset that addresses the issue (<a href=\"http://typescript.codeplex.com/SourceControl/changeset/4aab50018ab7\">http://typescript.codeplex.com/SourceControl/changeset/4aab50018ab7</a>),\r\n so the fix is in place but may not have been fully tested, yet.&nbsp; If you can, please let us know if this fixes the issue you were seeing.</p>\r\n<p>&nbsp;</p>\r\n",
    "PostedDate": "2013-01-30T08:38:27.847-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "994678",
    "ThreadId": "431412",
    "Html": "Hey jonturner,\r<br />\nMany thanks for your reply.<br />\nAm seriously looking forward to the next release - I just spent the past day and a half splitting 3 TypeScript Projects into 12 separate projects to get around the WScript 8192 issue.\r<br />\nWill have a look at the develop branch over the weekend to fix the .js issue.<br />\n",
    "PostedDate": "2013-01-31T06:24:29-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]