[
  {
    "Id": "920254",
    "ThreadId": "397613",
    "Html": "\r\n<p>Having used CoffeeScript a lot, JavaScript pre-processed languages can be challenging.&nbsp; It would be great if you could add native debug support in VisualStudio and WebMatrix.</p>\r\n",
    "PostedDate": "2012-10-01T15:27:38.213-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "920630",
    "ThreadId": "397613",
    "Html": "<p>+1. I think it's insane that in 2012, modern web development is stuck with second class debuggers; worse, with CoffeeScript (or TypeScript) we're not even debugging our source language.</p>\r\n<p>Being able to debug TypeScript inside the powerful Visual Studio debugger would be a huge boon and a compelling argument towards language adoption.</p>",
    "PostedDate": "2012-10-02T08:07:19.777-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "920652",
    "ThreadId": "397613",
    "Html": "<p>+1. I agree that it is not intuitive to have to set your breakpoints inside the <em>generated</em> javascript file(s) in order to get debugging to work from VS.</p>\r\n<p>NodeJS and CoffeeScript have similar difficulties with setting breakpoints easily, and as everyone in this thread has already mentioned, this feature would go a long way toward separating TypeScript from the rest and driving adoption.</p>",
    "PostedDate": "2012-10-02T08:37:34.497-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "920800",
    "ThreadId": "397613",
    "Html": "\r\n<p>&#43;1. I would even accept &quot;ugly&quot; generated js code if debugging TypeScript is possible, because then I just don't have to look at the js code (like I don't want to see the IL code when writing/debugging c# applications). Just give me comfort and I'll trust\r\n you ms ;)</p>\r\n",
    "PostedDate": "2012-10-02T12:15:14.817-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "922493",
    "ThreadId": "397613",
    "Html": "<p>I hear you.&nbsp; We're actively working to improve the Visual Studio plugin (including with better debugging).&nbsp; Thanks for the feedback!</p>",
    "PostedDate": "2012-10-05T08:42:13.623-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "922583",
    "ThreadId": "397613",
    "Html": "<p>See this:&nbsp;<a href=\"http://www.aaron-powell.com/web/typescript-source-maps\">http://www.aaron-powell.com/web/typescript-source-maps</a></p>\r\n<p>Guessing the blocker is that IE10 doesn't support source maps. Hope they get with the program.</p>",
    "PostedDate": "2012-10-05T11:26:47.287-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "928610",
    "ThreadId": "397613",
    "Html": "<p>SourceMaps are the way to go and chrome devtools supports them very well. Generated JS code should be as clean and human readable as possible. Additionally you CAN set breakpoint in your TS code using the debugger statement.</p>",
    "PostedDate": "2012-10-18T01:20:08.77-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "928755",
    "ThreadId": "397613",
    "Html": "<p>SourceMaps are indeed the way to go -- they're essentially .pdb for JS -- however, debugging in Chrome is not an ideal experience. Ideally, we could leverage the powerful debugging tools built into Visual Studio.</p>",
    "PostedDate": "2012-10-18T07:04:29.67-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]