[
  {
    "Id": "1026450",
    "ThreadId": "439328",
    "Html": "I know there is documentation on how to use internal builds (i.e. develop branch's LKG). But, the next release includes a considerable amount of changes. I tried using the develop branch's LKG a week or so ago and followed the instructions to swap out the TypeScriptServices.js and I also swapped out the lib.d.ts since there is now generics support. But the VS TS editor was not working at all, specifically intellisense. Does the latest develop branch contain to many changes to play around with the latest LKG due in VS? Are we able to swap out with the latest compiler etc. If so how do I do so or do we have to wait for an official release?\r<br />\n<br />\nKeep in mind that I just download the source code for the develop branch's LGK and copied and replaced the TypeScriptService.js and lib.d.ts in the installed directory. Do I need to follow the other method in the instructions to download from GitHub and compile myself, etc.?\r<br />\n<br />\nPlease help<br />\n",
    "PostedDate": "2013-04-05T20:33:51.17-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1026480",
    "ThreadId": "439328",
    "Html": "I doubt you can do it. I recently upgraded my own editor (Cats) from 0.8.x to the 0.9.x branch and noticed:\r<br />\n<br />\n1) The language services api has undergone some changes that are not backwards compatible (they are however changes for the better I think).\r<br />\n<br />\n2) Some of the methods are broken (they typically don't return all required info)\r<br />\n<br />\n3) Some of the methods even have dummy implementations like &quot;return [];&quot; instead of returning the actual data\r<br />\n<br />\nThe standalone compiler (tsc) in the develop branch is in a better shape. It at least compiles most code that contain generics and you can even run it afterwards. So I guess that is right now the easiest way to experiment with generics.<br />\n",
    "PostedDate": "2013-04-06T00:38:22.953-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1027298",
    "ThreadId": "439328",
    "Html": "@djarekg - exactly what jbaroncom says.  The 0.9.0 work in 'develop' is still in heavy flux, and the language service API is changing as part of that.  We're using a completely different approach to the language service now, and now that we've moved to it, things should start settling down.  We're looking into ways to make it easier to try it out the latest 'develop', like making an alpha version of the TypeScript Visual Studio plugin available.  We'll hopefully have more info on that in a couple weeks.<br />\n",
    "PostedDate": "2013-04-08T08:33:53.65-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]