[
  {
    "Id": "1077872",
    "ThreadId": "452725",
    "Html": "I'm having trouble using the 0.9.1 release in VS.  I have a large solution with a handful of projects some of where depend on others.  Upgrading form 0.9.0.1 there are some build errors (and they're all logical, no issues there) but while trying to fix them Visual Studio is hanging.  I find I can make about one significant change to the code okay; then another one and VS will hang for a while and eventually come back; on the next edit VS will gobble up CPU and eventually drop down to 0% usage but never come back.  It's like it's deadlocked.\r<br />\n<br />\nIs anyone else having a similar issue?  I tried fresh installs but that didn't fix anything.<br />\n",
    "PostedDate": "2013-08-07T10:54:19.287-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1077998",
    "ThreadId": "452725",
    "Html": "There are a couple bugs that appear to be related to certain .d.ts files (namely linq.d.ts) and certain patterns with generics.  These should be in the issue tracker, though please feel free to add a new issue if none match what you're seeing, so that we can look into it.<br />\n",
    "PostedDate": "2013-08-07T15:13:52.833-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1078010",
    "ThreadId": "452725",
    "Html": "I think I have a different problem because the code will actually compile at least once.<br />\n<blockquote>\nWindows 8 and 8.1 users of the Visual Studio plugin will also notice further performance improvements, as we've begun using the latest version of Chakra, the JavaScript engine, on those platforms.<br />\n</blockquote>\nI am on Windows 8.  Is there a way to fall back to the previous JavaScript engine?  Maybe that's the culprit.<br />\n",
    "PostedDate": "2013-08-07T16:26:13.823-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1078018",
    "ThreadId": "452725",
    "Html": "I'm finding that when I have any typescript error in the errors list window that VS2012 will sometimes lockup ( 1 cpu pegged at 100% ) if I hover over the line, especially if the message is very large.\r<br />\n<br />\nThe change in compiler arguments is also pain ( dropped &quot;-c&quot;) as we can't run both 9.0.1 and 9.1.0 in our dev team ( i'm testing the 0.9.1 drop but I can't compile without changing the arguments in the project file )<br />\n",
    "PostedDate": "2013-08-07T17:39:09.93-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1083188",
    "ThreadId": "452725",
    "Html": "I've been quiet on this issue because we've been busy here but in my spare moments I've been setting up clean VM instances of Windows 7 and Windows 8 to test TypeScript 0.9.1 on.  Win 7 doesn't seem to run nearly as efficiently as Win 8 on Hyper-V and there's a million updates to apply.\r<br />\n<br />\nUsing the exact same code base I made trivial edits suggested by tslint on Win 7 and then on Win 8.  The Win 7 instance had no issues besides Intellisense being slow (which I think is expected).  The Win 8 instance would slow down VS and finally crash within about 5 minutes consistently.  I think this is conclusive proof that there's a problem with the TypeScript plugin, and it's not a conflict with other extensions.\r<br />\n<br />\nI would guess that the issue is triggered by the size of the code base, but obviously I don't have permission to hand you my own.  It wouldn't be too hard to machine generate a code base of hundreds of classes to stress test the plugin/compiler.<br />\n",
    "PostedDate": "2013-08-21T09:29:15.46-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]