[
  {
    "Id": "1087173",
    "ThreadId": "455133",
    "Html": "I am trying to compile source code on the fly from JavaScript.\r<br />\nI have it working with an older version of TypeScript.\r<br />\n<br />\nBut the API have changed a lot in the latest version and there is suddenly no longer a setErrorCallback() method and the addUnit() method no longer takes two parameters (source and name).\r<br />\n<br />\nI have been trying to find the code used for the playground, but couldn't seem to find it.\r<br />\n<br />\nCan anyone give me an example of how to use the latest version of the TypeScript compiler with JavaScript?\r<br />\n<br />\nOr maybe guide me to where I can find the code used for compiling in the playground.\r<br />\n<br />\n<br />\nMartin<br />\n",
    "PostedDate": "2013-09-01T16:35:45.41-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1087473",
    "ThreadId": "455133",
    "Html": "lusbuab: Thanks, but I am not sure how that will work? There is no call to the TypeScriptCompiler ?\r<br />\n<br />\nWhat I am currently doing is something similar to this\r<br />\n<a href=\"https://gist.github.com/moyhig/3999602\" rel=\"nofollow\">https://gist.github.com/moyhig/3999602</a>\r<br />\n<br />\nIt works fine with an older version of the TypeScript Compiler, but the new one have a different API and etc. there is no longer a addUnit method that take 2 or 3 parameters, and other methods have been removed aswell.\r<br />\n<br />\nI can't seem to find any example for the new version and the documentation for the API is non-existing.<br />\n",
    "PostedDate": "2013-09-02T16:15:18.33-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1089009",
    "ThreadId": "455133",
    "Html": "Thanks for trying to help. :)\r<br />\n<br />\nBut I still don't get how to use it to compile TypeScript source to JavaScript source.\r<br />\nI don't want to write a language service. \r<br />\nI just want to use the compiler to compile stuff in memory (like in the gist i posted)\r<br />\n<br />\nThere is just no examples or documentation to be found anywhere for the latest version.<br />\n",
    "PostedDate": "2013-09-05T15:11:30.583-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1089325",
    "ThreadId": "455133",
    "Html": "The test automation is one example of using the compiler APIs. You can find it in src\\harness\\harness.ts and its used in tests\\runners\\compiler\\runner.ts.\r<br />\n<br />\naddUnit is now addSourceUnit and takes the contents in the form of a ScriptSnapshot (which you can generate from a string via TypeScript.ScriptSnapshot.fromString).\r<br />\n<br />\nI don't recall setErrorCallback offhand but you can see how we use the error reporting APIs in HarnessCompiler.reportCompilationErrors in the aforementioned harness.ts. <br />\n",
    "PostedDate": "2013-09-06T12:03:25.593-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]