[
  {
    "Id": "1024821",
    "ThreadId": "438941",
    "Html": "Signals are a light-weight, strongly typed messaging tool and we use them extensively in our game framework. And we’ve just released our TypeScript implementation for others to benefit from. It’s a conversion of js-signals by Miller Medeiros, which is of course in turn a conversion of AS3-Signals by Robert Penner.\r<br />\n<br />\nYou can get TypeScript-Signals from github.\r<br />\n<br />\nIf you are unfamiliar with Signals, how they work and how they compare to Events then this short summary is well worth a quick read, but to summarise:<br />\n<ul>\n<li>A Signal is essentially a mini-dispatcher specific to one event, with its own array of listeners.</li>\n<li>A Signal gives an event a concrete membership in a class.</li>\n<li>Listeners subscribe to real objects, not to string-based channels.</li>\n<li>Event string constants are no longer needed.</li>\n<li>\nSignals are inspired by C# events and signals/slots in Qt.<br />\n</li>\n</ul>\nI ported over all of the 18 unit tests to TypeScript as well. So you have plenty of examples: from adding a basic listener up to manual binding and dynamic context switching.\r<br />\n<br />\n<a href=\"http://www.photonstorm.com/archives/9826/typescript-signals-released-think-outside-the-event\" rel=\"nofollow\">http://www.photonstorm.com/archives/9826/typescript-signals-released-think-outside-the-event</a><br />\n",
    "PostedDate": "2013-04-03T06:14:07.453-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1024984",
    "ThreadId": "438941",
    "Html": "I made a TS definition file for my SignalsLite.js - another JS version of AS3 Signals. I was actually planning to rewrite that for fun (with a slightly different API) in TypeScript to try to get greater type enforcement and even better performance out of it (it's no slouch now though), but it looks like you beat me to it! It's cool to see the pattern alive and well outside of AS3. :-)\r<br />\n<br />\n<a href=\"https://github.com/CaptainN/SignalsLite.js\" rel=\"nofollow\">https://github.com/CaptainN/SignalsLite.js</a><br />\n",
    "PostedDate": "2013-04-03T10:10:15.233-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1025016",
    "ThreadId": "438941",
    "Html": "I'm not a huge fan of using definition files so prefer to recode into TypeScript, so it's all operating under the same roof so to speak - but nice work on SignalsLite :) I've been really impressed with how well TS Signals performs, which is all thanks to the js-signals author and Rob Penner really. They're just so more flexible and better than events.<br />\n",
    "PostedDate": "2013-04-03T11:12:02.15-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]