[
  {
    "Id": "1201606",
    "ThreadId": "528607",
    "Html": "Hi,\r<br />\n<br />\nI cloned the source with the intention of having a tinker, but am getting a bit stuck in determining the best way to setup an environment so I can actually edit and debug the source.\r<br />\n<br />\nWhat tools and IDE(s) do the developers usually use when working on the source. How do they setup their environment to facilitate easy debugging and running and creating unit tests? Do they feed the latest version of compiler back into compiling the next version of the compiler. Are the jake scripts called during development or is that primarily for the an final build?\r<br />\n<br />\nAdditionally is there documentation on the internal workings of the compiler, there is lots of information on the specification and how to use Typescript but would be nice to have something about the internals. A description of the major components of the compiler itself and how they interact would be useful, or even details on the compilers javascript API would be nice\r<br />\n<br />\nAny guidance on how to work with the source would be greatly appreciated<br />\n",
    "PostedDate": "2014-02-01T04:50:56.04-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1202695",
    "ThreadId": "528607",
    "Html": "Some quick answers:\r<br />\n<br />\nWe're primarily using Visual Studio to do our work but nothing should be tied to VS if you're prefer to use Sublime, WebStorm, Eclipse, whatever. The jake tasks are indeed your primary way to build the compiler (jake local) after you make a change to it, run tests (jake runtests), etc, For debugging you'll probably want to use whatever node debugger you like to step through tsc.js or run.js (the file that runs the tests), with Visual Studio this could mean using the recently released Node Tools for VS.\r<br />\n<br />\nWe are lacking some more in depth documentation at the moment (especially for something like the compiler architecture/API which has been in flux at times).<br />\n",
    "PostedDate": "2014-02-04T15:08:59.963-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]