[
  {
    "Id": "942307",
    "ThreadId": "403389",
    "Html": "\r\n<p>Yes, I know there's a joke of a roadmap here:</p>\r\n<p><a href=\"http://typescript.codeplex.com/wikipage?title=Roadmap&referringTitle=Home\">http://typescript.codeplex.com/wikipage?title=Roadmap&amp;referringTitle=Home</a></p>\r\n<p>&nbsp;</p>\r\n<p>When are you guys going to release actual updated plans for what you're planning for this language? It's been a month and a half since you announced TypeScript and there's yet to be\r\n<em>any </em>update on what additional public releases are going to contain or when they will happen.</p>\r\n<p>I've looked at the develop branch, and all the checkins since the public release have been bug fixes from what I can tell (without diving in too deeply). It would really help organizations adopt TypeScript if we had a firm commitment from MS on developing\r\n and supporting this language and the almost total radio silence is not helping. Yes, Jon Turner has escalated many requests to Issues in the Issue Tracker, but not a single one of these have been comments, priorities, or ETAs assigned yet.</p>\r\n<p>When will generics be added? Where are we with source map support in VS? Is async/await likely to happen or is not going to happen? Open source projects ideally entail more than just a source code dump.&nbsp;</p>\r\n<p>For a comparison on how to quickly respond to community feedback, Mads Kristensen's great team has had\r\n<strong>7&nbsp;releases </strong>of VS Web Essentials 2012 in the last month and a half.</p>\r\n<p>In summary, I think TypeScript is fantastic so far, but a tighter feedback loop would be really helpful.</p>\r\n<p>UPDATE:</p>\r\n<p>Possibly <em>as </em>I was writing this, 8.1 was released. As I posited, it looks like mainly bug fixes. Some feedback about planned features and release timelines would still be super helpful.</p>\r\n",
    "PostedDate": "2012-11-15T12:53:17.28-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "942668",
    "ThreadId": "403389",
    "Html": "\r\n<p>I rather think that the approach taken by the TypeScript team is the right one.</p>\r\n<p>There are still a number of bugs in the implementation of the language as it stands, and this is probably not the time to slap on new features.&nbsp;Consequently,&nbsp;I think it is important to stabilise the existing feature set and ensure everything is\r\n working before anything new is introduced.</p>\r\n<p>It would be great if we had generics, const etc. but even without such features TypeScript is a tremendous asset to web development. IMO the argument for adopting the language is already won - when set against life before TypeScript: JSLint and &quot;too many\r\n var statements&quot;!</p>\r\n<p>Of course if Microsoft wants to stop everything else and have everyone working on TypeScript, I for one will be cheering them on!</p>\r\n<p>In the meantime, I vote for the TypeScript team to not cave into pressure for new features and instead keep the bug fixes coming.</p>\r\n<p>Noel</p>\r\n<p>&nbsp;</p>\r\n<p>PS: &nbsp;Incidentally (and ironically), there is no corresponding Web Essentials release for TypeScript 0.8.1, which means I've had to turn off the preview window and compile on save.</p>\r\n",
    "PostedDate": "2012-11-16T03:55:43.993-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "942676",
    "ThreadId": "403389",
    "Html": "\r\n<blockquote style=\"border:solid .1em #ccc; font-style:italic; margin:.25em 1em 0 1em; padding:0 .25em 0 .25em\">\r\n<strong>nabog wrote:</strong><br>\r\n<p>I rather think that the approach taken by the TypeScript team is the right one.</p>\r\n<p>There are still a number of bugs in the implementation of the language as it stands, and this is probably not the time to slap on new features.&nbsp;Consequently,&nbsp;I think it is important to stabilise the existing feature set and ensure everything is working before\r\n anything new is introduced.</p>\r\n</blockquote>\r\n<p>They already mentioned numerous times that they're actively working on generics. So they are already implementing new features.. They just don't tell the community anything.</p>\r\n",
    "PostedDate": "2012-11-16T04:17:10.267-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "942740",
    "ThreadId": "403389",
    "Html": "\r\n<blockquote style=\"border:solid .1em #ccc; font-style:italic; margin:.25em 1em 0 1em; padding:0 .25em 0 .25em\">\r\n<strong>nabog wrote:</strong><br>\r\n<p>I rather think that the approach taken by the TypeScript team is the right one.</p>\r\n<p>There are still a number of bugs in the implementation of the language as it stands, and this is probably not the time to slap on new features.&nbsp;Consequently,&nbsp;I think it is important to stabilise the existing feature set and ensure everything is working before\r\n anything new is introduced.</p>\r\n<p>It would be great if we had generics, const etc. but even without such features TypeScript is a tremendous asset to web development. IMO the argument for adopting the language is already won - when set against life before TypeScript: JSLint and &quot;too many\r\n var statements&quot;!</p>\r\n<p>Of course if Microsoft wants to stop everything else and have everyone working on TypeScript, I for one will be cheering them on!</p>\r\n<p>In the meantime, I vote for the TypeScript team to not cave into pressure for new features and instead keep the bug fixes coming.</p>\r\n<p>Noel</p>\r\n<p>&nbsp;</p>\r\n<p>PS: &nbsp;Incidentally (and ironically), there is no corresponding Web Essentials release for TypeScript 0.8.1, which means I've had to turn off the preview window and compile on save.</p>\r\n</blockquote>\r\n<p>I'm advocating for transparency about where they're planning to go, not for them to focus on features vs bugs. Dumping a project on the web and then going almost totally silent about future plans for a month and a half does not give a strong impression of\r\n commitment. Especially given how MS has such a nasty habit of&nbsp;unveiling&nbsp;a new technology and then killing off said technology not long after. they need to be more transparent with what the process is going to be.</p>\r\n",
    "PostedDate": "2012-11-16T05:52:15.447-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "942745",
    "ThreadId": "403389",
    "Html": "\r\n<p>TypeScript is Open Source.&nbsp;You can't really 'kill' an open source project.</p>\r\n",
    "PostedDate": "2012-11-16T06:01:21.767-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "942749",
    "ThreadId": "403389",
    "Html": "\r\n<p>If it stops being supported it will likely die.</p>\r\n<p>Scenario: Future versions of ECMAScript come out. TypeScript does not comply with the syntax of these versions because it's no longer being supported. The community\r\n<em>may </em>try and rewrite the compiler, but what about editor support? The VS extension is not open source.</p>\r\n<p>Once a language has been abandoned by its creators, who is going to take the risk of trying to start something new with it?</p>\r\n",
    "PostedDate": "2012-11-16T06:08:12.967-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "942760",
    "ThreadId": "403389",
    "Html": "\r\n<p>I already complained about this, but I only got a half hearted answer:</p>\r\n<p>http://typescript.codeplex.com/discussions/400934</p>\r\n",
    "PostedDate": "2012-11-16T06:27:37.903-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "946573",
    "ThreadId": "403389",
    "Html": "\r\n<p>And exactly this is what we&nbsp;meant.. No response in over a week.</p>\r\n",
    "PostedDate": "2012-11-25T00:10:28.94-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "947109",
    "ThreadId": "403389",
    "Html": "\r\n<p>Apologies&nbsp;for not putting the roadmap up/assigning dates sooner.&nbsp; We've been collecting feedback from the community on what needs to be fixed and then prioritizing based on the biggest needs first.&nbsp; Many of the requests in the issue tracker do have milestones\r\n we're targeting, but I just haven't done the work of adding that info to each issue, yet.&nbsp;&nbsp;</p>\r\n",
    "PostedDate": "2012-11-26T09:27:27.15-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]