[
  {
    "Id": "920989",
    "ThreadId": "397807",
    "Html": "\r\n<p>VS2010 seems to be complaining about module dependency resolutions. &nbsp;My .ts file is in a subdirectory and I'm declaring a dependency on a module file off the requirejs module root.</p>\r\n<p>I don't see how the VS addin knows about the module loading logic to resolve the location of the module. &nbsp;How are these compatible?</p>\r\n",
    "PostedDate": "2012-10-02T18:51:27.117-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "921590",
    "ThreadId": "397807",
    "Html": "<p>I believe section 9.4 of the language specification outlines how external module names are resolved.&nbsp; If this doesn't answer your question, please post back.&nbsp; If you believe there is an issue with name resolution, please post it in the 'Issue Tracker' section.&nbsp; Thanks!</p>",
    "PostedDate": "2012-10-03T17:06:41.727-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "921607",
    "ThreadId": "397807",
    "Html": "<p>I read that - but it doesn't seem to account for a configured require.js script root. &nbsp;If you set a special dir in the require.js configuration how does TypeScript know about it without running it? Visual Studio seems to complain, for example.</p>",
    "PostedDate": "2012-10-03T18:24:08.35-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "921650",
    "ThreadId": "397807",
    "Html": "<p>Correct.&nbsp; For this initial release, we know nothing about any specific configuration you may provide to require.js, and the algorithm used isn't settable.&nbsp; We just do basic path parsing on the string provided.</p>",
    "PostedDate": "2012-10-03T21:53:43.87-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "921753",
    "ThreadId": "397807",
    "Html": "<p>It definitely needs to support requirejs config files -- without this it's extremely difficult to start using it in real-world apps. I have such app that is already built with RequireJS and I wanted to incorporate the TypeScript step by step. But this seems impossible for now :(</p>",
    "PostedDate": "2012-10-04T02:30:00.493-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "984092",
    "ThreadId": "397807",
    "Html": "\r\n<p>yes, same here. without taking the require.js config into account it's useless for real applications, at least for me.&nbsp;</p>\r\n",
    "PostedDate": "2013-01-08T07:04:11.07-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]