[
  {
    "Id": "922639",
    "ThreadId": "398240",
    "Html": "\r\n<p>Hello!</p>\r\n<p>Thanks for the great work on TypeScript. &nbsp;I'm very impressed with what I've seen so far, but I'm leery of investing time into such a new tech. &nbsp;Do you know whether Microsoft plans to employ TypeScript in its own web properties ? &nbsp;If TypeScript\r\n is &quot;baked&quot; enough for Microsoft to use, then it's good enough for me too ... :-)</p>\r\n<p>Cheers,</p>\r\n<p>Reuben</p>\r\n",
    "PostedDate": "2012-10-05T13:52:23.187-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "922654",
    "ThreadId": "398240",
    "Html": "<p>I read that the BING maps team uses it to manage their javascript APIs. Frankly, this is a 50 person team and I'm sure there are a lot of internal teams dogfooding TypeScript. I'm using it myself for a large production-grade project and find it perfectly stable.</p>",
    "PostedDate": "2012-10-05T14:40:20.027-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "922670",
    "ThreadId": "398240",
    "Html": "<p>Thanks, oisin! &nbsp;I'll give it a try ...</p>",
    "PostedDate": "2012-10-05T16:52:45.93-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "923460",
    "ThreadId": "398240",
    "Html": "<p>That said, it is still a preview release, so we advise some caution while we push toward 1.0</p>",
    "PostedDate": "2012-10-08T08:17:24.997-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "925604",
    "ThreadId": "398240",
    "Html": "<p>I think for me the question is this; is the language spec likely to change between now and 1.0 in a way that would significantly break code I might write tomorrow?</p>\r\n<p>I am not asking for a promise, but I would love to get someone on the team's opinion on that.&nbsp;</p>\r\n<p>Thanks,</p>\r\n<p>Matthew</p>",
    "PostedDate": "2012-10-11T19:57:24.69-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "925843",
    "ThreadId": "398240",
    "Html": "<p>It is possible there will be breaking changes between the 0.8 release and 1.0. &nbsp;In part, this is from aligning some of TypeScript's features with the draft ECMAScript version 6 specification, which hasn't yet been completed. &nbsp;The public release has the \"preview\" label to let people know that TypeScript may have breaking changes between versions until the 1.0 release.</p>",
    "PostedDate": "2012-10-12T08:01:53.29-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "925856",
    "ThreadId": "398240",
    "Html": "<p>Is there a timeline for these releases? We've been simply blown away with TS, it does pretty much everything we wanted so far (once you learn the syntax). So we're actively converting a massive code base into native TS. We fully expect that you'll change things for 1.0, but it'd be nice to know when this may happen.</p>",
    "PostedDate": "2012-10-12T08:22:17.007-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "926799",
    "ThreadId": "398240",
    "Html": "<p>We have a roadmap here: <a href=\"http://typescript.codeplex.com/wikipage?title=Roadmap&amp;referringTitle=Home\">http://typescript.codeplex.com/wikipage?title=Roadmap&amp;referringTitle=Home</a>&nbsp;which will likely get filled out with more details as we go and as we get feedback/feature requests&nbsp;from the community.</p>",
    "PostedDate": "2012-10-15T09:05:00.723-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]