[
  {
    "Id": "1078891",
    "ThreadId": "452988",
    "Html": "My configuration : \r<br />\nWindows 7\r<br />\nVS2012 Update 3 \r<br />\nTypescript 0.9.1\r<br />\nWeb Essentials 2.9\r<br />\nAutomatically compile Typescript files which are part of a project is enabled\r<br />\nMVC3 Web application\r<br />\n<br />\nSaving a typescript file: does not alter the js file in any way.\r<br />\nCompile project : none of the typescript files are compiled to javascript.\r<br />\n<br />\nWeb Essentials compile on save is disabled ... when enabled, typescript files are compiled on save, but performance of editing is bad.\r<br />\n<br />\nAlso when creating a new MVC3 project, template Typescript Internet Application, getting the following error : The system can not find the specified file (Exception from HRESULT : 0x80070002).\r<br />\n<br />\nTried to uninstall Typescript and reinstall it, but all the problems remain the same.<br />\n",
    "PostedDate": "2013-08-09T14:04:00.403-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1079134",
    "ThreadId": "452988",
    "Html": "I'm getting the same thing. Windows 8, VS2012 Update 3, TypeScript 0.9.1, Web Essentials 2.9\r<br />\n<br />\nSaving the .ts file causes the creation of a TypeScript Compiler process. The process does its little burst of execution, and then it goes down to 0% CPU and just sits there until VS is exited.\r<br />\n<br />\nI didn't notice any editing performance issues.\r<br />\n<br />\nThe file in question was 1600+ lines long, referencing some .d.ts files, with moderate use of generics with KnockoutObservables and such.<br />\n",
    "PostedDate": "2013-08-10T16:50:23.223-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1079274",
    "ThreadId": "452988",
    "Html": "When editing I still have processor going up to 70% usage on a 2 core virtual machine.  Often I have to wait 20 seconds (and more) before the language service catches up and code completion returns active again.<br />\n",
    "PostedDate": "2013-08-11T10:23:06.487-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1079674",
    "ThreadId": "452988",
    "Html": "@GeoffArmstrong That sounds a lot like what I'm experiencing described <a href=\"https://typescript.codeplex.com/discussions/452725\" rel=\"nofollow\">here</a>.  I'm also on Windows 8 so one theory I have is it's related to the use of a different JS engine on that platform.\r<br />\n<br />\nI'm not using Web Essentials but if you are and you're having problems try uninstalling it.  It's been known to cause trouble.<br />\n",
    "PostedDate": "2013-08-12T09:33:24.4-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1295284",
    "ThreadId": "452988",
    "Html": "I have the same issue with TypeScript 1.0, VS2013 Update 1 do have Web essentials.  if I delete the compiled .JS and associated map file, the file compiles, but when using IIS Express, the browser still receives the previous .JS file.<br />\n",
    "PostedDate": "2014-08-29T15:05:07.963-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]