[
  {
    "Id": "982755",
    "ThreadId": "428414",
    "Html": "\r\n<p>I'm guessing you guys must be using a different system for tracking your work items - other than codeplex - because I see only five items assigned to the (presumably) impending 0.8.2 release - of which one is active, one is closed, and three are proposed.\r\n Since I suspect that more work has gone into 0.8.2 than this, I'm concluding that you must be using an internal MS system for tracking your work items.&nbsp;<span style=\"font-size:10pt\">I imagine that you have your reasons for doing this, but it does of course\r\n limit community participation, and decreases community visibility into what's coming. Have you given any thoughts to moving *everything* public?</span></p>\r\n<p><span style=\"font-size:10pt\">I also haven't seen any accepted pull requests (three have been declined, the others are &quot;being evaluated&quot;). Are you planning to accept contributions from the community? What sort of expectations should folks have along\r\n those lines?</span></p>\r\n<p><span style=\"font-size:10pt\">Also, have you given any thoughts to open-sourcing the Visual Studio add-in?</span></p>\r\n",
    "PostedDate": "2013-01-03T10:51:36.843-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "983092",
    "ThreadId": "428414",
    "Html": "\r\n<p>Indeed, we do use both an public and a private issue tracker.&nbsp; While we can't move everything public, as some of the issues may&nbsp;pertain to&nbsp;internal projects/security issues, we're looking at ways to&nbsp;make more of it public.&nbsp; It's helpful for the community&nbsp;to\r\n be able to see and give feedback more easily, and it's also just less overhead on the team to manage two different trackers.</p>\r\n<p>We're also looking to make our design discussions and notes public so that it's easier for the community to jump in.&nbsp; It's largely a historical why we're a little quiet, and we're moving to being more transparent&nbsp;so that we can work with&nbsp;everyone else more\r\n closely.</p>\r\n<p>When we went public, we knew that we were going to be previewing the technology and that it was some of the processes behind the scenes wouldn't be quite ready.&nbsp; Pull requests is another one we knew wasn't going to be quite ready, but we started actively\r\n working towards them.&nbsp; Microsoft is very careful about the intellectual property rights of others, and there were a few steps we needed to take on our side&nbsp;to keep things to a high bar before jumping in and accepting patches.&nbsp;</p>\r\n<p>Lastly, we'll likely not open source the VS add-in.&nbsp;&nbsp;The VS&nbsp;add-in isn't actually all that interesting, as almost all of the smarts are in the language service (minus the debugging support, which is internal).&nbsp;&nbsp;The language service is open source and you\r\n can get it&nbsp;from the source repo.&nbsp;</p>\r\n",
    "PostedDate": "2013-01-04T08:55:45.587-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "983129",
    "ThreadId": "428414",
    "Html": "\r\n<p>Good to hear, Jon. I think TypeScript is a great idea, and I'm looking forward to using and supporting it as much as I can. I'm about 5000 lines into my first major project with it, and while it has major rough edges (generics! generics! generics!), it's\r\n made my life much easier than if I had to deal with raw JavaScript all day long.</p>\r\n",
    "PostedDate": "2013-01-04T10:33:32.153-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "983880",
    "ThreadId": "428414",
    "Html": "\r\n<p>Jon - any chance you can drop a hint of any upcoming releases?</p>\r\n<p>Would be nice to get another build even if it has only a feature or two :)</p>\r\n<p>I'm living in TypeScript lately so any extra goodies would be huge for me!</p>\r\n",
    "PostedDate": "2013-01-07T13:27:21.393-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "984586",
    "ThreadId": "428414",
    "Html": "\r\n<p>JonKragh,</p>\r\n<p>Definitely.&nbsp; We're due to put up a blog post very soon about what's coming next, so keep an eye out for that.</p>\r\n",
    "PostedDate": "2013-01-09T10:08:27.953-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "985432",
    "ThreadId": "428414",
    "Html": "\r\n<p>Awesome!</p>\r\n<p>Between TypeScript, my hacked together code generator to bring my C# Poco typedefs to typescript, and knockoutjs....I'm loving this programming model!</p>\r\n",
    "PostedDate": "2013-01-11T06:06:51.87-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "985573",
    "ThreadId": "428414",
    "Html": "\r\n<p>@JonKragh,</p>\r\n<p>A code generator for transforming C# POCO to TypeScript sounds interesting.</p>\r\n<p>Would you care to elaborate or share some insights?</p>\r\n<p>Thanks.</p>\r\n<p>Noel</p>\r\n",
    "PostedDate": "2013-01-11T10:22:58.31-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "985595",
    "ThreadId": "428414",
    "Html": "\r\n<p>Sure - check this thread:&nbsp;<a title=\"http://typescript.codeplex.com/discussions/406685\" href=\"http://typescript.codeplex.com/discussions/406685\">http://typescript.codeplex.com/discussions/406685</a></p>\r\n<p>It was a proof of concept at that point which I now use. &nbsp;I've extended it to code gen knockout view models and handle more types since that point.</p>\r\n<p>I think the good parts are: code gen template is a razor view & very simple to extend. &nbsp;If there's interest I can throw up my latest template.</p>\r\n<p>It works great. &nbsp;I have strongly typed knockout viewmodels and also our core entities (e.g. request/response message structures, error structures, etc) and our domain entities on the client! Objects that we worked years on refining....</p>\r\n",
    "PostedDate": "2013-01-11T11:09:32.72-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]