[
  {
    "Id": "935804",
    "ThreadId": "401715",
    "Html": "\r\n<p>What would be the recommended way when creating an npm package with typescript (ts) files, to package the module:</p>\r\n<ol>\r\n<li>Only package ts files and compile during install using typescript's tsc. </li><li>Only package js files and precompile (ts --&gt; js) before packaging. </li><li>Package both ts and js files and compile before packaging. </li></ol>\r\n<p>&nbsp;</p>\r\n<p>Thanks,</p>\r\n<p>Amit</p>\r\n<p>&nbsp;</p>\r\n",
    "PostedDate": "2012-11-02T10:59:42.987-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "935864",
    "ThreadId": "401715",
    "Html": "<p>Like other packages in other languages (like CoffeScript), put your ts files in your&nbsp;package, add a dev dependency and main entry to your build system.</p>",
    "PostedDate": "2012-11-02T12:46:30.937-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "935872",
    "ThreadId": "401715",
    "Html": "<p>I'm not sure which option you're referring to (or is it a new one?)</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2012-11-02T13:12:21.703-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1143612",
    "ThreadId": "401715",
    "Html": "The npm documentation actually contains <a href=\"https://npmjs.org/doc/json.html#devDependencies\" rel=\"nofollow\">a section about this</a>:<br />\n<blockquote>\nFor build steps that are not platform-specific, such as compiling CoffeeScript or other languages to JavaScript, use the prepublish script to do this, and make the required package a devDependency.<br />\n</blockquote>\nSo the answer to your question would be either #2 or #3, depending on whether or not you expect package consumers to utilize the TypeScript files. Personally I think #2 makes the most sense, with the caveat that .d.ts definition files should also be included (these can be generated automatically using <a href=\"https://npmjs.org/package/grunt-ts\" rel=\"nofollow\">grunt-ts</a>).<br />\n",
    "PostedDate": "2013-12-28T18:12:52.103-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]