[
  {
    "Id": "947986",
    "ThreadId": "404796",
    "Html": "\r\n<p>I've created a simple tool that helps debugging the standard TSC compiler using browser's Developer Tools (F12).</p>\r\n<p>Source code is forked as <a title=\"Fork on CodePlex\" href=\"http://typescript.codeplex.com/SourceControl/network/forks/mihailik/browserIOEmulation\">\r\nbrowserIOEmulation</a>.</p>\r\n<p>And the demo is on <a title=\"GitHub pages for tsc.browser repository\" href=\"http://mihailik.github.com/tsc.browser/\">\r\nGitHub pages</a>.</p>\r\n<p>&nbsp;</p>\r\n<p>There are several uses for this tool.</p>\r\n<ul>\r\n<li>Step through the standard official TSC compiler to see how individual parts of it work together.\r\n</li><li>Verify that TS compiler and language services are compatible with a broad set of JS engines.\r\n</li><li>Assess performance of the compiler on a broad range of engines/devices. </li></ul>\r\n<p>So far I've tested it on a whole bunch of browsers and devices, and it works everywhere.</p>\r\n<p>The TSC in the demo is re-compiled from source with --sourcemap and --comment flags, to aid step-through. The official TSC.js verbatim from /bin works just as well.</p>\r\n<p>The emulation layer is done by injecting Node.js-like variables in the global scope before &lt;script src='tsc.js'&gt; tag. That is actually enough to trick TSC into running within browser.</p>\r\n<p>The UI is pretty trivial and the code handling UI is quick-and-dirty version. But you can create files in 'virtual filesystem' and provide custom command options. Both the output and the resulting files are accessible.</p>\r\n<p>This is the list of devices I've tested it so far:</p>\r\n<ul>\r\n<li>Chrome 23 on Win8 </li><li>Chrome Canary 25 on Win8 </li><li>Opera 12 on Win8 </li><li>FireFox 17 on Win8 </li><li>IE10 on Win8 (both desktop and Metro) </li><li>Safari on iPhone 2G on iOS 3 </li><li>Android browser on Galaxy Note </li><li>Chrome mobile 18 on Galaxy Note </li><li>Built-in browser in Blackberry 7.1 </li><li>IE6 on WinXP </li><li>IE8 on Win2003 </li></ul>\r\n<p>Update: there were a couple of problems with browsers in this list, but all minor and I fixed them in an hour or so.</p>\r\n<ul>\r\n</ul>\r\n",
    "PostedDate": "2012-11-27T14:43:05.657-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]