[
  {
    "Id": "921754",
    "ThreadId": "397997",
    "Html": "\r\n<p>Since, typescript is completely written in javscript, it would not be too difficult to make some sort of extension system to the language is it?&nbsp;</p>\r\n<p>For instance: Keep typescript pure with a the current build. But make it possible for developers to add language extensions to they can get coffeescript like features.</p>\r\n<p>I like typescript because it's a very thin layer with a single purpose of making javascript more typed and safer to produce large scale applications and better tools for refactoring.</p>\r\n<p>I love coffeescript because it fixes some of the crazy crap that JS does as a language. And it allows for less physical typings beause of the shortcuts for 'this' foreach etc. splats and&nbsp;what nots.</p>\r\n<p>How cool would it be, if i as a developer, can add an extension that allows me to extend the language in such a way that i can my own coffeescript like features to the language?&nbsp;</p>\r\n<p>What i am refering to is hooks in the scanner,parser and compiler.</p>\r\n<p>I could then compile my code in such a way like: tsc bla.js -extend myextensions.js, such a solution will also prevent the language from getting polluted.</p>\r\n",
    "PostedDate": "2012-10-04T02:31:23.21-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "922115",
    "ThreadId": "397997",
    "Html": "<p>+1, I really love this idea!</p>\r\n<blockquote style=\"padding-bottom: 0px; font-style: italic; padding-top: 0px; padding-left: 0.25em; margin: 0.25em 1em 0px; padding-right: 0.25em; border: #ccc 0.1em solid;\"><strong>mr_much_win wrote:</strong>\r\n<p>I could then compile my code in such a way like: tsc bla.js -extend myextensions.js, such a solution will also prevent the language from getting polluted.</p>\r\n</blockquote>\r\n<p>&nbsp;I think we should have an extension registry in order to allow those features. In addition, TypeScript could add 'stable' extensions in regular time intervals into the main source code.</p>",
    "PostedDate": "2012-10-04T13:39:42.307-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "932938",
    "ThreadId": "397997",
    "Html": "<p>+1, I need this too!</p>",
    "PostedDate": "2012-10-26T04:54:14.16-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "933980",
    "ThreadId": "397997",
    "Html": "<p>I think you should figure out a way to make sweet js work with TypeScript:&nbsp;http://sweetjs.org/</p>",
    "PostedDate": "2012-10-29T14:08:38.487-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]