[
  {
    "Id": "1104038",
    "ThreadId": "461284",
    "Html": "I am wondering whether VS2012(or 2013) supports source map sections when debugging through IE10 (or 11). I know that it is not exactly the perfect group for this kind of question, however since TypeScript is dealing with source maps somebody perhaps know.\r<br />\nIf you wonder, I created a custom source map with sections but VS would crash every time while Chrome (standalone) doesn't have problems. In fact VS is crashing when source map isn't &quot;perfect&quot;.<br />\n",
    "PostedDate": "2013-10-05T12:12:22.137-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1105706",
    "ThreadId": "461284",
    "Html": "I'm not sure what you mean by source map sections.  Is this part of the current source map specification?  <br />\n",
    "PostedDate": "2013-10-09T13:23:31.087-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1105843",
    "ThreadId": "461284",
    "Html": "Here is a fairly old <a href=\"https://docs.google.com/document/d/1U1RGAehQwRypUTovF1KRlpiOFze0b-_2gc6fAH0KY0k/edit\" rel=\"nofollow\">proposal</a>\r<br />\nSee the sample structure under <strong>Index map: supporting post processing</strong> header.\r<br />\nIt uses Sections to allow splitting sources between more than one file.<br />\n",
    "PostedDate": "2013-10-10T00:12:42.4-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1106452",
    "ThreadId": "461284",
    "Html": "Ah, I see now.  No, as the TypeScript compiler doesn't support this kind of sectioning, we didn't add it to the VS side.<br />\n\r<br />\nOut of curiosity, what are you trying to do with them?  Are you post-processing the source maps that come out of the compiler?<br />\n",
    "PostedDate": "2013-10-11T08:39:40.84-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1106492",
    "ThreadId": "461284",
    "Html": "Ah, Visual Studio doesn't support this kind of structure (at least that's why I am trying to find out). I know TypeScript doesn't.\r<br />\n<br />\nAs per what I am trying to achieve is this:\r<br />\nI would concatenate two or more .ts files, compile the result using tsc and then adjust source map so the debugger would stop in original files. The reason behind this trick is that I want to build a multi file amd modules. Right now, correct me if I am wrong, one can't build those. I know you can use tsc -out argument but that would just concatenate the compiler results (I am concatenating sources and compiling the result instead).<br />\n",
    "PostedDate": "2013-10-11T09:48:44.697-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]