[
  {
    "Id": "1132377",
    "ThreadId": "472080",
    "Html": "Just upgraded my web project (which contains TypeScript files) and fixed a few compiler errors.  The final error is a little odd, and makes no sense to me:<br />\n<pre><code>&quot;Error  14  Debug Failure. False expression: Provided ast is not the expected AST, Expected: ObjectLiteralExpression Given: FunctionPropertyAssignment  C:\\Data\\Visual Studio\\Projects\\DC Mobile App\\Source\\DC Web App\\VSTSC    DC Web App&quot;\n</code></pre>\n\nDid the upgrade fail to change something?<br />\n<br />\nAlso, I don't have any TypeScript options available in my project options - is this only for TS specific projects?<br />\n",
    "PostedDate": "2013-12-05T21:08:49.337-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1132378",
    "ThreadId": "472080",
    "Html": "(FYI: I already tried cleaning and rebuilding the project, and the error is still there.  I have no idea where &quot;ast&quot; is coming from.)<br />\n",
    "PostedDate": "2013-12-05T21:15:37.73-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1132379",
    "ThreadId": "472080",
    "Html": "Looks like this is specific to compiling this particular form of object literal with --sourcemap:<br />\n<pre><code>// Fails\nvar x = { n() { return 4; } };\n\n// OK\nvar x = { n: function() { return 4; } };</code></pre>\n\nSo you should be able to work around it either by not emitting source maps or by using the alternate function syntax. I'll get a bug logged - sorry you ran into this.<br />\n",
    "PostedDate": "2013-12-05T21:28:24.853-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1132380",
    "ThreadId": "472080",
    "Html": "No worries! Thanks for the work-around. :). I have a large project; hopefully this won't be a needle in a hay stack.<br />\n",
    "PostedDate": "2013-12-05T21:33:18.117-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1132382",
    "ThreadId": "472080",
    "Html": "Also, shouldn't I see TypeScript options in my web project options? They are not there.<br />\n",
    "PostedDate": "2013-12-05T21:34:28.473-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]