[
  {
    "Id": "1111979",
    "ThreadId": "463530",
    "Html": "I use Hungarian keyboard layout and can not write the following characters: [ {\r<br />\n...which makes the whole editor <strong>unusable</strong> for all people using a Hungarian keyboard layout.\r<br />\n<br />\n[ = Ctrl+Alt+F\r<br />\n{ = Ctrl+Alt+B\r<br />\n<br />\nNote: even this editor on CodePlex invokes different commands when I press the noted keys at once, I had to copy-paste the opening brackets.<br />\n",
    "PostedDate": "2013-10-25T01:07:52.143-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1112250",
    "ThreadId": "463530",
    "Html": "Is there something TypeScript specific here that is an issue? I assume from your description and some quick searching that your issue is that Ctrl-Alt-F and Ctrl-Alt-B are already used by Visual Studio (at least in certain profiles like C#) for other shortcuts which override the combinations the Hungarian keyboard layout uses for these characters (since they aren't themselves present on the keyboard layout)? If that is the case, you can change the key bindings in Visual Studio to remove the existing ones for the commands you need and rebind them to the necessary characters.<br />\n",
    "PostedDate": "2013-10-25T13:37:40.45-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1112326",
    "ThreadId": "463530",
    "Html": "No, not TypeScript and not Visual Studio. Visual Studio layouts keyboard bindings correctly for at least 15 years. It is related to the codename &quot;Monaco&quot; editor, which is used on TypeScriptLang.org, SykDrive, Office and Windows Azure; but I did not find any other place where I could give feedback on the editor or report issues like this one. If there is, please let me know. If this is the right place to report editor related issues, please create a work item from it and correct it as soon as possible, because it really destroys the first impression (and the further ones), that I can not even type text...<br />\n",
    "PostedDate": "2013-10-25T23:04:24.363-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1113721",
    "ThreadId": "463530",
    "Html": "So it's in the online editor?  I'll pass that along.<br />\n",
    "PostedDate": "2013-10-29T08:48:38.637-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1113833",
    "ThreadId": "463530",
    "Html": "Yes, the online, HTML/JS-based editor. Visual Studio handles keyboard layouts correctly.<br />\n",
    "PostedDate": "2013-10-29T14:05:18.03-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1122489",
    "ThreadId": "463530",
    "Html": "I've gotten word from the team working on the online editor that there's a fix in place, though it may take a while for the fix to trickle out (and be incorporated into our playground).<br />\n",
    "PostedDate": "2013-11-12T11:19:44.037-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1122794",
    "ThreadId": "463530",
    "Html": "Thank you. It will be much easier to demo how cool TypeScript is than &quot;Look, TypeScript is awesome: it even works in the browser! ...uhm... but how can I type a { to begin a function...? ...let me copy it from somewhere... -.-&quot;.<br />\n",
    "PostedDate": "2013-11-13T01:00:31.213-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]