[
  {
    "Id": "921563",
    "ThreadId": "397959",
    "Html": "\r\n<p>I was wondering if there is a version of the TypeScript compiler made for running on the client side(browser). It seems like the playground is using something like this already and I was curious how possible it would be to use this myself.</p>\r\n",
    "PostedDate": "2012-10-03T15:43:14.44-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "921670",
    "ThreadId": "397959",
    "Html": "<p>If you download the commandline compiler, you can compile it to js suitable for running in a browser- after all, it's just javascript. However, other than the use case where you need to be transcompiling arbitrary TypeScript code to JavaScript code at runtime (eg, you're building something similar to the playground), the compilation step should be a build-time step, with only JavaScript being sent to the browser.</p>",
    "PostedDate": "2012-10-03T23:08:50.54-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "922509",
    "ThreadId": "397959",
    "Html": "<p>That's right.&nbsp; The TypeScript compiler compiles to .js, which can be run from a browser.&nbsp; What you're using in the Playground is the TypeScript compiler itself.</p>",
    "PostedDate": "2012-10-05T09:05:11.36-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "922618",
    "ThreadId": "397959",
    "Html": "\r\n<p>Looks like someone already beat me to what I was describing:</p>\r\n<p>https://github.com/niutech/typescript-compile</p>\r\n<p>I guess I probably wasn't very clear in my initial question. I was mostly looking for something that was a little more tailored to support it already. Personally I was kinda surprised this approach wasn't already looked at, as I could see this being expanded\r\n to eventually even allow browsers to compile typescript natively, with the js compiler as a fallback.</p>\r\n",
    "PostedDate": "2012-10-05T13:03:04.257-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "922622",
    "ThreadId": "397959",
    "Html": "\r\n<div style=\"font-family:Calibri\">\r\n<div>The same is available for coffeescript, but is rarely used.</div>\r\n<div>Debugging is more difficult and the extra step on the client (especially mobile devices) is non-negligible.\r\n</div>\r\n<div></div>\r\n<div style=\"border-top-color:rgb(229,229,229); border-top-width:2px; border-top-style:solid\">\r\n<strong>From:</strong> path411<br>\r\n<strong>Sent:</strong> ‎October‎ ‎5‎, ‎2012 ‎4‎:‎03‎ ‎PM<br>\r\n<strong>To:</strong> joewood@live.com<br>\r\n<strong>Subject:</strong> Re: Client Side Compiler [typescript:397959]<br>\r\n</div>\r\n<div></div>\r\n<p>From: path411</p>\r\n<div id=\"ThreadNotificationPostBody\">\r\n<p>Looks like someone already beat me to what I was describing:</p>\r\n<p>https://github.com/niutech/typescript-compile</p>\r\n<p>I guess I probably wasn't very clear in my initial question. I was mostly looking for something that was a little more tailored for support it already. Personally I was kinda surprised this approach wasn't already looked at, as I could see this being expanded\r\n to eventually even allow browsers to compile typescript natively, with the js compiler as a fallback.</p>\r\n</div>\r\n</div>\r\n",
    "PostedDate": "2012-10-05T13:08:05.12-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]