[
  {
    "Id": "1128648",
    "ThreadId": "471036",
    "Html": "Consider the following code:<br />\n<pre><code>   export enum MyEnum {\n        Arrrr,\n        B = Arrrr\n    }</code></pre>\n\nTypeScript compiler gives me no error, but I can't find anything about ability to reference constant enum members from computed enum members without qualification. There is no mention about it in 2.4 (scopes where names could be used without qualification), there is no mention about it in 9 (Enums). On the opposite, code samples in specs use qualified names. So, is this a bug in specs or in compiler? Is there any other cases where name could be used without qualifications that are not mentioned in 2.4? Thanks!<br />\n",
    "PostedDate": "2013-11-25T04:37:30.527-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1128740",
    "ThreadId": "471036",
    "Html": "The spec defines this behavior in sections 2.3 and 2.4:\r<br />\n<br />\n2.3:<br />\n<blockquote>\n•\tEach enum declaration has a declaration space for its enum members. An enum’s declaration space is shared with other enums that have the same root module and the same qualified name starting from that root module.<br />\n</blockquote>\n2.4<br />\n<blockquote>\n•\tThe scope of a member declared in an enum declaration is the body of that declaration and every enum declaration with the same root and the same qualified name relative to that root.<br />\n</blockquote>\n",
    "PostedDate": "2013-11-25T08:20:15.113-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1128752",
    "ThreadId": "471036",
    "Html": "This text is absent from 2.4 in <a href=\"http://www.typescriptlang.org/Content/TypeScript%20Language%20Specification.pdf\" rel=\"nofollow\">http://www.typescriptlang.org/Content/TypeScript%20Language%20Specification.pdf</a> . Time to upload 0.9.5 version there?<br />\n",
    "PostedDate": "2013-11-25T08:33:40.193-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1128784",
    "ThreadId": "471036",
    "Html": "We usually update that with each official release, so that should get changed soon once 0.9.5 is released. I'm working from the copy checked in to \\doc\\ in the develop branch, which is more current.<br />\n",
    "PostedDate": "2013-11-25T09:11:11.17-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]