[
  {
    "Id": "949888",
    "ThreadId": "405237",
    "Html": "\r\n<p>After playing some more with the language services, I updated my node-webkit based editor. Right now it supports besides basic code completion and syntax highlighting also background source compilation.&nbsp;I also put all the heavy lifting in a web worker,\r\n so the UI should not slow down while performing these tasks.</p>\r\n<p>You can download it from:&nbsp;<a href=\"https://github.com/jbaron/cats\">https://github.com/jbaron/cats</a></p>\r\n<p>Feedback is welcome, especially what would be cool features to add!!!</p>\r\n<p>Please note that this release is just for playing around and that is why I didn't include a save button yet. But once it is a bit more solid and has some more features, I'll put the save functionality in place.&nbsp;</p>\r\n<p>P.S previously it was called tsEdit, but it turns out there is already an editor with that name. So to avoid any confusion, I renamed it to CATS (Code Assistant for TypeScript).</p>\r\n<p>// Peter</p>\r\n",
    "PostedDate": "2012-12-01T03:27:28.423-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1321858",
    "ThreadId": "405237",
    "Html": "@jbaroncom - I'm back to using VS 2013 for Typescript 1.3 but while that wasn't practical CATS did a great job of filling in.  Code assist was fantastic.  Thanks for the significant effort involved in making this editor.<br />\n",
    "PostedDate": "2014-11-13T09:45:55.827-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1321934",
    "ThreadId": "405237",
    "Html": "Good to hear you found CATS useful. The IDE itself is right now very stable, however the TypeScript 1.3 language service still has some rough edges (although I use it myself regular to develop CATS). \r<br />\n<br />\nI also think the TypeScript team is adding a lot of nice goodies to the language in a fast paste, so a lot of new stuff to try out:\r<br />\n<br />\n1) Protected class members\r<br />\n2) Const, let (block scoping etc)\r<br />\n3) I believe also template strings are now in\r<br />\n4) Union Types\r<br />\n<br />\n(and possible I even forgot a few)<br />\n",
    "PostedDate": "2014-11-13T13:30:36.133-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]