[
  {
    "Id": "989158",
    "ThreadId": "430147",
    "Html": "\r\n<p>I just noticed that a branch for 0.9.x was created. When I checked the &quot;wishlist&quot;, it looks that this will be a great release(s):</p>\r\n<p></p>\r\n<pre>Get/set accessors in interfaces\r\nSupport ES6 import Foo from &quot;bar&quot;\r\nSupport for Generics in TypeScript\r\nSupport optional ambient &quot;this&quot; pointer typing in callback/function signatures\r\nCreate a .d community site\r\nAllow classes in function scope</pre>\r\n<p></p>\r\n<p>It also seems that the publicly exposed repository is used more often than before by the TS team. Great to have the development more out in the open.</p>\r\n<p>// Peter</p>\r\n",
    "PostedDate": "2013-01-19T11:05:12.087-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "989178",
    "ThreadId": "430147",
    "Html": "\r\n<p>Several of those things are going to be extremely useful to me, but the ambient &quot;this&quot; pointer is worth its release-weight in gold :)</p>\r\n",
    "PostedDate": "2013-01-19T12:56:07.853-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "989185",
    "ThreadId": "430147",
    "Html": "\r\n<p>I am looking forward to these features. I am using TypeScript in a project where I am actually referencing the TypeScript AST, parser, etc. I hope the team keeps most of the same structure with regards to the easy-to-invoke compiler, public functions, etc\r\n so I can continue to use the TypeScript source as a submodule w/out having to patch it directly.</p>\r\n",
    "PostedDate": "2013-01-19T13:28:26.37-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "989305",
    "ThreadId": "430147",
    "Html": "\r\n<p>@cretz</p>\r\n<p>I'm developing the CATS editor and am also using things like the language services a lot. So far (upgrading from 0.8.1 to 0.8.2) my experience has been positive with the API stability. They added some new services (like being able to emit source code from\r\n the language service), but existing services didn't changed much.&nbsp;</p>\r\n<p>However if they need to make some&nbsp;incompatible&nbsp;changes for the better, I have no issues with that. Already using TypeScript at this stage, means I know I'm an early adapter and what the risk associated with that are. And at least with a type system, the\r\n compiler will warn me about many of the incompatible changes.</p>\r\n<p>// Peter</p>\r\n<p>&nbsp;</p>\r\n",
    "PostedDate": "2013-01-20T03:02:33.187-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]