[
  {
    "Id": "948315",
    "ThreadId": "404885",
    "Html": "\r\n<p>Seems the debugging don't work out of the box in VS2012.</p>\r\n<p>What shoud I fix to enable this feature ?</p>\r\n",
    "PostedDate": "2012-11-28T06:31:19-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "948375",
    "ThreadId": "404885",
    "Html": "\r\n<p>To&nbsp;get going with&nbsp;debugging, you should only have to create an &quot;HTML Application with TypeScript&quot; after installing 0.8.1.&nbsp; In Debug mode, this will pass the --sourcemap flag to the compiler and will allow you to debug the TypeScript directly after you hit\r\n F5 (and open in IE).</p>\r\n<p>If you're trying it with your own project, you need to make the following changes:</p>\r\n<ul>\r\n<li>Enable source map output in the compiler using the --sourcemap flag.&nbsp; You can tell if you have done this successfully by looking at the .js file that is output.&nbsp; If it has a &quot;//@ sourceMappingURL=&lt;filename&gt;.js.map&quot; style line at the bottom, it's set correctly.\r\n</li><li>Include the .ts and .js files that you're using to debug in your project </li><li>Debug your application with Internet Explorer (other browsers will not work) </li></ul>\r\n<p>With that, you should be good to go.&nbsp; We're also&nbsp;putting out a point release soon that addresses a few issues that people with a few alternate configurations have hit, which may also help.</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<div id=\"_mcePaste\" style=\"overflow:hidden; height:1px; left:-10000px; top:0px; width:1px\">\r\n&#65279;</div>\r\n",
    "PostedDate": "2012-11-28T07:26:08.213-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "948376",
    "ThreadId": "404885",
    "Html": "\r\n<p>Also, if you use Web Essentials, be sure to grab a version that is compatible with TypeScript 0.8.1.&nbsp;</p>\r\n",
    "PostedDate": "2012-11-28T07:28:06.637-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "948458",
    "ThreadId": "404885",
    "Html": "\r\n<p>Hi Jon - Do you know when the point release will be available? (Maybe a nightly build someplace?)</p>\r\n<p>I'm hoping this issue can be resolved:&nbsp;<a href=\"http://typescript.codeplex.com/workitem/476\">http://typescript.codeplex.com/workitem/476</a></p>\r\n<p>Now that I have .ts debugging working, I'd like to refresh the page and still hit breakpoints.</p>\r\n<p>The workflow would be awesome then! Great Progress TypeScript team!</p>\r\n<p>Jon</p>\r\n",
    "PostedDate": "2012-11-28T09:07:17.84-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "949662",
    "ThreadId": "404885",
    "Html": "\r\n<p>@jonturner Pretty please on bug:&nbsp;<a href=\"http://typescript.codeplex.com/workitem/476\">http://typescript.codeplex.com/workitem/476</a>&nbsp;:)</p>\r\n<p>My workflow w/ debugging w/ source maps is pretty bad right now have to restart a debugging session every time I want to refresh a page.</p>\r\n<p>I'm probably&nbsp;just&nbsp;going to disable source maps for now. &nbsp;Typescript is sooo close to making me more productive, but this one is really taking away!</p>\r\n<p>Thanks much,</p>\r\n<p>Jon</p>\r\n<p>EDIT: I disabled source maps and now have the benefits of the DEV time productivity in .ts and can debug in VS's great js debugger. &nbsp;I feel\r\n<strong>very strongly </strong>that we should always be able to drop down into the .js and debug readable code even when source maps mature. &nbsp;I know there are other topics on this...floating around. Put me in the camp of idiomatic .js compilation so we\r\n always retain the ability to debug readable .js! &nbsp;I respect others opinions on this, but there's no reason that we can't have both powerful .ts AND readable .js output.</p>\r\n",
    "PostedDate": "2012-11-30T11:47:23.21-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]