[
  {
    "Id": "1126948",
    "ThreadId": "470546",
    "Html": "First of all, i like the overall specification of typescript, you guys did an amazing job!\r<br />\nBut although i would not call my self an javascript beginner, i felt that there is something wrong with the handling of the keyword &quot;this&quot;.\r<br />\n<br />\nI think it is a bad design, if the same keyword has different meanings depending on the context. It is is neither transparent [1] nor practical [2]. It is not nonambiguous!\r<br />\n<br />\nWould it be more sophisticated, if there would be another keyword for &quot;this object&quot;. For example &quot;self&quot;. The meaning would be transparent and you can use both &quot;this&quot; and &quot;self&quot; in one function body (without introducing a &quot;self&quot; variable outside the function/lambda.\r<br />\n<br />\n[1] by the means of looking at the function body\r<br />\n[2] sometimes you need &quot;this&quot; to be the references to the current function AND a reference to the class around it. so basically you need to introduce a variable outside the function to &quot;this&quot;<br />\n",
    "PostedDate": "2013-11-20T00:44:46.107-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1127321",
    "ThreadId": "470546",
    "Html": "<blockquote>\nI think it is a bad design, if the same keyword has different meanings depending on the context. It is is neither transparent [1] nor practical [2]. It is not nonambiguous! <br />\n</blockquote>\nThe problem is that TypeScript needs to correctly model existing JavaScript code, and the semantics you're describing for 'this' are just those defined by JavaScript (arrow functions being a part of the upcoming ES6). Arrow functions are meant to help model some common patterns with 'this' contexts changing while you can manually bind 'this' in the scope you need and capture that value where needed.\r<br />\n<br />\nThere are some additional features that could help improve the situation here but it will always need to be compatible with existing JavaScript and TypeScript.<br />\n",
    "PostedDate": "2013-11-20T16:07:18.613-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": "2013-11-21T01:48:15.827-08:00"
  },
  {
    "Id": "1127447",
    "ThreadId": "470546",
    "Html": "OK, thank you. I didn´t check on the new features of ES6 and i thought, the &quot;this&quot; implementation is a typescript feature.\r<br />\nAlthough i think its the right way to be compatible to ES6, personally i dont like the ambiguous design of &quot;this&quot; feature.\r<br />\n<br />\nThank you very much for TypeScript, i´m looking forward to the next version of the visual studio extension.<br />\n",
    "PostedDate": "2013-11-21T01:54:30.193-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]