[
  {
    "Id": "1277336",
    "ThreadId": "554010",
    "Html": "How can you invoke ASP.NET's own __doPostBack method using TypeScript?\r<br />\n<br />\nIt throws a standard &quot;Could not find symbol&quot; error when you try to access the method. I searched around with google but couldn't find a .d typedefinition file for ASP.NET's JS classes/methods.<br />\n",
    "PostedDate": "2014-07-24T07:20:32.403-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1277440",
    "ThreadId": "554010",
    "Html": ".d.ts files only provide type information, not implementations. If the error you're seeing is a runtime one then it sounds like you have not loaded the .js files that provide the implementation for __doPostBack. If you mean you have a variable of a non-any type that is giving you a static error in VS then you would need to provide some type information (either in a referenced .d.ts or your own ambient declarations) that will allow the compiler to verify whether the type you're using actually has a __doPostBack member.<br />\n",
    "PostedDate": "2014-07-24T12:08:09.523-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1277589",
    "ThreadId": "554010",
    "Html": "I'm not asking for implementation, but type information... and I most certainly cannot load or reference a .js file which contains the definition of __doPostBack. ASP.NET does it itself.<br />\n<br />\n__doPostBack is ASP.NET's very own JavaScript function, it's included in every single WPF website out there. This is the function that ASP.NET itself uses to post back to the server with it's &lt;asp:<em>anything</em>&gt; controls.<br />\nThere are a lot of cases when developers call this method from JavaScript to initiate a postback in the name of a webcontrol on the page (e.g.: a hidden button). See <a href=\"http://stackoverflow.com/questions/3591634/how-to-use-dopostback\" rel=\"nofollow\">StackOverflow</a> for reference.<br />\n<br />\n__doPostBack is very commonly used and I find it very strange that TypeScript has no idea what it is. I like TypeScript overall, but I just cannot understand how it doesn't have the type information of ASP.NET's very own javascript functions.<br />\n",
    "PostedDate": "2014-07-25T00:05:29.743-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1277630",
    "ThreadId": "554010",
    "Html": "Looks like this is all I needed:\r<br />\n<br />\ndeclare function __doPostBack(eventTarget: string, eventArguments: any);<br />\n",
    "PostedDate": "2014-07-25T02:00:29.98-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1277840",
    "ThreadId": "554010",
    "Html": "It is not feasible for TypeScript to include by default every single piece of type information from common frameworks in its core lib.d.ts. Certainly JQuery, Underscore, etc are also extremely common libraries but we still leave it up to the user to include the necessary type information (generally in the form of a .d.ts from DefinitelyTyped or elsewhere) for the library they want. Did you try the ASP.NET MVC templates with TypeScript configured?<br />\n",
    "PostedDate": "2014-07-25T13:47:52.993-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]