[
  {
    "Id": "1098873",
    "ThreadId": "459032",
    "Html": "I have two questions about modules:<br />\n<ol>\n<li>Could the difference between external vs internal modules more accurately be described as implicit vs explicit modules?</li>\n<li>What is the intended use case of ambient internal modules. Most of the time you want to define ambient external modules so they can be imported. What would be the case where you want to define a module to be used without importing it?</li>\n</ol>\n",
    "PostedDate": "2013-09-24T23:12:12.213-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1099427",
    "ThreadId": "459032",
    "Html": "Ambient vs non-ambient and external vs internal are really two independent things.\r<br />\n<br />\nYou use ambient declarations when you're simply describing existing values and types without implementing them in that compilation unit. Ambient declarations can describe internal modules, external modules, classes, vars, etc.\r<br />\n<br />\nInternal modules are for organizing types and values into namespaces, optionally using the true privacy provided by the closure module pattern. You can use an internal module inside an external module to further organize your code.\r<br />\n<br />\nExternal modules are for use in loader systems like those used in RequireJS or node. If you want to use a module loader, you'll write code in an external module. If you're just loading your JS straight through a <code>script</code> tag, you won't.<br />\n",
    "PostedDate": "2013-09-25T16:20:48.917-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1099576",
    "ThreadId": "459032",
    "Html": "Yes, the meaning of ambient is quite clear to me. I was just trying to understand external and internal and wondered whether they could be thought of as simply explicit and implicit modules or if there is something else to them that is not captured by those descriptions.\r<br />\n<br />\nSo you would use ambient internal modules mostly for simple client side code and ambient external modules for the rest?\r<br />\n<br />\nI thought there was also something about not being able to extend members of ambient internal modules.<br />\n",
    "PostedDate": "2013-09-26T03:12:30.523-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]