[
  {
    "Id": "1231589",
    "ThreadId": "541544",
    "Html": "I can't install (and won't) VS2013 Update 2 until it's RTM/RTW.\r<br />\n<br />\nHow can I get v1.0 installed for VS2013, I need to support TypeScript applications for both versions of VS.<br />\n",
    "PostedDate": "2014-04-07T16:33:27.103-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1234132",
    "ThreadId": "541544",
    "Html": "no answer yet.<br />\n\r<br />\nSo either it's not possible, or you don't want to admit that this was a screw-up in the release management !<br />\n",
    "PostedDate": "2014-04-14T18:02:51.107-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1234159",
    "ThreadId": "541544",
    "Html": "Thanks for popping this back on top of the stack.  I saw it earlier but got pulled off to something else before I had a chance to respond.\r<br />\n<br />\nOur focus has been on providing a single supported way to get TypeScript 1.0 on Visual Studio 2013 and single power tool for Visual Studio 2012.  This keeps the support and test matrix simpler and reduces any potential issues over which is the correct download to choose for VS support.  With TypeScript becoming an in-box supported language starting with 1.0, this allows the updates to follow along with the Visual Studio updates.  Ultimately, people can stay up-to-date without having to manage a separate download.\r<br />\n \r<br />\nIs there a blocker around installing Update 2 RC? If you're not able to update until Update 2 RTM, I suspect that it won't be too terribly long.  I'm not sure of the exact date.\r<br />\n<br />\nApologies for any inconvenience while the update cadence snaps into place.<br />\n",
    "PostedDate": "2014-04-14T20:36:06.837-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1234166",
    "ThreadId": "541544",
    "Html": "Is there a blocker.... yes it is still Release Candidate.<br />\n",
    "PostedDate": "2014-04-14T20:59:15.267-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]