[
  {
    "Id": "1220587",
    "ThreadId": "538393",
    "Html": "I am using Visual Studio 2013 Professional.\r<br />\n<br />\nI recently updated to the 1.0RC version for TypeScript. I had been using 9.1.1. I noticed a difference in the way the compiler handles the /// &lt;reference... comment to include ts files. Formerly, I was able to include .js files in my Jasmine Unit test project (without any compile errors), which is required because I am using ReSharper, which does not yet support TypeScript Unit testing. \r<br />\n<br />\nThe unit tests run properly when I include the /// &lt;reference path=&quot;../Buffer.js&quot; /&gt; comment, but the project shows an error for each of the includes. Since I have MANY such includes, it generates a very large number of errors. The good news is that the tests do run properly, but the bad news is that the large number of 'include' errors makes it very difficult to detect real errors.\r<br />\n<br />\nIs there any workaround for this?\r<br />\n<br />\nThanks...<br />\n",
    "PostedDate": "2014-03-08T05:42:25.683-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1220594",
    "ThreadId": "538393",
    "Html": "I figured out how to eliminate the errors. \r<br />\n<br />\nOriginally, I had created .ts test files because I had thought Resharper could perform Jasmine unit tests for TypeScript. Later, I found out from the Resharper folks that this configuration will not be supported until the next release. I had written unit tests in JavaScript but had placed the tests in .ts files so that I could easily migrate to TypeScript unit testing when supported by Resharper. However, with the latest TypeScript version I started seeing the compile errors.\r<br />\n<br />\nWhat I did was to rename all the .ts files to .js and it compiled without errors. I will have to changed back to .ts files when ReSharper supports this configuration, but that is not a big deal.\r<br />\n<br />\nRegards...<br />\n",
    "PostedDate": "2014-03-08T06:29:03.337-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]