[
  {
    "Id": "927869",
    "ThreadId": "399696",
    "Html": "\r\n<p>I was thinking, might it be beneficial to have a discussion area to the specific plugins? (Here i mean for VIM, Visual Studio etc.)...<br>\r\n<br>\r\nSince i don't feel that these discussions would be about the &quot;Language&quot;, but instead bringing ideas on what we would like to have automated or have settings for in these tools.<br>\r\n<br>\r\nBut I am not sure that there would be enough discussion emphasized around that.&nbsp;</p>\r\n",
    "PostedDate": "2012-10-17T00:42:42.72-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "931150",
    "ThreadId": "399696",
    "Html": "<p>Discussions might be a good place to exchange tips and tricks.&nbsp;</p>\r\n<p>For feature requests, a better place is probably the issue tracker.&nbsp; That way the suggestion can be more easily moved to someone who will see it, and we could track discussions about each feature.</p>",
    "PostedDate": "2012-10-23T08:24:30.753-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "931229",
    "ThreadId": "399696",
    "Html": "<p>Hi,</p>\r\n<p>I was actually thinking of writing a plugin to any light editor (notepad++ etc) including the intellisense. The motivation is simple. Visual studio is huge and slow on old machines... But I find it very difficult to write a plugin without knowing how to. Do you plan to write a small article on the basic stuff of the typescript language service? That would help a lot in developing any plugins for other IDEs.</p>\r\n<p>BTW: Is there anybody already working on a plugin for any IDE?</p>",
    "PostedDate": "2012-10-23T10:52:47.413-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1070291",
    "ThreadId": "399696",
    "Html": "I started a notepad ++ plugin project. you can find it here: <a href=\"https://github.com/hansrwindhoff/nppPluginTypescript.git\" rel=\"nofollow\">https://github.com/hansrwindhoff/nppPluginTypescript.git</a><br />\n<br />\ndoes compile on save and runs js in nodejs<br />\n<br />\nIf someone wants to put intelli-sense in, that would be great!<br />\n<br />\nThere is a syntax coloring xml file at: <a href=\"https://gist.github.com/wate/5077019\" rel=\"nofollow\">https://gist.github.com/wate/5077019</a><br />\nthis gist is not related to me.<br />\n",
    "PostedDate": "2013-07-18T21:24:12.867-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]