[
  {
    "Id": "1215289",
    "ThreadId": "535688",
    "Html": "After upgrading to the 1.0 RC, things are much worse.\r<br />\nPrior to this upgrade I've seen what seems to have been memory leaks in VS and frequent freezing of the browser (many times it freezes when I try to dynamically add a break-point during run-time, or by simply trying to step-into a typescript function).\r<br />\n<br />\nNow, after the 1.0 RC, I noticed the following:<br />\n<ul>\n<li>Noticeably massive sluggishness all around from VS 2012.</li>\n<li>Double-clicking to highlight a word takes a noticeable delay.</li>\n<li>F12 (to goto definition didn't work) - this appears to have been fixed after doing a Repair install again.</li>\n<li>Unable to set breakpoints in Typescript (&quot;This is not a valid location for a breakpoint&quot;).</li>\n<li>Intellisense is not working.</li>\n</ul>\n",
    "PostedDate": "2014-02-26T11:46:40.043-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1215297",
    "ThreadId": "535688",
    "Html": "Could you expand on the characteristics of your project where you're seeing this? Or is this happening for all projects now?<br />\n",
    "PostedDate": "2014-02-26T12:14:37.083-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1215299",
    "ThreadId": "535688",
    "Html": "I only have one project, under one solution.\r<br />\nCan you confirm that I should not be seeing these issues under VS 2012?<br />\n",
    "PostedDate": "2014-02-26T12:18:08.213-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1215307",
    "ThreadId": "535688",
    "Html": "Just to add to this...\r<br />\n<br />\nThe issue that is THE MOST frustrating is the freezing.\r<br />\nThe entire IDE freezes, and it takes several seconds (more than a mere 5-10 seconds sometimes) before VS decides to behave again.\r<br />\nNote that during this freeze-up, the Memory and CPU usage seems normal (they're not high in usage whatsoever).<br />\n",
    "PostedDate": "2014-02-26T12:28:26.353-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1215348",
    "ThreadId": "535688",
    "Html": "If intellisense is not working at all, you may be in a bad state with the install.  We've seen this on rare occasion.<br />\n\r<br />\nTo work around it, you may want to try uninstalling, making sure your C:\\Program Files (x86)\\Microsoft Visual Studio 11.0\\Common7\\IDE\\CommonExtensions\\Microsoft\\TypeScript directory is clean, then installing again.<br />\n\r<br />\nIf that doesn't fix it, please let us know.<br />\n",
    "PostedDate": "2014-02-26T14:20:34.34-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1215369",
    "ThreadId": "535688",
    "Html": "<a href=\"mailto:@jonturner\" rel=\"nofollow\">@jonturner</a>. Things are looking much, much better now... Thanks!<br />\n",
    "PostedDate": "2014-02-26T15:54:20.79-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1215371",
    "ThreadId": "535688",
    "Html": "FYI, everything is better, BUT, the performance (sluggish) issue is still painfully present.<br />\n",
    "PostedDate": "2014-02-26T16:00:50.663-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1215376",
    "ThreadId": "535688",
    "Html": "...And one more thing: Go-to-definition (F12), it seemed to be working after i did a fresh install.\r<br />\nBut after a moment of coding it now seems to be broken again.\r<br />\n<br />\n:(<br />\n",
    "PostedDate": "2014-02-26T16:16:45.667-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1215392",
    "ThreadId": "535688",
    "Html": "I lost the ability to set breakpoints again.\r<br />\n<br />\n:(<br />\n",
    "PostedDate": "2014-02-26T17:09:26.373-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1215397",
    "ThreadId": "535688",
    "Html": "I moved over to VS 2013. So far it feels better.\r<br />\nIf this resolves my issue(s), then can we safely say there is an issue with Typescript and VS2012 integration???<br />\n",
    "PostedDate": "2014-02-26T17:41:07.277-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1215412",
    "ThreadId": "535688",
    "Html": "You are certainly not the only person using TypeScript on VS2012 so if it was always this bad we would know ;) You may certainly have hit some bug causing performance issues but without a consistent repro performance issues like this will be very hard to track down.<br />\n",
    "PostedDate": "2014-02-26T18:58:08.123-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1215414",
    "ThreadId": "535688",
    "Html": "If it helps, the file size of my single, .js file which is generated by all of my Typescripts files put together (easily more than 20 files with many classes per file), is over 500 KB.\r<br />\n<br />\nThanks.<br />\n",
    "PostedDate": "2014-02-26T19:02:29.093-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1216017",
    "ThreadId": "535688",
    "Html": "I'm experiencing the same issues in VS2013. \r<br />\n<br />\nFreezing between moving the caret is extremely frustrating. Removed all my extensions bar Visual SVN and still experiencing freezing issue. I have a 0.5-1 sec delay in moving the cursor.\r<br />\n<br />\nI also cannot set breakpoints on code that I previously could.\r<br />\n<br />\nFor now I've rolled back to ver 0.9.5 which is all working correctly. \r<br />\n<br />\nNot the end of the world as it is an RC, but was looking forward to getting my hands on 1.0.<br />\n",
    "PostedDate": "2014-02-28T01:58:07.23-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1216443",
    "ThreadId": "535688",
    "Html": "I'm also experiencing freezes on VS 2013. Two places I'm certain freezes happen every time are:<br />\n<ol>\n<li>When renaming a TS file, VS will freeze for 5 seconds</li>\n<li>\nCopy/Paste a file in the same project, VS will freeze when I paste the file<br />\n</li>\n</ol>\nOther than that, I also experience random freezes when saving a files, sometimes takes 2-3 seconds without being able to move the cursor. This happens exclusively with TS files. I have more C# files than TS files in my project, and they don't cause these issues.\r<br />\n<br />\nThese freezes are not new to TS 1.0 RC, I remember having these since started using TS, but have seem less of them lately.\r<br />\n<br />\nOn 0.9.5, sometimes I had freezes I had to force close VS 2013. Looking at Procmon when that happened looked like an infinite loop of some kind, as I could see the same calls to TSC being made again and again with 100% cpu usage. Didn't get this kind of freeze with 1.0 RC yet, but I have been using it only for a couple of days.<br />\n",
    "PostedDate": "2014-03-01T05:10:16.62-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1217258",
    "ThreadId": "535688",
    "Html": "I'm not experiencing any freezing across a relatively large codebase in VS 2013.\r<br />\n<br />\nHowever, performance in the 1.0RC is down across the board.\r<br />\n<br />\nThis includes both project compilation and intellisense in Visual Studio.\r<br />\n<br />\nThis is a shame because many other outstanding issues appear to have been resolved.<br />\n",
    "PostedDate": "2014-03-02T13:42:59.713-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1218848",
    "ThreadId": "535688",
    "Html": "I'm using VS 2013 Express for web and faced the same issues (F12, intellisense, etc... no more working) after an upgrade from 0.9.5.\r<br />\nIn fact when I opened a file, the 2 list boxes on top of the edit window displayed &quot;refreshing...&quot; and never left this &quot;state&quot;.\r<br />\n<br />\nI uninstalled TypeScript, directly reinstalled 1.0 RC, same issues.\r<br />\nI applied the patch <a href=\"https://typescript.codeplex.com/SourceControl/changeset/30dd016c5cb952c61b9fabb6bf9d155e697788ee\" rel=\"nofollow\">https://typescript.codeplex.com/SourceControl/changeset/30dd016c5cb952c61b9fabb6bf9d155e697788ee</a>, but same issues.\r<br />\n<br />\nFinally I reinstalled 0.9.5...<br />\n",
    "PostedDate": "2014-03-04T00:39:09.613-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1219047",
    "ThreadId": "535688",
    "Html": "This discussion has been copied to a work item. Click <a href=\"https://typescript.codeplex.com/workitem/2258\" rel=\"nofollow\">here</a> to go to the work item and continue the discussion.<br />\n",
    "PostedDate": "2014-03-04T08:05:17.59-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1219049",
    "ThreadId": "535688",
    "Html": "This discussion has been copied to a work item. Click <a href=\"https://typescript.codeplex.com/workitem/2259\" rel=\"nofollow\">here</a> to go to the work item and continue the discussion.<br />\n",
    "PostedDate": "2014-03-04T08:06:39.363-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1219050",
    "ThreadId": "535688",
    "Html": "This discussion has been copied to a work item. Click <a href=\"https://typescript.codeplex.com/workitem/2260\" rel=\"nofollow\">here</a> to go to the work item and continue the discussion.<br />\n",
    "PostedDate": "2014-03-04T08:07:25.07-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1219066",
    "ThreadId": "535688",
    "Html": "Sounds like there are a few different issues.  I've created separate work items for the &quot;refreshing...&quot; forever, degraded performance, and IDE freezing.  If you have any more information that might help us track down what's going on, please add it to the items.  \r<br />\n",
    "PostedDate": "2014-03-04T08:44:35.31-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1219110",
    "ThreadId": "535688",
    "Html": "Since I'm not sure all of you are tracking the issues in the issue tracker, I'll add this here.\r<br />\n<br />\nThe TypeScript tools in VS only invoke the compiler when actually compiling the project. It sounds like there is an extension interfering with your experience, do you have any installed? Like Web Express, Resharper, etc.\r<br />\n<br />\nThe easier to find this is in Help, About, and than use the &quot;Copy Info&quot; button.\r<br />\n<br />\nIt would be helpful if you can add that information to the issues Jon created.<br />\n",
    "PostedDate": "2014-03-04T10:17:44.717-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1219124",
    "ThreadId": "535688",
    "Html": "Yes, I have WebEssentials/Typescript on my VS 2012.\r<br />\nShould this be uninstalled?\r<br />\n<br />\nIf so, it should be clear somewhere to uninstall things.\r<br />\n<br />\nThanks.<br />\n",
    "PostedDate": "2014-03-04T10:43:44.587-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1219144",
    "ThreadId": "535688",
    "Html": "Tools -&gt; Extensions and Updates\r<br />\n<br />\nYou can disable or uninstall from there, you should also make sure those extensions are updated.<br />\n",
    "PostedDate": "2014-03-04T11:26:37.34-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1219168",
    "ThreadId": "535688",
    "Html": "<strong>paulb wrote:</strong><br />\n<blockquote>\nThe TypeScript tools in VS only invoke the compiler when actually compiling the project.<br />\n</blockquote>\n@paul, doesn't the TypeScript language service run constantly in the background when one is making edits to TypeScript files?<br />\n",
    "PostedDate": "2014-03-04T12:12:27.2-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1219183",
    "ThreadId": "535688",
    "Html": "@nabog yes the language service runs, but that runs as part of the devenv.exe process not the tsc.exe process.<br />\n",
    "PostedDate": "2014-03-04T12:34:53.92-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1219332",
    "ThreadId": "535688",
    "Html": "Before rolling back to 0.9.5 I disabled all extensions and then uninstalled them too, this made no difference in my case.<br />\n",
    "PostedDate": "2014-03-05T00:23:59.667-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1219846",
    "ThreadId": "535688",
    "Html": "Is there anything we can do to provide more info to solve these problems other than &quot;try to uninstall all extensions&quot;?\r<br />\n<br />\nI'm using VS 2013 and today intellisense stopped working on TS files, no updates, no changes to the project. Was working fine yesterday, I'm pretty sure if I just reboot or wait a while, it will be back magically again as usual.\r<br />\n<br />\nIt seems strange to me that 3rd party extensions are affecting typescript so much for so many people, but have no effect on any other language on VS. Something is not right. Should TS be so fragile compared to other languages VS supports?\r<br />\n<br />\nAlso, there are people on my team complaining about this, but they don't use the forum, and are just expecting 1.0 final to have this sorted out. So, not everybody having these problems are reporting it.\r<br />\n<br />\nIs there a way we can help trace this issue or even find out exactly what is causing it?\r<br />\nMaybe a way to run VS in some &quot;debug mode&quot;, that generates a log we can send? Even a procmon trace, I don't know.<br />\n",
    "PostedDate": "2014-03-06T04:59:38.483-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1219856",
    "ThreadId": "535688",
    "Html": "Maybe look at <a href=\"https://typescript.codeplex.com/workitem/2253\" rel=\"nofollow\">https://typescript.codeplex.com/workitem/2253</a>.\r<br />\nIt was linked to using a specific output directory.<br />\n",
    "PostedDate": "2014-03-06T05:22:52.357-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1219859",
    "ThreadId": "535688",
    "Html": "This seems unrelated to the problem I'm experiencing.<br />\n",
    "PostedDate": "2014-03-06T05:29:23.177-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1222447",
    "ThreadId": "535688",
    "Html": "Hi,\r<br />\n<br />\nI've been doing some refactoring inside a fundamental part of the codebase today and TypeScript seems to be showing a pattern of causing VS to hang for periods of up to a couple of minutes.\r<br />\n<br />\nThe solution within Visual Studio 2013 Ultimate looks like this.\r<br />\n<br />\n<strong>1. Project A</strong><br />\n<pre><code>    - Interface A\n    - Interface B\n    + 100 or so interfaces.\n</code></pre>\n\n<strong>2. Project B</strong><br />\n<pre><code>    - Class A implements interface A\n    - Class B implements interface B\n    - Plus other classes that reference and implement other interfaces from Project A\n</code></pre>\n\n<strong>3. Projects C, D, E etc</strong> have a total of 300+ classes that<br />\n<pre><code>     - reference Interface A and B from Project A.\n     - reference  and implement other interfaces from Project A\n</code></pre>\n\nEach project is compiled into an out file. All modules are internal and files import types via &lt;reference&gt;.\r<br />\n<br />\nToday, I was porting some methods from Interface A to Interface B. After the cut and paste operation in Project A, I started refactoring code in Project B. At this point there was a consistent delay in the editor and the red squiggly line started becoming quite sticky. A couple of times I started seeing the circular toilet bowl of death and VS become unresponsive for a few minutes, before returning back to normal.\r<br />\n<br />\nThe problem as I see it is since 1.0RC when a change is made in a part of the codebase that is heavily referenced by other parts of the codebase the stickiness and hang ups start kicking in.\r<br />\n<br />\nThe overall compilation time is also down.\r<br />\n<br />\nThis is obviously not a lot to go by, but I hope it provides an insight or two into the problem.<br />\n",
    "PostedDate": "2014-03-13T10:32:40.213-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1225964",
    "ThreadId": "535688",
    "Html": "Another identifiable case that is causing sluggishness (as noted by @nvivo above) is when a file is renamed in Visual Studio.\r<br />\n<br />\nThe renaming itself is also slow: for control to return to the editor from the point of renaming can take a number of seconds (I counted 10 just now). Often it's the first renaming that is slow, and subsequent renaming can be faster.\r<br />\n<br />\nFollowing a rename, where the class within the file is also renamed, there is a noticeable slowdown in the IDE, with &quot;refreshing&quot; showing up for extended periods.<br />\n",
    "PostedDate": "2014-03-24T05:15:41.64-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]