[
  {
    "Id": "1090177",
    "ThreadId": "456241",
    "Html": "I've been trying to find the cause of a very misleading compiler error:\r<br />\n<br />\n&quot;Unable to get property 'type' of undefined or null reference - VSTSC&quot;\r<br />\n<br />\nI took to deleting code line-by-line, and seem to have found the cause; this line:<br />\n<pre><code>ns[&quot;&quot;] = attrValue;</code></pre>\n\nIt may look strange, but I believe it to be valid to have an empty string as a property name - in this case, I'm getting a list of XML namespaces, and this particular line is setting the default namespace in 'attrValue' to object 'ns'.\r<br />\n<br />\nAnyway, that seems to be the cause of the error, even though the error message itself doesn't seem to relate to it.\r<br />\n<br />\nI can get around this with:<br />\n<pre><code>var empty = &quot;&quot;;\nns[empty] = attrValue</code></pre>\n\nI think this may be a bug, but I thought I'd post it here first to see if others can reproduce or give a reason why it might be happening. Thanks.<br />\n",
    "PostedDate": "2013-09-09T06:12:32.023-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1090180",
    "ThreadId": "456241",
    "Html": "Just an update... the problem seems to have disappeared. I've no idea why. I was experimenting with settings an empty property name on another object, setting it to a constant, etc. with varying results until I reverted back to my original code... and now it works. \r<br />\n<br />\nWish I could say why.<br />\n",
    "PostedDate": "2013-09-09T06:19:17.233-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1090230",
    "ThreadId": "456241",
    "Html": "If I'm remembering right, there's a known issue about something similar.  Perhaps it only happens under certain conditions.  If you manage to see the breakage again, please file an issue report with the code that it fails on.<br />\n",
    "PostedDate": "2013-09-09T08:36:33.643-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1090300",
    "ThreadId": "456241",
    "Html": "I recalled the same, I see this one which matches what you're seeing: <a href=\"https://typescript.codeplex.com/workitem/1522\" rel=\"nofollow\">https://typescript.codeplex.com/workitem/1522</a>, feel free to upvote it if so.<br />\n",
    "PostedDate": "2013-09-09T11:17:24.587-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1090572",
    "ThreadId": "456241",
    "Html": "I'd love to give more information, but the problem completely disappeared on me. The same line of code is now working while I was trying to figure out what might be causing it. It may well be related to the posted work item, my code looks very similar. I've upvoted it regardless. \r<br />\n<br />\nIf it reoccurs, I'll update.\r<br />\n<br />\nThanks.<br />\n",
    "PostedDate": "2013-09-10T03:56:51.297-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]