[
  {
    "Id": "1117155",
    "ThreadId": "465292",
    "Html": "I would like to be able to at compile-time extract the type model and use it at runtime for various purposes.\r<br />\n<br />\nOne is being able to generate something like a json-schema (or altenratives). Another is generating duck-type tests.\r<br />\n<br />\nMaybe the compiler can use an keyword or comment-based annotation to inject this model into a given variable.\r<br />\n<br />\nI can see how this could work as a pre-processor using the compiler code and the SyntaxTree (similar to how TSLint extracts and walks the tree).\r<br />\n<br />\nAnyone got ideas on this?<br />\n",
    "PostedDate": "2013-11-04T05:41:44.723-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1117333",
    "ThreadId": "465292",
    "Html": "There was a <a href=\"https://typescript.codeplex.com/discussions/458594\" rel=\"nofollow\">related discussion</a> recently.<br />\n<br />\nI too would like to see this for what you call &quot;duck-type&quot; tests or fakes, for which there is an <a href=\"https://typescript.codeplex.com/workitem/706\" rel=\"nofollow\">issue ticket out</a>.<br />\n<br />\nI prefer that TypeScript not create any variables or functions in order to provide this, because that hints at TypeScript evolving into something that borders on a framework (a completely undesirable scenario IMO!).<br />\n<br />\nRather I would like to see TypeScript generate a types meta file containing the necessary type information in JavaScript format.<br />\n",
    "PostedDate": "2013-11-04T11:23:09.947-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1117338",
    "ThreadId": "465292",
    "Html": "@Bartvds, just noticed that you had commented on the related issue. Not sure what's going on. Short term amnesia?! :-)<br />\n",
    "PostedDate": "2013-11-04T11:29:13.91-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1117348",
    "ThreadId": "465292",
    "Html": "@nabog I never saw those replies, so I'd reposted top-level.\r<br />\n<br />\nLooks like I assumed email-notifications to be enabled by default like on github, but I enabled them now. (I did get you messages.. because I created the thread?\r<br />\n<br />\nThanks for noting this as there is some good stuff in the other thread.,<br />\n",
    "PostedDate": "2013-11-04T11:40:56.363-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1117399",
    "ThreadId": "465292",
    "Html": "Ah! that explains it.\r<br />\n<br />\nI don't use the email notification mechanism myself, instead I have a simple rule for keeping up-to-date: Every time Visual Studio crashes on me I visit the forum while waiting for it to restart and reload all my projects.\r<br />\n<br />\nI am here quite often.<br />\n",
    "PostedDate": "2013-11-04T13:05:38.933-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1117404",
    "ThreadId": "465292",
    "Html": "... wishing I could 'like' a forum post right about now.<br />\n",
    "PostedDate": "2013-11-04T13:24:19.843-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1117411",
    "ThreadId": "465292",
    "Html": "My WebStorm doens't come with this periodic go-do-something-else trigger so that explains it then :D<br />\n",
    "PostedDate": "2013-11-04T13:37:57.997-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]