[
  {
    "Id": "957552",
    "ThreadId": "407141",
    "Html": "\r\n<p>Hello Community,</p>\r\n<p>I am investigating TypeScript, and I'm curious about the overall vision for a development paradigm.</p>\r\n<p>To me, when I think of a TypeScript application, I would like to think of it as a set of TypeScript projects in Visual Studio that operate and function precisely as a set of C# projects do.&nbsp; That is, I open Visual Studio, and Create New Project --&gt;\r\n New TypeScript project.</p>\r\n<p>These projects would then compile to the expected JavaScript files upon compile.</p>\r\n<p>Is this how it operates?&nbsp; If not, are there plans to make it this way?&nbsp; I have been digging around and I cannot find any of this functionality currently.&nbsp; Maybe I'm looking in the wrong place.</p>\r\n<p>Any guidance would be appreciated!</p>\r\n<p>Thank you,</p>\r\n<p>Michael</p>\r\n",
    "PostedDate": "2012-12-18T04:18:18.183-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "957570",
    "ThreadId": "407141",
    "Html": "\r\n<p>This is pretty much how it works right now. I literally open VS, create a new Solution, add a TypeScript project and then start coding. Sometimes you will need to manually tweak the project file (or use the free VS extension MS provides) or create a custom\r\n build action, but basically what you've described here is the process I go through every day. Unless there was something further you were expecting?</p>\r\n",
    "PostedDate": "2012-12-18T04:46:29.187-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "957572",
    "ThreadId": "407141",
    "Html": "\r\n<p>Hmmmm... Maybe my install is horked.&nbsp; I do not see a TypeScript Project in my Add New Project dialog.&nbsp; Is it under Visual C#?&nbsp; Or perhaps I don't have something obvious installed?&nbsp; I installed the latest version of this:</p>\r\n<p><a href=\"http://www.microsoft.com/en-us/download/details.aspx?id=34790\">http://www.microsoft.com/en-us/download/details.aspx?id=34790</a></p>\r\n",
    "PostedDate": "2012-12-18T04:49:26.197-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "957575",
    "ThreadId": "407141",
    "Html": "\r\n<p>This is what I see for a Add New Project dialog:</p>\r\n<p>&nbsp;<img src=\"https://wpppjq.blu.livefilestore.com/y1pvsmo-fxHUuf5Ma9jIWEfFEFP6UbRLLNS1z7GIC1CdAG4LS7CGb1gzV0VcSuXCTExp3c_Ev1joe4/TypeScript.png?psid=1\" alt=\"\"></p>\r\n",
    "PostedDate": "2012-12-18T04:51:56.697-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "957576",
    "ThreadId": "407141",
    "Html": "\r\n<p>New Project -&gt; Installed -&gt; Templates -&gt; Other Languages -&gt; Visual C# -&gt; then pick &quot;HTML Application with TypeScript&quot;</p>\r\n<p>I know, I know. It makes no sense at all to have it under C#, but there you go.</p>\r\n<p>If you can't see this option I suspect it's not installed properly.</p>\r\n",
    "PostedDate": "2012-12-18T04:52:20.047-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "957583",
    "ThreadId": "407141",
    "Html": "\r\n<p>Hmmm... as you can see, I do not have Visual C# under Other Languages...</p>\r\n",
    "PostedDate": "2012-12-18T04:56:50.86-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "957587",
    "ThreadId": "407141",
    "Html": "\r\n<p>OK... Uninstalling the .exe and reinstalling did the trick.&nbsp; Thank you!!!</p>\r\n",
    "PostedDate": "2012-12-18T04:58:59.897-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "957603",
    "ThreadId": "407141",
    "Html": "\r\n<p>Alright, now that I have this working. :)</p>\r\n<ol>\r\n<li>I really like the .ts -&gt; .js conversions.&nbsp; This is what I would expect.&nbsp; However, I would like to be able to do this with my C# files.&nbsp; Is there a way to translate C# into .js files?&nbsp; That is... .cs -&gt; .js?&nbsp; If not, there should be. :)\r\n</li><li>The template that we mention above is for an application.&nbsp; I would like to see more of a traditional .NET approach with Class Assemblies, so that I can encapsulate common functionality into a library and include it within my applications.&nbsp; Is this possible/planned?\r\n</li></ol>\r\n<p>&nbsp;Thank you for any clarification!</p>\r\n",
    "PostedDate": "2012-12-18T05:23:34.183-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "957616",
    "ThreadId": "407141",
    "Html": "\r\n<p>1) No there's no way to translate C# to JS - well, you can do it manually of course, convert it line for line yourself ;)</p>\r\n<p>2) Doesn't exist out of the box, but isn't hard to emulate. We have one master project in our solution which compiles a set of commonly used libraries into a single definition file, which other projects then reference and use. Probably about as close as\r\n you're going to get right now. TypeScript isn't .NET, you're going to struggle a bit if you try to look for a one-to-one comparison between the two. Best to attack it with a fresh set of eyes imho. Plus it's still evolving at quite a rate, bit of a rollercoaster\r\n atm to be honest.</p>\r\n",
    "PostedDate": "2012-12-18T05:59:29.87-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "957622",
    "ThreadId": "407141",
    "Html": "\r\n<p>Hmmm... that is surprising as TypeScript was supposedly developed by the architect of C#/.NET, wasn't it?&nbsp; It just seems like it would follow the same pattern/paradigm of having any language compile &quot;down&quot; into script.</p>\r\n<p>I realize that this is still a preview tech.&nbsp; I'm just voicing my perspective having been in .NET over a decade (and still very much interested in being able to &quot;develop-once, run-anywhere&quot;), and from a market-adoption strategy, this seems like the &quot;right&quot;\r\n (not to mention&nbsp;obvious) thing to do.</p>\r\n<p>I have over 6 years' worth of code in a .NET framework.&nbsp; It would be awesome to port it over to TypeScript in an easy fashion and work with it just like I have been doing in .NET-land...</p>\r\n",
    "PostedDate": "2012-12-18T06:07:31.12-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "957627",
    "ThreadId": "407141",
    "Html": "\r\n<p>From the presentations he's given (and comments posted on these forums) it seemed clear, to me at least, that TypeScript was never meant to be a means to get .NET into JavaScript, or even to re-create that environment. I'm thankful for that personally, I\r\n need good clean exported JavaScript that plays well with the countless ways in which the web is built and TS offers me that. The JS code it produces understands the diversity of the web and fits in cleanly.</p>\r\n<p>Re-creating .NET in JS to me sounds like some kind of sister project that could use TS at its core, but isn't what TS set out to address. It's a level lower, i.e. the equivalent of the C# part of .NET, not the framework itself.</p>\r\n",
    "PostedDate": "2012-12-18T06:17:44.17-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "957631",
    "ThreadId": "407141",
    "Html": "\r\n<p>Cool... thanks for the clarification.&nbsp; There is also Script# and I've been checking that as well.&nbsp; That appears to be more aligned with what I'm looking to achieve.&nbsp; Thank you for the dialogue!</p>\r\n",
    "PostedDate": "2012-12-18T06:21:17.523-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "957675",
    "ThreadId": "407141",
    "Html": "\r\n<p>No problem. These are just my own personal observations of course. MS could release TypeScript .NET tomorrow for all I know! Just saying :)</p>\r\n",
    "PostedDate": "2012-12-18T07:09:26.207-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "958077",
    "ThreadId": "407141",
    "Html": "\r\n<p>my understanding has always been that the point of TypeScript is simply a layer on top of JavaScript that adds compile-time type checking, and validation to enable scalable (as in project size) development. I have never seen anything to suggest that there\r\n is any relationship with .Net.</p>\r\n",
    "PostedDate": "2012-12-18T17:36:15.77-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "958092",
    "ThreadId": "407141",
    "Html": "\r\n<blockquote style=\"padding-bottom:0px; font-style:italic; padding-top:0px; padding-left:0.25em; margin:0.25em 1em 0px; padding-right:0.25em; border:#ccc 0.1em solid\">\r\n<strong>MichaelDBang wrote:</strong><br>\r\n<p>Hmmm... that is surprising as TypeScript was supposedly developed by the architect of C#/.NET, wasn't it?&nbsp; It just seems like it would follow the same pattern/paradigm of having any language compile &quot;down&quot; into script.</p>\r\n</blockquote>\r\n<p>You're speaking about Anders Hejlsberg -&nbsp;who is indeed a member of the TypeScript team - but as far as most of us can determine, he only joined around the release 0.80 timeframe. So it would be a gross injustice to the other&nbsp;majority of people who developed&nbsp;TypeScript\r\n to attribute it all to one - albeit talented -&nbsp;figurehead. Of course, his involvement does elevate the external&nbsp;&quot;credibility&quot; of the project and I'm sure he will guide it well.</p>\r\n",
    "PostedDate": "2012-12-18T18:44:31.377-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "958093",
    "ThreadId": "407141",
    "Html": "\r\n<blockquote style=\"padding-bottom:0px; font-style:italic; padding-top:0px; padding-left:0.25em; margin:0.25em 1em 0px; padding-right:0.25em; border:#ccc 0.1em solid\">\r\n<strong>photonstorm wrote:</strong><br>\r\n<p>No problem. These are just my own personal observations of course. MS could release TypeScript .NET tomorrow for all I know! Just saying :)</p>\r\n</blockquote>\r\n<p>Someone in Microsoft has a pet project called Script# (scriptsharp) does exactly this: C# to javascript.</p>\r\n",
    "PostedDate": "2012-12-18T18:45:28.147-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "958102",
    "ThreadId": "407141",
    "Html": "\r\n<p>I can start a new Typescript project in VS, but I'm unable to get any of the sample applications to work in the VS environment.&nbsp; I can run them from Node commands but no luck in VS?&nbsp; Also, I don't understand why the only VS template lives in the C# area</p>\r\n",
    "PostedDate": "2012-12-18T19:58:10.713-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]