[
  {
    "Id": "1062111",
    "ThreadId": "448441",
    "Html": "I installed the public 0.9.0 MSI earlier today and was instantly blocked with a bug ( <a href=\"https://typescript.codeplex.com/workitem/1197\" rel=\"nofollow\">https://typescript.codeplex.com/workitem/1197</a> ) so I read that this bug was closed and fixed in the develop branch, so I'm trying to update the installed compiler. <br />\n<br />\nI'm somewhat confused at the role of all of the various parts of the build. I've managed to compile the latest develop branch (using node/jake) and I see in my built\\local folder:<br />\n<pre><code>jquery.d.ts\nlib.d.ts\ntsc.d.ts\ntsc.js\ntypescript.d.ts\ntypescript.js\ntypescriptServices.d.ts\ntypescriptServices.js\nwinjs.d.ts\nwinrt.d.ts</code></pre>\n\nI'm working off the latest changeset as of today. I ran the test suite, and got: <br />\n<pre><code>Scenarios: 5069 passed, 0 failed.\nTestcases: 8071 passed, 0 failed.\n  Blocked: 497</code></pre>\n\nI'm going to assume this means the compiler is in relatively good shape. Good enough to compile:<br />\n<pre><code>declare module Foo {\n        enum Bar {\n                A = 1, B = 2, C = 3\n        }\n}</code></pre>\n\nWhich, as of the released 0.9.0 is a problem - there's a bug which says ambient enum cannot have initializers. Apparently, it's been fixed ( <a href=\"https://typescript.codeplex.com/workitem/1197\" rel=\"nofollow\">https://typescript.codeplex.com/workitem/1197</a> ) and this is blocking me, so here I find myself.<br />\n<br />\nI followed the instructions at:<br />\n<br />\n<a href=\"http://blogs.msdn.com/b/typescript/archive/2013/01/29/trying-the-latest-typescript-build.aspx\" rel=\"nofollow\">http://blogs.msdn.com/b/typescript/archive/2013/01/29/trying-the-latest-typescript-build.aspx</a> <br />\n<br />\n...but this only replaces the typescriptService.js file. What about the rest of the output? Surely I need the compiler (tsc.js?) too? Or is this monolithic file the equivalent for Visual Studio? Do I need to do anything else as I replaced it at:<br />\n<pre><code>...\\Microsoft Visual Studio 11.0\\Common7\\IDE\\CommonExtensions\\Microsoft\\TypeScript</code></pre>\n\nAm I missing another step? I restarted Visual Studio 2012 to no avail. There are no messages from the language service, other than: &quot;Compiling TypeScript...&quot; - there are no errors either, and the JS output is never generated.<br />\n<br />\nIdeas?<br />\n",
    "PostedDate": "2013-06-27T11:27:50.99-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1062120",
    "ThreadId": "448441",
    "Html": "Since you compiled using node, you can compile using the following command line:\r<br />\n<br />\nnode local\\built\\tsc.js &lt;parameters&gt; &lt;files&gt;<br />\n",
    "PostedDate": "2013-06-27T11:58:22.547-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1062131",
    "ThreadId": "448441",
    "Html": "Hi Paul<br />\n<br />\nI'm actually trying to ask in a long winded way, how do I update the typescript compiler for Visual Studio 2012, the 0.9 MSI, by updating the compiler and language services from the develop branch? I know the plugin is not there, but I thought the JS files could simply be replaced? The compile process generates about ten files, but the blog entry says I should just update the languageservices.js file to update VS. That makes no sense to me. What about the other 9 files? <br />\n",
    "PostedDate": "2013-06-27T12:28:51.023-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]