[
  {
    "Id": "944595",
    "ThreadId": "403959",
    "Html": "\r\n<p>Hi,</p>\r\n<p>The reference includes mechanism is somewhat faulty and undermines confidence in the type system - in the sense that one cannot be certain that all compilation errors have been correctly identified when multiple projects are built concurrently.</p>\r\n<p>Here are a some of the issues:</p>\r\n<p><strong>Silent fails</strong></p>\r\n<p>Incorrect syntax in the path fails silently in the following circumstances, instead of displaying the red squiggly line:</p>\r\n<ul>\r\n<li>Omitting closing slash (&quot;/&quot;) in &quot;/// &lt;reference path=&quot;file.ts&quot; /&gt;&quot; </li><li>When the quotes (&quot;) around the path are missing </li><li>When the path specifies &quot;.../MyFolder&quot; instead of &quot;../MyFolder&quot;&nbsp; </li><li>When a &quot;.js&quot; extension is accidentally used instead of &quot;.ts&quot;&nbsp; </li><li>Space after path: path = &quot;file.ts&quot; does not work (although this doesn't seem to happen consistently)\r\n</li></ul>\r\n<p><strong>Build issues</strong></p>\r\n<ul>\r\n<li>If a referenced file is renamed, then projects containing a reference to that file continue to build successfully in spite of the invalid reference.\r\n</li><li>Invalid reference paths are sometimes only highlighted when the file containing the invalid reference opened.\r\n</li></ul>\r\n<p><strong>General usability issues</strong></p>\r\n<ul>\r\n<li>The editing of the path is a bit sticky. When an incorrect path is typed in and immediately corrected, the compiler continues to refer to the old path, and in order to force the new path to be recognised it is sometimes necessary to close and reopen the\r\n file. </li><li>The speed of detection is also rather slow; one finds oneself making an edit and then staring expectantly at the screen waiting to see if something is going to materialise.\r\n</li></ul>\r\n<p>&nbsp;</p>\r\n<p>The &lt;reference&gt; include mechanism feels like a leftover from the old JavaScript intellisense system, and TypeScript seems to need something shiny and new - and robust.</p>\r\n<p>Please advise.</p>\r\n<p>Thanks.</p>\r\n<p>Noel</p>\r\n",
    "PostedDate": "2012-11-20T07:26:40.58-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "944667",
    "ThreadId": "403959",
    "Html": "\r\n<p>Thanks for the in-depth analysis.&nbsp; I'm going to copy this over to the issue tracker so we can track them there (and may get split up further).</p>\r\n",
    "PostedDate": "2012-11-20T08:46:13.793-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "944668",
    "ThreadId": "403959",
    "Html": "This discussion has been copied to a work item. Click <a href=\"http://typescript.codeplex.com/workitem/466\">here</a> to go to the work item and continue the discussion.",
    "PostedDate": "2012-11-20T08:46:17.183-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]