[
  {
    "Id": "920718",
    "ThreadId": "397742",
    "Html": "\r\n<p>Would it be possible to make the &quot;.d.ts&quot; files reference-able from normal &quot;.js&quot; files, such that we could get Intellisense and static type analysis even in existing JS codebases?</p>\r\n<p>I'm guessing I could get most of this functionality by just configuring Visual Studio to use the TypeScript Editor for *.js files but this would likely also make for some confusing non-standard intellisense as well (e.g. suggesting I use the &quot;class&quot; keyword).</p>\r\n<p>Is this possible today? &nbsp;If not, could we get it via an update to the TypeScript Editor that would allow it to recognize the difference between &quot;.js&quot; and &quot;.ts&quot; files and change its Intellisense appropriately?</p>\r\n<p>That would be AWESOME!</p>\r\n<p>~~James</p>\r\n",
    "PostedDate": "2012-10-02T10:13:27.817-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "920723",
    "ThreadId": "397742",
    "Html": "<p>+1&nbsp; I would also love to detangle our existing JS using this functionality.</p>",
    "PostedDate": "2012-10-02T10:17:16.013-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "922492",
    "ThreadId": "397742",
    "Html": "<p>I can see how that'd be handy.&nbsp; I think we'll try to stick with having two different extensions to keep things cleanly separated.&nbsp; If you can switch a .js file to a TypeScript file by just renaming to .ts, that's pretty easy.&nbsp;</p>",
    "PostedDate": "2012-10-05T08:40:08.03-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "923226",
    "ThreadId": "397742",
    "Html": "<p>@jonturner:</p>\r\n<p>Not likely to happen. The project is too big and also has Java devs who use Eclipse working in the JavaScript codebase as well. They would need a TypeScript Editor, too, but it wouldn't fit in with their normal workflow/IDE, then.</p>\r\n<p>How about *.d.js? &nbsp;;)</p>",
    "PostedDate": "2012-10-07T20:07:49.953-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]