{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "As part of our move to GitHub, we're closing our CodePlex suggestions and asking that people move them to the GitHub issue tracker for further discussion.  Some feature requests may already be active on GitHub, so please make sure to look for an existing issue before filing a new one.\n\nYou can find our GitHub issue tracker here:\nhttps://github.com/microsoft/typeScript/issues\n",
    "ClosedDate": "2014-07-28T15:18:10.55-07:00",
    "CommentCount": 7,
    "Custom": null,
    "Description": "To enable JavaScript developers to more comfortable consume compiled TypeScript codebases, I would like to see the TypeScript compiler emit JSDoc annotations based on static information in the codebase.\r\n\r\nFor example, when compiling the following TypeScript:\r\n\r\n    class Book\r\n    {\r\n        private _title: string;\r\n        \r\n        constructor (title: string) {\r\n            this._title = title;\r\n        }\r\n    }\r\n\r\nI would like to see:\r\n\r\n    /**\r\n     * @constructor\r\n     * @param {string} title\r\n     */\r\n    var Book = (function () {\r\n        function Book(title) {\r\n            this._title = title;\r\n        }\r\n        return Book;\r\n    })();\r\n\r\nThis would make generated code more accessible to developers who write plain JS code (or use another compile-to-JS language) and more intelligible to other existing IDEs that support JS and JSDoc.\r\n\r\nOne of the things that makes TypeScript unique to me, is the fact that it generates legible code using established common JavaScript community conventions - this would bring compiled TS code one step closer to full hand-written JavaScript code quality.\r\n",
    "LastUpdatedDate": "2017-11-27T11:51:33.707-08:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "typescript",
    "ReportedDate": "2013-08-26T12:15:57.567-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "External"
    },
    "Summary": "Emit JSDoc annotations in compiled output",
    "Type": {
      "Name": "Unassigned",
      "Id": 5
    },
    "VoteCount": 5,
    "Id": 1596
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "TypeScript supports JSDoc now, so if you add JSDoc to your TypeScript doesn't the compiled JavaScript document have it to?",
      "PostedDate": "2013-09-03T23:20:21.913-07:00",
      "Id": 112010
    },
    {
      "Message": "Well, of course, but that means you'd have to write every type declaration twice.",
      "PostedDate": "2013-09-04T06:16:55.107-07:00",
      "Id": 112030
    },
    {
      "Message": "(in which case you could just as well be writing the type declarations once, in plain JavaScript, in an IDE that can interpret and check JSDoc annotations, effectively accomplishing the exact same thing TypeScript accomplished with new type-hinted syntax.)",
      "PostedDate": "2013-09-04T06:18:13.153-07:00",
      "Id": 112031
    },
    {
      "Message": "This project patches the TypeScript compiler to emit JSDoc:\n\nhttps://github.com/evanw/typescript-closure-compiler\n\nThis would also mean compatibility with Google Closure compiler, which is what the author is aiming for - others have asked for optimizations of that type, so this would address that as well, without reinventing the wheel.\n",
      "PostedDate": "2013-10-16T19:49:44.653-07:00",
      "Id": 118677
    },
    {
      "Message": "This is one of the main features I miss in TypeScript.\nThe closure compiler sounds nice (didn't try it yet), but I don't want to have to rely on another developer to update his project before I can use a new version of the language. I really think this is something the compiler should provide, it would add much more value to it i.e. make it actually worth waiting for the compiler.\n\nIn my opinion, it doesn't have to generate jsdoc for everything, but at least enrich the documentation I've already written with type annotations.",
      "PostedDate": "2014-01-31T04:34:45.903-08:00",
      "Id": 132207
    },
    {
      "Message": "I would also love to see this in TypeScript!",
      "PostedDate": "2014-06-02T05:10:31.887-07:00",
      "Id": 148537
    },
    {
      "Message": "moved to https://github.com/Microsoft/TypeScript/issues/10",
      "PostedDate": "2014-08-07T01:41:44.737-07:00",
      "Id": 154716
    }
  ]
}