{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "We've been seeing this sporadically, but haven't been able to reproduce the problem on our own VMs. Please re-open if an uninstall+reinstall of TypeScript doesn't fix the problem and we can try to collect some more information to diagnose the issue.",
    "ClosedDate": "2014-02-17T10:56:54.36-08:00",
    "CommentCount": 4,
    "Custom": null,
    "Description": "I have both VS2012 Pro and VS2013 Premium running side-by-side, and even thought typescript installs without problems in VS2012, for VS2013 typescript's project and item templates are missing, there's no syntax highlighting and .ts files won't compile.\r\n\r\n\r\n",
    "LastUpdatedDate": "2014-05-20T05:37:07.677-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "typescript",
    "ReportedDate": "2014-02-10T03:17:11.1-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Need More Info"
    },
    "Summary": "Typecript installer doesn't actually install anything in VS2013",
    "Type": {
      "Name": "Unassigned",
      "Id": 5
    },
    "VoteCount": 1,
    "Id": 2164
  },
  "FileAttachments": [
    {
      "FileId": 790745,
      "FileName": "10-02-2014 11-16-21.png",
      "DownloadUrl": ".\\790745"
    }
  ],
  "Comments": [
    {
      "Message": "I had the same issue:\nI had vs2012 with TS working fine, then installed 2013. \nNo TS in 2013, repair install of TS didn't help\n\nI uninstalled TS and installed it again and it worked.\n\nYMMV, but its worth a try!",
      "PostedDate": "2014-02-12T12:39:14.157-08:00",
      "Id": 133418
    },
    {
      "Message": "I have the exact same issue. I've tried both repairing and uninstalling/re installing typescript and I still can't get it to work.\n\nI can give more information if required.",
      "PostedDate": "2014-03-31T05:21:16.25-07:00",
      "Id": 140044
    },
    {
      "Message": "I have both 2012 and 2013. Everything used to work until I installed 2013 update 2.\nNow TypeScript in 2013 doesn't work correctly. When I open the project there's an error message and there's no syntax highlighting.\nIn 2012 everything is still fine. I wanted to reinstall TypeScript from here: http://www.microsoft.com/en-us/download/details.aspx?id=34790 but it says I have a newer version so I can't install this one...",
      "PostedDate": "2014-05-19T03:07:02.483-07:00",
      "Id": 147026
    },
    {
      "Message": "I ran repair on the vs2013 installation and now it seems to work.",
      "PostedDate": "2014-05-20T05:37:07.677-07:00",
      "Id": 147175
    }
  ]
}