{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "As part of our move to GitHub, we're closing our CodePlex suggestions and asking that people move them to the GitHub issue tracker for further discussion.  Some feature requests may already be active on GitHub, so please make sure to look for an existing issue before filing a new one.\n\nYou can find our GitHub issue tracker here:\nhttps://github.com/microsoft/typeScript/issues\n",
    "ClosedDate": "2014-07-28T15:18:28.783-07:00",
    "CommentCount": 2,
    "Custom": null,
    "Description": "When documenting JavaScript functions, it would be useful to be able to use JSDoc's @this tag to document how `this` is used in the function. Additionally, it would be useful for Visual Studio to somehow present this information to users through IntelliSense.",
    "LastUpdatedDate": "2017-11-27T11:51:33.707-08:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "typescript",
    "ReportedDate": "2014-01-05T16:01:09.807-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "External"
    },
    "Summary": "Support JSDoc's @this tag",
    "Type": {
      "Name": "Unassigned",
      "Id": 5
    },
    "VoteCount": 3,
    "Id": 2069
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Typescript doesn't have any mechanism to represent this-typing in its type system, it would be strange to have usage which needs documentation but isn't represented.",
      "PostedDate": "2014-01-07T13:19:59.977-08:00",
      "Id": 129683
    },
    {
      "Message": "I'm not sure exactly what you mean about typescript not being able to represent this-typing, but I know that if I move my mouse cursor over \"this\" inside a method, its type is shown as being of the class type. Similarly, IntelliSense for \"this\" also assumes it is of the class type where appropriate.\n\nI'm also not sure what you mean by \"usage which needs documentation but isn't represented\". Can you please clarify?",
      "PostedDate": "2014-01-07T17:31:19.123-08:00",
      "Id": 129737
    }
  ]
}