{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "Thanks for the follow-up - now that we're preserving the UTF-8 marker, everything should work fine",
    "ClosedDate": "2012-11-13T16:29:55.847-08:00",
    "CommentCount": 1,
    "Custom": null,
    "Description": "I have a file and in VS when I look at the Advanced Save Options it reports the file encoding as \"Unicode Codepage 1200\". \r\n\r\nThis file has a string literal with, say, the inverted exclamation mark U+00A1 in it. If I look at the binary representation it is actually 0x00A100 however. When I look in the generated javascript file it has been transformed to be 0xEFBFBD strangely. And actually I have a whole bunch of characters in my file that all get transformed into this same value.\r\n\r\nFor example:\r\n¡ ¢ £ ¤ ¥ ¦ § ¨ © ª « ¬ ­ ® ¯\r\n° ± ² ³ ´ µ ¶ · ¸ ¹ º » ¼ ½ ¾ ¿ × ÷\r\nÀ Á Â Ã Ä Å Æ Ç È É Ê Ë Ì Í Î Ï\r\nÐ Ñ Ò Ó Ô Õ Ö Ø Ù Ú Û Ü Ý Þ ß\r\nà á â ã ä å æ ç è é ê ë ì í î ï\r\nð ñ ò ó ô õ ö ø ù ú û ü ý þ ÿ\r\n\r\nAll of these characters are coming out wrong in the generated javascript for this encoding.",
    "LastUpdatedDate": "2012-11-13T16:29:55.847-08:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "typescript",
    "ReportedDate": "2012-11-12T17:00:32.073-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "Unicode - Codepage 1200 characters gets transformed incorrectly",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 412
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "While this is still true, I think the issue was just that I had this encoding set at all. I inherited the file from somewhere else and I assumed it was ok but just changing it to utf-8 fixed the issue for me. I think you can just close this, just changing the encoding to utf-8 seems like the right way to go.",
      "PostedDate": "2012-11-13T09:17:44.283-08:00",
      "Id": 82376
    }
  ]
}