{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "If you are sure the linked issue is the same thing you're hitting then we can track it there, but if you are unsure feel free to re-open this with any additional information you can provide. We certainly want to track down issues like this. If you're able to provide a repro (even if it's a large project you can only share privately) we'd be happy to take a look.",
    "ClosedDate": "2014-02-12T18:46:30.887-08:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "We have a large project consisting of several d.ts and .ts files.\r\nWhen writing code that uses generic parameters, and often by just writing the wrong parameters or missing a type parameter when calling a method, the tsc compiler will hang, and eventually go out of memory. The errors I have to find my self...\r\nI don't have an isolated sample for you right now, but it's happening a lot to me, daily, and finding the specific issue gets extremely hard as the codebase grows. I will look to provide a sample that shows the issue...\r\n\r\nOur settings are (I played with them, but it didn't make any difference):\r\n* ECMAScript5\r\n* Compile on Save\r\n* Do not allow implicit any\r\n* Combine Javascript output into file\r\n* generate source maps\r\n\r\nedit: I'm sorry, I totally forgot there was an existing issue: https://typescript.codeplex.com/workitem/2011\r\nI was frustrated and didn't find this issue today... :)",
    "LastUpdatedDate": "2014-02-12T18:46:30.887-08:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "typescript",
    "ReportedDate": "2014-02-11T03:06:21.717-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Need More Info"
    },
    "Summary": "0.9.5 tsc goes out of stackspace",
    "Type": {
      "Name": "Unassigned",
      "Id": 5
    },
    "VoteCount": 1,
    "Id": 2166
  },
  "FileAttachments": [],
  "Comments": []
}