{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "Thanks for logging this issue. We've moved to a new codebase on GitHub; please try your issue against the new compiler (once possible) and log an issue on the GitHub site if it still reproduces.",
    "ClosedDate": "2014-07-21T13:36:25.693-07:00",
    "CommentCount": 2,
    "Custom": null,
    "Description": "Is there any way we can get better error messages than this?\r\n\r\nSuch as ... \"Method is asking for an A, but you passed in a B\".\r\n\r\nSometimes it gives you \"Type 'T' is missing property 'P' from type 'TT', but most of the time it doesn't.\r\n\r\nI realize that TypeScript is structurally typed, not nominally typed, so the error messages aren't going to be exactly like C#, but can this be improved in some way?\r\n",
    "LastUpdatedDate": "2017-11-27T11:51:34.217-08:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "typescript",
    "ReportedDate": "2013-07-11T08:17:33.177-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "External"
    },
    "Summary": "Better error than \"Supplied parameters do not match any signature of call target\"",
    "Type": {
      "Name": "Unassigned",
      "Id": 5
    },
    "VoteCount": 5,
    "Id": 1331
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Thanks for the report. We're definitely hoping to improve some error messages before 1.0 and this is one of the more egregious offenders. Marking as active.",
      "PostedDate": "2013-07-11T16:50:25.743-07:00",
      "Id": 105783
    },
    {
      "Message": "This seems the most appropriate place to mention this....\n\nGiven the following typescript...\n\n```\nfunction f( x ) {\n    console.log( x );\n};\n\nf( \"a\" );\nf( 1 );\n```\n\nthe compiler correctly generates the correct javascript file with no errors, however change the declaration to\n\n```\nfunction f( x : number ): void {\n    console.log( x );\n};\n\nf( \"a\" );\nf( 1 );\n```\n\nNow the typescript compiler errors \"Supplied parameters do not match any signature of call target.\" - which is great, but Javascript is STILL generated, regardless of the error. I would expect when compilation fails that no Javascript is generated/output. Also compilation options should show up in VS2012/3 without needing to manually edit the project file.\n\nI just installed the latest typescript (0.9.5) and tsc seems to report version 0.9.1.1, hope this helps.\n",
      "PostedDate": "2014-01-01T10:06:24.997-08:00",
      "Id": 128822
    }
  ]
}