{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "",
    "ClosedDate": "2013-10-22T09:41:30.58-07:00",
    "CommentCount": 8,
    "Custom": null,
    "Description": "Hi all, I jsut installed vs 2013 rtm, the latest version of typescript, and created a new mvc application.\r\nI added angularjs, the angular typescript package, the .ts icon in the solution is shown correctly, but if I go in add Item i don't find typescript file.\r\n\r\nI'm missing something?\r\n\r\nluca",
    "LastUpdatedDate": "2014-03-31T16:15:14.26-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "typescript",
    "ReportedDate": "2013-10-20T09:22:17.903-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Need More Info"
    },
    "Summary": "cannot add .ts file in vs 2013",
    "Type": {
      "Name": "Unassigned",
      "Id": 5
    },
    "VoteCount": 3,
    "Id": 1815
  },
  "FileAttachments": [
    {
      "FileId": 746886,
      "FileName": "Untitled.png",
      "DownloadUrl": ".\\746886"
    }
  ],
  "Comments": [
    {
      "Message": "After istalling TS, also TS project type is not available. It shows jsut the link to 'Get latest TypeScript' that I already installed.",
      "PostedDate": "2013-10-21T01:30:08.347-07:00",
      "Id": 119022
    },
    {
      "Message": "in the script section i find Javascript file and Coffescript file",
      "PostedDate": "2013-10-21T12:36:15.15-07:00",
      "Id": 119119
    },
    {
      "Message": "Should be under the \"Scripts\" node or use the search box. Please reactivate if you don't find it there. Thanks!\n\r\n\r** Closed by RyanCavanaugh 10/21/2013 11:21AM",
      "PostedDate": "2013-10-21T11:21:15.743-07:00",
      "Id": 119120
    },
    {
      "Message": "Sorry you guys are hitting issues here.\n\nLuca, the TypeScript file not showing up in \"Add New Item\" for a project is a known issue.  If the icon is showing correctly, sounds like TypeScript was installed.  You should be able to add a TypeScript file to the project with either of the following:\n\na) Right click the project, select \"Add\" on the context menu, and \"TypeScript file\" should be in the list (2nd from bottom I believe).\nb) Right click, the project, select \"Add\" on the context menu, and choose \"New Item...\" (I believe this is the screen shot you have).  In the \"Search\" box on the top right type \"TypeScript\", and you should get the TypeScript file item as a result.\n\nIf neither of these work, sounds like the install didn't work properly, please see following to Igor...\n\nIgor, did the install complete successfully?  What SKU of Visual Studio are you running? (i.e. \"Professional\", or \"Web Express\", etc...).  Could you uninstall TypeScript from \"Add/Remove programs\", then reinstall from the downloaded package, and then in the \"%TEMP%\" folder you should have a bunch of .log files timestamped around the attempted install time.  Could you attach these if reinstall is still not working for you and we'll take a look.  Thanks.\n\nOur bug tracking workflow is a little clunky, so I'm going to close this now as \"Need more info\", but that's just so it shows back up on our list when you reopen it.  Please do so by clicking on the \"reopen\" link above when you post back.  Thanks.",
      "PostedDate": "2013-10-22T09:41:24.093-07:00",
      "Id": 119220
    },
    {
      "Message": "Just to add in case this is the issue...\n\nThere is one bug we are aware of, where if the Visual Studio installation folder is not the default location, then we still put the TypeScript templates in the default location and VS fails to find/load them.  We have this fixed internally and the next release will resolve this.  If you have installed VS to a non-default location, this could be the issue.",
      "PostedDate": "2013-10-22T12:29:51.663-07:00",
      "Id": 119248
    },
    {
      "Message": "I reinstalled the TypeScript plugin and the problem still present.\nAnd, yeah, my VS install folder is not default, so I copied files from default location to my location.\nThen I executed devenv.exe /installvstemplates, and it's works.\nThanks.",
      "PostedDate": "2013-10-25T09:52:58.857-07:00",
      "Id": 119689
    },
    {
      "Message": "Thanks for the update - good to know for other users.",
      "PostedDate": "2013-11-19T16:04:14.393-08:00",
      "Id": 123600
    },
    {
      "Message": "I did as Igorbek suggested; I copied the template from VS default directory to alternate location and ran devenv.exe/installvstemplates, but it didn't work for me.  Add new item still missing the typescript template.  Any other suggestions?",
      "PostedDate": "2013-11-26T09:42:13.293-08:00",
      "Id": 124337
    }
  ]
}