{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "The only way we seem to reproduce this is when you open the file outside of your project context... which is what the path seems to indicate. (for example opening a file from the source control explorer without having a mapping).\n\nI don't think TypeScript can do anything here.\n",
    "ClosedDate": "2013-09-13T15:05:19.64-07:00",
    "CommentCount": 5,
    "Custom": null,
    "Description": "the relative reference path seems to be pointing to a temp area instead of the project.  Is there a new setting or a new way to define the paths?\r\n\r\ni.e.\r\n\r\n/// <reference path=\"../Scripts/App/tsDefs/jquery.d.ts\" />\r\n\r\nError\t1\tIncorrect reference: file \\\"C:\\Users\\ME\\AppData\\Local\\Temp\\Scripts\\App\\tsDefs\\jquery.d.ts\\\" does not exist\tC:\\Users\\ME\\AppData\\Local\\Temp\\TFSTemp\\vctmp9068_895922.ts\t1\t1\tvctmp9068_895922.ts\r\n",
    "LastUpdatedDate": "2013-09-13T15:05:19.64-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "typescript",
    "ReportedDate": "2013-09-09T15:06:32.427-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Need More Info"
    },
    "Summary": "VS 2013 RC references not working",
    "Type": {
      "Name": "Unassigned",
      "Id": 5
    },
    "VoteCount": 1,
    "Id": 1665
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "It looks like you have not saved the file(s) you are working with and/or not fully extracted an archive of some code. Based on the error you've pasted the relative path appears to be doing exactly what it's supposed to given where your file is located. It moved back one level (TFSTemp) and then down the Scripts/App/tsDefs/ directory to look for jquery.",
      "PostedDate": "2013-09-09T19:35:28.75-07:00",
      "Id": 112940
    },
    {
      "Message": "Per Dan, until you save the file somewhere, it doesn't know how to resolve relative paths.\n\nClosing as by design.  Please reopen if we have misunderstood the issue.",
      "PostedDate": "2013-09-11T15:33:33.62-07:00",
      "Id": 113277
    },
    {
      "Message": "\n\r\n\r** Closed by billti 09/11/2013 3:33PM",
      "PostedDate": "2013-09-11T15:33:37.253-07:00",
      "Id": 113307
    },
    {
      "Message": "Actually, looks like you have reported more details on the blog at http://blogs.msdn.com/b/typescript/archive/2013/09/09/visual-studio-2013-rc.aspx (assuming based on the issue, path, and project name this is the same report).\r\n\r\nBased on the extra details on the blog, we'll take another look to see if we can reproduce issues here.  Please continue to interact on this Issue rather than the blog for easier tracking if possible.\r\n\r\nWe'll update with our findings.  Thanks!",
      "PostedDate": "2013-09-11T21:47:08.903-07:00",
      "Id": 113308
    },
    {
      "Message": "Copied your remarks from the blog post:\n\njust making sure we're all on the same page...\n\nProblem: I'm saving an existing TS file in a TFS controlled project and receiving some bad reference errors.\n\nThe diagnosis so far has been:\n\n1.  I'm not saving the file.\n\n2.  The file is not in my project.\n\n3.  It's working as expected.\n\nNow, since we're all developers here, I can appreciate your diagnoses as being perfectly reasonable from your perspective.  In fact, I believe it's not TS that is the problem but something wonky in VS2013 RC.  I've been using VS2012 and VS2013 Preview interchangeably up to today without experiencing this issue.  Immediately after I upgraded to today's posting of VS2013 RC, the first compile I made resulted in this error.  I might have reported the error in the VS2013 forumns, but they likely would have redirected me here.  Perhaps it's a spurious error that I'll not experience again.  So, perhaps it's best to let this issue rest until more devs install the new RC and watch if \n\nit's a common experience.\n\nEither way,\n\nthanks for the suggestions.  ;-) \n",
      "PostedDate": "2013-09-13T15:02:53.5-07:00",
      "Id": 113536
    }
  ]
}