{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "As part of our move to GitHub, we're closing our CodePlex suggestions and asking that people move them to the GitHub issue tracker for further discussion.  Some feature requests may already be active on GitHub, so please make sure to look for an existing issue before filing a new one.\n\nYou can find our GitHub issue tracker here:\nhttps://github.com/microsoft/typeScript/issues\n",
    "ClosedDate": "2014-07-28T15:17:22.347-07:00",
    "CommentCount": 7,
    "Custom": null,
    "Description": "When IE 11 throws an error in javascript that maps to typescript, it hangs Visual Studio 2013 Update 2 for exactly 3.5 minutes.\r\n\r\nI have 3 developers that all have the same problem. We also tested on a complete clean Windows 8.1 fully patched machine with just Visual Studio 2013 Update 2 on it and the problem is there even with nothing loaded.\r\n\r\nIt also happens in Safe Mode in VS.net.\r\n\r\nWeb Essentials is not installed.\r\n\r\nHappens even without any //references.\r\n\r\nIt's to the point where we can't use IE and debug typescript files as a result of this major problem.  Going backwards to Update 1 and the last version of separately installed Typescript fixes the issue. \r\n\r\n(no I don't have any way to repro... it just does it on all fully patched computers with absolutely nothing else running, and no extensions installed etc.)",
    "LastUpdatedDate": "2014-07-28T15:17:22.347-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "typescript",
    "ReportedDate": "2014-06-19T13:19:23.68-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "External"
    },
    "Summary": "Visual Studio 2013 Update 2 Hangs on debugger",
    "Type": {
      "Name": "Unassigned",
      "Id": 5
    },
    "VoteCount": 6,
    "Id": 2569
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Hi \n\nCan you please share your repro steps so we can investigate this further.\n\nThanks\nSheetal",
      "PostedDate": "2014-06-20T12:29:54.007-07:00",
      "Id": 150365
    },
    {
      "Message": "I'm also experiencing this problem. In the VS debugger when I attempt to step into a function defined in another TypeScript file, the debugger hangs for a few minutes until eventually the following timeout error is displayed in the Output window:\n\n\"Document http://localhost:61671/App/myDataService.ts read failed: The operation has timed out\" \n\nI have no idea what is causing the read fail and timeout. ",
      "PostedDate": "2014-06-25T23:43:03.637-07:00",
      "Id": 150757
    },
    {
      "Message": "  Just for info, I had pretty much the same issue. All you have to do is put a debugger keyword into a typescript function and call it (running via IE). It would hang for 1-2 minutes everytime.\n\n  I tried RC3 but the same problem. I'm behind as it is it so I've now uninstalled and gone back to plain VS2013 (no updates) and it works normally again.\n",
      "PostedDate": "2014-07-16T01:11:30.833-07:00",
      "Id": 152548
    },
    {
      "Message": "Just to be clear, I have never installed Web Essentials and this is now VS2013 \nwith \"http://www.microsoft.com/en-gb/download/details.aspx?id=34790\" installed\n",
      "PostedDate": "2014-07-16T01:50:13.297-07:00",
      "Id": 152551
    },
    {
      "Message": "I wonder if this issue is related to an issue I was having as well:\nhttps://typescript.codeplex.com/workitem/2478\n",
      "PostedDate": "2014-07-16T10:16:55.727-07:00",
      "Id": 152617
    },
    {
      "Message": "It seems there are 2 workarounds to this problem\n\n(1) Project settings->typescript build->\n\nAt the bottom of the screen set the two root directory locations to your external script folder, actually it doesn't seem to matter where you set it as long as you do\n\nor\n\n(2) (someone in a different thread found this) set the window.onerror function in that file.\n\n",
      "PostedDate": "2014-07-20T23:52:20.09-07:00",
      "Id": 153023
    },
    {
      "Message": "Here's a related MS connect feedback thread that seems to be similar to the issue reported here. Various dmp files are attached as collected at the point of the 'busy' notification.\n\n[https://connect.microsoft.com/VisualStudio/Feedback/details/870012](https://connect.microsoft.com/VisualStudio/Feedback/details/870012)",
      "PostedDate": "2014-07-21T17:02:42.943-07:00",
      "Id": 153115
    }
  ]
}