{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "As part of our move to GitHub, we're closing our CodePlex suggestions and asking that people move them to the GitHub issue tracker for further discussion.  Some feature requests may already be active on GitHub, so please make sure to look for an existing issue before filing a new one.\n\nYou can find our GitHub issue tracker here:\nhttps://github.com/microsoft/typeScript/issues\n",
    "ClosedDate": "2014-07-28T15:18:28.363-07:00",
    "CommentCount": 9,
    "Custom": null,
    "Description": "Generated .js files have window-style line endings. This makes things messy for people (like us) who develop on both UNIX and Windows and who standardize on UNIX EOL.\r\n\r\nWould be nice to have a compiler switch to generate files with LF only.",
    "LastUpdatedDate": "2017-11-27T11:51:33.707-08:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "typescript",
    "ReportedDate": "2012-10-15T08:48:33.213-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "External"
    },
    "Summary": "compiler option to get unix-style end-of-line",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 7,
    "Id": 258
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Assigning to Jonathan who is managing suggestions.",
      "PostedDate": "2012-10-15T09:20:39.853-07:00",
      "Id": 79769
    },
    {
      "Message": "Or perhaps it should just use the line endings from the platform the compiler is run on.",
      "PostedDate": "2012-10-15T12:30:06.407-07:00",
      "Id": 80012
    },
    {
      "Message": "Having the same line endings as the current OS would be enough. \n\nOtherwise, the compiler switch should have values like auto (the default - same as current OS), unix, windows and mac (if people still care about old mac).",
      "PostedDate": "2012-10-15T20:32:26.773-07:00",
      "Id": 80070
    },
    {
      "Message": "It would be very nice if we can use this feature. This issue is a big issue to use, because some developers in our team use linux, the rest use windows. So hard to find the balance... :)",
      "PostedDate": "2014-01-17T05:27:31.477-08:00",
      "Id": 130687
    },
    {
      "Message": "I think the tsc should use line endings from the input files. If I have all ts files with LF then generate js with LF.\n\nDo your original ts files have line endings different when you open it in other OSes? If not then why should the generated js line endings differ. If yes (for example using git auto LF->CRLF feature) then tsc would also preserve those line endings.",
      "PostedDate": "2014-01-18T03:05:33.39-08:00",
      "Id": 130779
    },
    {
      "Message": "CRLF break some use-cases:\n\nWhen you compile TypeScript to a file you want to use as a bash script (by adding a shebang) then CRLF in the file will break bash. \n\nFor example the bin-scripts for npm's package.json, see: https://github.com/npm/npm/issues/4607\n\nYou can work around this with a normalisation step or a simple js proxy file, but simply never have CRLF in the first place would be desirable.",
      "PostedDate": "2014-02-16T16:53:20.05-08:00",
      "Id": 133750
    },
    {
      "Message": "Agreed with  Bartvds wrote Feb 16 at 7:53 PM  .  We have a mix of OSX/windows and using git on Windows and deploying eventually to Linux.  It would best to allow git to leave all newlines as-is without conversion, so having all tools save as UNIX LF only and CRLF would be the cleanest solution.\n",
      "PostedDate": "2014-11-06T17:42:48.03-08:00",
      "Id": 164109
    },
    {
      "Message": "I have a feature patch for this option that I'm preparing as a pull request for the GitHub repository.\n\n --newLine NEWLINE                  Use newline: 'dos' or 'unix'.\n",
      "PostedDate": "2015-04-25T10:02:39.057-07:00",
      "Id": 183379
    },
    {
      "Message": "Please note that TypeScript has moved to [github](https://github.com/Microsoft/TypeScript).\n\nThis is tracked by https://github.com/Microsoft/TypeScript/issues/1693",
      "PostedDate": "2015-04-27T14:02:55.79-07:00",
      "Id": 183468
    }
  ]
}