{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "Thanks for logging this issue. We've moved to a new codebase on GitHub; please try your issue against the new compiler (once possible) and log an issue on the GitHub site if it still reproduces",
    "ClosedDate": "2014-07-21T12:08:50.773-07:00",
    "CommentCount": 3,
    "Custom": null,
    "Description": "I'm not sure if this is a bug or just part of the game, but it happens enough to make a note:\r\n\r\nCasing mistakes in relative paths used with `import/require` are ignored on Windows systems but break when deploying source-code written on Windows to a *nix system.\r\n\r\nWe occasionally have this when running CI on linux based systems like Travis-CI.\r\n\r\nFor example: these are the same on Windows but different on Linux:\r\n\r\n````\r\nimport foo = require('./Foo');\r\n// vs\r\nimport foo = require('./foo');\r\n````\r\n\r\nThis leads to massive compile errors followed by the classic \"it works at my end\" reply and a lot of head-scratching and followed by some grumbling about Windows.",
    "LastUpdatedDate": "2017-11-27T11:51:34.217-08:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "typescript",
    "ReportedDate": "2014-05-08T13:26:36.89-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "External"
    },
    "Summary": "Crossplatform case-sensitivity annoyance",
    "Type": {
      "Name": "Unassigned",
      "Id": 5
    },
    "VoteCount": 1,
    "Id": 2495
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "So the ask here would be to make import/require targets be case sensitive on Windows then?",
      "PostedDate": "2014-05-08T18:20:23.39-07:00",
      "Id": 145993
    },
    {
      "Message": "Yes, if you'd see this as a valid concern.",
      "PostedDate": "2014-05-08T19:01:36.83-07:00",
      "Id": 145998
    },
    {
      "Message": "I've run into this as well (OSX vs linux difference). I was going to enter a bug for it, but it's consistent with the behavior of nodejs as well. So it may not be within the realm of TypeScript to solve...\n\nThe one funny thing I noticed in my case was that sometime (seemingly randomly), the \"foo.js\" would get generated as \"Foo.js\" instead (but the map file was lowercase, matching the foo.ts file).",
      "PostedDate": "2014-05-12T01:26:06.663-07:00",
      "Id": 146269
    }
  ]
}