{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "Thanks for logging this issue. We've moved to a new codebase on GitHub; please try your issue against the new compiler (once possible) and log an issue on the GitHub site if it still reproduces.",
    "ClosedDate": "2014-07-21T13:16:39.76-07:00",
    "CommentCount": 6,
    "Custom": null,
    "Description": "[This issue](https://typescript.codeplex.com/workitem/779) seems to have been regressed back into the code.\r\n\r\nI've also submitted a [bug report](https://connect.microsoft.com/VisualStudio/feedback/details/846869/typescript-formatting-task-took-more-than-2-second-s-to-complete-try-again-later-in-vs2013-express-web-update-2-rc) to the Visual Studio team.\r\n\r\nThis is the workaround:\r\n\r\nmhegazy wrote Mar 8, 2013 at 7:32 PM\r\n\r\nThis is caused by an infinite loop in the logic that detects the extent of the statement that needs formatting after semicolon. we did change that logic in a recent bug fix. I believe i have a fix for it. I am not sure yet how or when this fix will be released. but I presume sometime soon. for now, go to your Tools\\Options dialog then to Text Editor\\Typescript\\Formatting and check off \"Format completed statements on ;\". this will disable formatting after semicolon obviously, but should make VS usable again; this should not affect other formatting trigger points like new line and closing parenthesis.\r\n\r\nI had to restart VS to have the changes take effect but it works.\r\n\r\n\r\n\r\n",
    "LastUpdatedDate": "2017-11-27T11:51:34.217-08:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "typescript",
    "ReportedDate": "2014-04-04T23:34:23.907-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "External"
    },
    "Summary": "Formatter slow in VS2013 Update 2 RC",
    "Type": {
      "Name": "Unassigned",
      "Id": 5
    },
    "VoteCount": 14,
    "Id": 2386
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Thanks, marked as active while we investigate.",
      "PostedDate": "2014-04-08T18:43:17.163-07:00",
      "Id": 141043
    },
    {
      "Message": "This problem is super annoying. I have been encountering it every 5 minutes while typing, especially in the middle of declaring new classes. \n\nI'm running Visual Studio 2013 RC 2.",
      "PostedDate": "2014-04-30T16:01:16.33-07:00",
      "Id": 145280
    },
    {
      "Message": "Yep having this issue as well. I was updating an interface and each new item I add hangs when adding the new line.",
      "PostedDate": "2014-05-07T08:23:02.417-07:00",
      "Id": 145797
    },
    {
      "Message": "Here's a surprising turn of events: I went to Tools -> Options and unchecked all checkboxes under \"Formatting\", then restarted VS. Everything started working quickly again, but then I noticed that autoformatting was still happening - only it didn't take forever. Then I went to Tools -> Options again, and guess what, all the checkboxes are back on.",
      "PostedDate": "2014-05-09T10:41:34.64-07:00",
      "Id": 146083
    },
    {
      "Message": "I'm experiencing these slowdowns as well, the IDE becomes unusable every time I hit Save..locks up...regardless of whether or not I uncheck all of the formatting options. I also want to point out that this seems to be specific to the Node.js Tools for Visual Studio extension.",
      "PostedDate": "2014-05-09T17:19:47.393-07:00",
      "Id": 146148
    },
    {
      "Message": "I experienced this problem in VS 2012 when each time I pressed Enter I saw it after restarting VS it was gone.",
      "PostedDate": "2014-05-12T09:17:23.473-07:00",
      "Id": 146301
    }
  ]
}