{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "This seems to create more confusion than it solves. Are two interfaces with the same set of members but different default values structurally equivalent even though they do very different things?\n\nHow would you expect this to work once a class actually tries to implement this interface? The interface doesn't have any JavaScript generated for it, so your class needs to duplicate these default parameter values in its own definition. Can the class have different default values from what the interface specifies? If not, then this syntax is just adding duplicated code. If so, then now polymorphic uses of the class hierarchy get extremely confusing and misleading. \n\nI see the scenario here of wanting to describe an existing JavaScript type that you are't intending to implement with a class but on balance I'm not sure this sort of syntax is really going to make life better than putting that information in a comment.",
    "ClosedDate": "2013-08-29T12:26:29.85-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "Many JavaScript libraries supply default values for their functions if optional arguments are omitted. There doesn't appear to be a way to model this in TypeScript currently other than recording it in the JSDoc. A more natural way would be to use the existing syntax for describing default values:\r\n\r\n``` TypeScript\r\ninterface Dog {\r\n\tbark(sound: string = 'woof');\r\n\t\r\n\teat(args: {food: string = 'dogfood';}) //Hypthetical syntax for property defaults as described in Issue 719\r\n}\r\n```\r\n\r\nRelated, the autocompletion for a function with a default value should indicate the presense of the default value, something it doesn't appear to do currently.\r\n\r\n[Playground](http://www.typescriptlang.org/Playground/#src=function%20moo(a%3A%20string%20%3D%20'test')%7B%0A%09return%20a%3B%0A%7D%0A%0Amoo()%3B%20%2F%2FBring%20up%20autocompletion%20between%20the%20parens%2C%20no%20default%20value%20indicated%0A)\r\n\r\nThis would make discoverability of libraries much easier, without having to refer to docs to augment the definition file.",
    "LastUpdatedDate": "2013-08-29T12:26:29.85-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "typescript",
    "ReportedDate": "2013-08-29T07:18:09.27-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "By Design"
    },
    "Summary": "Default values in type-descriptions/interfaces",
    "Type": {
      "Name": "Unassigned",
      "Id": 5
    },
    "VoteCount": 1,
    "Id": 1618
  },
  "FileAttachments": [],
  "Comments": []
}