{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "",
    "ClosedDate": "2013-11-20T14:58:23.56-08:00",
    "CommentCount": 7,
    "Custom": null,
    "Description": "I'm on VS2013 and I'm getting this problem but it also appeared in 2012, which is current with other people here: https://typescript.codeplex.com/discussions/453820#post1106447\r\n\r\nBasically, when a file that a lot of other files depend on is temporarily broken with a syntax error, the error is propagated to the other files but the when the error is fixed, the syntax errors don't disappear from the dependent files. \r\n\r\nHowever, building the project succeeds (errors remain in error list window) and closing and reopening the dependent files seems to fix the issue when it occurs.\r\n\r\nA very rough repro - I'm saying rough because I don't know if it happens every time or under some conditions:\r\n\r\n- Have file A.ts\r\n- Have file B.ts that depends on definitions from A.ts\r\n- Break something in A.ts and save (not sure if save is important)\r\n- Error list will be populated with errors in both A and B\r\n- Fix error in A\r\n- Error list remains populated with errors from B\r\n- Building the project will succeed\r\n\r\nPS: I thought this was due to Web Essentials but still occurs with Web Essentials disabled, though less often.",
    "LastUpdatedDate": "2014-03-31T16:14:29.3-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "typescript",
    "ReportedDate": "2013-10-11T08:44:14.66-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Need More Info"
    },
    "Summary": "Falsy errors with 0.9.1.1",
    "Type": {
      "Name": "Unassigned",
      "Id": 5
    },
    "VoteCount": 2,
    "Id": 1780
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "I can't find a way to consistently reproduce this but it's definitely there.\n\nSee this one for example: https://www.dropbox.com/s/m8xu352ppnicjbo/Screenshot%202013-10-30%2011.05.52.png\n\nThis was after opening the file fresh and editing some lines above it. \nThe \"module\" keyword was never touched and yet I get a `\"dule\" does not exist on type`.\nIf I compile it compiles fine though so it must be something fishy with the language service. \n\nDo you guys have any way to enable comprehensive debug output for the language service in case we can trace the problem?",
      "PostedDate": "2013-10-30T02:10:48.763-07:00",
      "Id": 120157
    },
    {
      "Message": "I can't reproduce any problems with the repro steps listed - tried introducing all sorts of different errors and didn't see anything weird. If you run into something specific, please reopen and I can try again.\n\nOne problem you might be seeing is a design limitation in v1 where errors produced by the 'build' step are not properly merged with errors produced by the language service itself.  In other words, you might see an stale error form the build appearing as if it were real. Rebuilding should make those stale errors go away. If you see something inconsistent with that scenario please reopen. Thanks!\n\r\n\r** Closed by RyanCavanaugh 10/11/2013 2:14PM",
      "PostedDate": "2013-10-11T14:14:36.36-07:00",
      "Id": 120158
    },
    {
      "Message": "We're looking into getting something to give you to help track this down. We'll keep you posted.",
      "PostedDate": "2013-11-07T11:48:00.3-08:00",
      "Id": 122158
    },
    {
      "Message": "Can you try with the 0.9.5 beta and let us know your results? https://typescript.codeplex.com/wikipage?title=TypeScript%200.9.5%20beta\n\nThanks!",
      "PostedDate": "2013-11-19T11:52:36.507-08:00",
      "Id": 123549
    },
    {
      "Message": "Just installed it - will let you know if it comes up again.",
      "PostedDate": "2013-11-20T02:21:52.103-08:00",
      "Id": 123633
    },
    {
      "Message": "Closing for tracking purposes, please do re-open if you see anything strange like this with 0.9.5 and we'll get on it.",
      "PostedDate": "2013-11-20T14:58:19.767-08:00",
      "Id": 123712
    },
    {
      "Message": "Worked a whole day with it yesterday and it didn't come up. I'll also consider it fixed and let you know if I find it otherwise.\n\nOut of curiosity, what was the problem?",
      "PostedDate": "2013-11-27T01:18:54.163-08:00",
      "Id": 125422
    }
  ]
}