{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "As part of our move to GitHub, we're closing our CodePlex suggestions and asking that people move them to the GitHub issue tracker for further discussion.  Some feature requests may already be active on GitHub, so please make sure to look for an existing issue before filing a new one.\n\nYou can find our GitHub issue tracker here:\nhttps://github.com/microsoft/typeScript/issues\n",
    "ClosedDate": "2014-07-28T15:18:09.847-07:00",
    "CommentCount": 3,
    "Custom": null,
    "Description": "The process of creating a WinRT JS project is not clear. The plugin only seems to install a project template called HTML Application with Type Script under language C#. Under JavaScript, there is no template for TS. Furthermore, if I create a Windows Store App under language JavaScript, the \"Add New Item\" functionality does not give me an option to create a TS file. BUT, if I create any kind of C# app, I can add a TS file to it. :-/\r\n\r\nFor now, I'm using the Encyclopedia WinRT sample but it is unclear how a WinRT JS TS-enabled project should be created.",
    "LastUpdatedDate": "2017-11-27T11:51:33.707-08:00",
    "PlannedForRelease": "TypeScript 1.x",
    "ReleaseVisibleToPublic": true,
    "Priority": {
      "Name": "Medium",
      "Severity": 100,
      "Id": 2
    },
    "ProjectName": "typescript",
    "ReportedDate": "2012-10-02T05:57:35.273-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "External"
    },
    "Summary": "Add TypeScript Windows Store Application Templates",
    "Type": {
      "Name": "Feature",
      "Id": 1
    },
    "VoteCount": 12,
    "Id": 25
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "I just spent some days writing a little GUI tool for that!\n\nAnd here's my result: https://github.com/ComFreek/Tsac\n\nSteps to create a new project with TypeScript support:\n\n1.) Create a new HTML/JS project if you don't have one yet.\n2.) Prepare and install Tsac as stated in the README file (see link above).\n3.) Launch gui.ps1.\n4.) Select your project, activate the 'first time' checkbox and click Convert!\n\nSee the README for a more detailed version.",
      "PostedDate": "2012-11-10T11:24:56.597-08:00",
      "Id": 82169
    },
    {
      "Message": "The TypeScript distribution does not currently come with templates for Windows 8 application development.  We expect to add these templates and improve the end-to-end developer workflow building Windows 8 applications using TypeScript in the next few months.  For now, you can manually integrate TypeScript into Windows 8 applications using similar approaches as used for the Windows 8 Encyclopedia sample.",
      "PostedDate": "2012-12-06T18:59:40.837-08:00",
      "Id": 83746
    },
    {
      "Message": "I created an extension for Visual Studio to add the three basic templates (blank, navigation & hub) for creating Store Apps for Windows 8.1 with TypeScript. It is available for download from the Visual Studio Gallery: [http://visualstudiogallery.msdn.microsoft.com/bd97e47d-ed3a-4f5e-ace2-37bbcb545c9e](http://visualstudiogallery.msdn.microsoft.com/bd97e47d-ed3a-4f5e-ace2-37bbcb545c9e)",
      "PostedDate": "2014-06-24T11:44:58.473-07:00",
      "Id": 150631
    }
  ]
}