{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "We are aware of the issues in the interaction between Web essentials and TypeScript, this was one of the reasons TypeScript support was removed from Web Essentials in the latest versions.\n\nFurther we made a lot of improvements in the performance of the TypeScript plug-in in the 0.9.5 release.\n\nPlease give that a try, that should improve the performance.",
    "ClosedDate": "2013-12-14T23:43:16.907-08:00",
    "CommentCount": 1,
    "Custom": null,
    "Description": "I have been using Type Script for about 3 weeks now and the general performance has been shockingly poor. When opening a TS file the VS IDE will sometimes stop responding and will never return. The application does not grey out it just seems to become locked in some way on VS update 3 on VS update 4 it will grey out. On a laptop you can notice the fan speed up which could indicate that the processor is working quite hard while this is happening.\r\n\r\nThis is reproducible on multiple files (one is only 60 lines long) and on different machines.  I can supply this file if necessary.\r\n\r\nNothing seems to logged in the eventlog.\r\n\r\n__Software I have installed:__\r\n\r\nVisual Studio 2012 Update 3 and Update 4\r\nWeb Essentials 3.3.5 \r\nResharper 8.0.2 (have tried installing 8.1 EAP with the same results) \r\nType Script 0.9.1.1\r\n\r\nAttached is the output from DXDiag which may help (this is for the original machine not the new one).\r\n\r\nSome steps that help this issue. \r\nWhen disabling Resharper via options -> Resharper -> Suspend, the performance is a lot better and is usable but still crashes after a time. \r\nUninstalling Web Essentials seems to have also improved performance.\r\n\r\nMemory usage of Visual Studio will sit around 1gb when not working on TS files. As soon as a TS file is opened the memory quick jumps to 3gb and then the issue is more likely to be reproducible. The memory increase happens even without Resharper and WebEssentials however more time is required for the crash to happen.\r\n\r\nI have tried this on a brand new machine too which has the same problem.\r\n\r\n__There has been a case with JetBrains Reshaper too (#4738) and their investigation are pointing that the following method in TypeScript.__\r\n_: TypeScriptLanguageService.Features.QuickInfo.DebugTextViewFilter.GetDataTipText(TextSpan[], String&) (from Microsoft.VisualStudio.TextManager.Interop.IVsTextViewFilter)_ \r\n\r\nPlease let me know if there is anything else you require to investigate this issue.",
    "LastUpdatedDate": "2014-03-31T16:08:22.247-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "typescript",
    "ReportedDate": "2013-12-13T16:43:40.957-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Fixed"
    },
    "Summary": "Major performance issues when using Visual Studio 2012, Type Script, Reshaper and WebEssentials with a combination of software.",
    "Type": {
      "Name": "Unassigned",
      "Id": 5
    },
    "VoteCount": 1,
    "Id": 2015
  },
  "FileAttachments": [
    {
      "FileId": 768142,
      "FileName": "DxDiag.txt",
      "DownloadUrl": ".\\768142"
    }
  ],
  "Comments": [
    {
      "Message": "This issue seems to have been fixed by updating Type script to 0.9.5",
      "PostedDate": "2013-12-16T13:45:20.46-08:00",
      "Id": 127691
    }
  ]
}