{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "As part of our move to GitHub, we're closing our CodePlex suggestions and asking that people move them to the GitHub issue tracker for further discussion.  Some feature requests may already be active on GitHub, so please make sure to look for an existing issue before filing a new one.\n\nYou can find our GitHub issue tracker here:\nhttps://github.com/microsoft/typeScript/issues\n",
    "ClosedDate": "2014-07-28T15:18:26.8-07:00",
    "CommentCount": 2,
    "Custom": null,
    "Description": "For ASP.NET MVC 4 projects in Visual Studio 2012, the Intellisense knows about a file called **[_references.js](http://gurustop.net/blog/2012/03/03/javascript-js-intellisense-auto_complete-in-visual-studio-11-beta-the-web-_references-js-file/)** to lookup references. It would be really useful to have the same idea in TypeScript's compiler so that it looks in a particular file (for example ___references.d.ts__) and automatically includes all those references in all the other .ts files passed to the compiler.\r\n\r\nIn fact, in our project (based on TypeScript 0.8.2) we did a little trick to do this. We put all our `/// <reference path=\"...\" />` refs to the definition files in ___references.d.ts__ and then make sure that it appear before any other typescript items in the project's **.csproj** file. That way all references are resolved correctly without us having to add any references in any of the typescript source files. My suggestion is to support this feature in the TypeScript compiler so that if a ___references.d.ts__ file is found then load it before any other source files, or enable a tsc.exe switch to specify a file containing all external references and module imports.\r\n\r\n**Update:** With the above trick, even though everything compiles fine in the project but Visual Studio TypeScript service cannot resolve references and shows errors. When the _references.d.ts file is opened then all the red lines go away in all open .ts files.",
    "LastUpdatedDate": "2017-11-27T11:51:33.707-08:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "typescript",
    "ReportedDate": "2013-05-30T12:06:18.387-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "External"
    },
    "Summary": "Suggestion: Recognize _references.d.ts",
    "Type": {
      "Name": "Unassigned",
      "Id": 5
    },
    "VoteCount": 8,
    "Id": 1092
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Thanks for the suggestion. We've had a great deal of discussion about potential solutions for 'project systems' including schemes like this but have not found a satisfactory answer yet. Assigned to Jonathon who handles our suggestions.",
      "PostedDate": "2013-05-30T18:47:25.73-07:00",
      "Id": 101750
    },
    {
      "Message": "This issue was addressed in TypeScript 0.9.5\n\nSee: Using _references.ts\nhttp://blogs.msdn.com/b/typescript/archive/2013/12/05/announcing-typescript-0-9-5.aspx\n\nI think you can close it now.\n\nThanks",
      "PostedDate": "2014-04-09T14:05:48.133-07:00",
      "Id": 141244
    }
  ]
}