{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "",
    "ClosedDate": "2013-09-11T22:19:01.137-07:00",
    "CommentCount": 1,
    "Custom": null,
    "Description": "I had to follow this:\r\n[https://typescript.codeplex.com/wikipage?title=Compile-on-Save&FocusElement=Comment](https://typescript.codeplex.com/wikipage?title=Compile-on-Save&FocusElement=Comment)\r\nIn order to get typescript compiling to JS in visual studio.\r\n\r\nThe barrier of entry is way too high considering this is not part of every new project. Ideally, new and existing projects should have no problem incorporating TypeScript!\r\n\r\nAll I did was install TypeScript 0.9.1.1 today (for the first time), and it just didn't work after adding a TypeScript file to a new web project.",
    "LastUpdatedDate": "2013-09-11T22:19:01.137-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "typescript",
    "ReportedDate": "2013-09-11T12:15:10.833-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "By Design"
    },
    "Summary": "New projects do not work immediately after install",
    "Type": {
      "Name": "Unassigned",
      "Id": 5
    },
    "VoteCount": 1,
    "Id": 1675
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Could you please outline for me how you added the new TypeScript file to the Project, and which version of Visual Studio you are using (i.e. 2012, or the recent 2013 RC)?\n\nIn 2013 we wire up the necessary build targets and pop up a dialog informing you TypeScript support has been added to your project any build should then 'just work' for compiling the TypeScript files.\n\nFor 2012, if you start with a TypeScript project template, then this support is already part of the project, else if you start from a non-TypeScript project, then you need to edit the .csproj yourself to add in the build target.\n\nWork in these areas is ongoing, but for these pre-release versions, this current behavior is a limitation of where we are in development.",
      "PostedDate": "2013-09-11T22:18:54.367-07:00",
      "Id": 113311
    }
  ]
}