{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "There is the community site referenced below as a solution currently.  Closing this issue on the 'issue tracker' section now, as it's not a 'product bug' as such.  If there is further discussion to be had please open a thread on the 'discussions' section.\n\nThanks!\n\n - Bill",
    "ClosedDate": "2012-12-28T12:40:33.747-08:00",
    "CommentCount": 8,
    "Custom": null,
    "Description": "I'm suggesting the creation of an official community site, or even a github/codeplex site, where people can submit and collaborate on the .d definition files. Ultimately I think having a central resource to share and collaborate on these files will be better than having them spread across multiple sites/repositories. Of course getting the API owners to generate .d.ts files themselves would be great, I just don't see this happening any time soon.",
    "LastUpdatedDate": "2017-11-27T11:51:33.707-08:00",
    "PlannedForRelease": "TypeScript 0.9.0",
    "ReleaseVisibleToPublic": true,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "typescript",
    "ReportedDate": "2012-10-08T17:57:53.263-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "External"
    },
    "Summary": "Create a .d community site",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 55,
    "Id": 191
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Agreed, ideally with distribution through some sort of package management.",
      "PostedDate": "2012-10-08T19:42:22.153-07:00",
      "Id": 79103
    },
    {
      "Message": "Thanks for the suggestion! Assigning to Jonathan who is handling our suggestions.",
      "PostedDate": "2012-10-09T10:44:13.787-07:00",
      "Id": 79193
    },
    {
      "Message": "Good idea - we are already banging up against the limitations of not having a .d file for JQueryUI",
      "PostedDate": "2012-10-12T01:10:55-07:00",
      "Id": 79580
    },
    {
      "Message": "Please, make it happen! <want-it-so-badly>",
      "PostedDate": "2012-10-12T01:55:43.523-07:00",
      "Id": 79584
    },
    {
      "Message": "I would think NuGet would support .d.ts files and inclusion in projects better than a distinct site? This would also permit different versions of each .d.ts file.",
      "PostedDate": "2012-10-15T07:12:02.467-07:00",
      "Id": 79754
    },
    {
      "Message": "I would say that this would be the responsiblity of the library developers and the community. Ideally distributed through their websites and/or through a package manager, such as NuGet. \n\nI therefore say that this isn't up to Microsoft unless they also want to distribute it through the the TypeScript website.",
      "PostedDate": "2012-10-20T01:53:19.02-07:00",
      "Id": 80529
    },
    {
      "Message": "For now you can use/contribute to the following GitHub project of type definitions for popular JavaScript libraries.\n\nhttps://github.com/borisyankov/DefinitelyTyped\n\n> The project aims to provide high quality definitions for the most popular libraries out there.",
      "PostedDate": "2012-10-24T03:33:03.07-07:00",
      "Id": 80877
    },
    {
      "Message": "I have contacted Boris (who owns DefinitelyTyped) and I will be working on a set of powershell build scripts for him to generate definition NuGet packages which take dependencies on their targeted libraries (also NuGet packages).",
      "PostedDate": "2013-01-10T18:45:05.243-08:00",
      "Id": 85747
    }
  ]
}