{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "We've seen this intermittently but haven't been able to reliably reproduce this; it may be related to some specific structure of the code you're working on.\n\nWould it be possible for you to upload a project that reproduces the problem with some details about what you were doing when things stopped working? (Use the 'Re-open' link at the top of this form). Thanks!",
    "ClosedDate": "2013-08-12T13:10:47.997-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "I've run into this a variety of times now with the LKG of 0.9.1.1, but I don't have a specific repro. I'm using \"Compile-on-Save\" (but not WebEssentials), and it usually works OK (if still very slow). Periodically, however, the TS language service will stop displaying any errors - but the .ts file still won't be compiled, i.e., the associated .js file doesn't change. Usually there's a valid reason for this - there's some sort of syntax error in the .ts file - apart from the fact that no errors gets displayed. In every instance I've seen, restarting Visual Studio fixes the problem, i.e., Visual Studio once again starts telling me where the errors are.\r\n\r\nMy other workaround so far has been to create a separate tsbuild.cmd file, and run that. That'll at least point me to where the error is, so I don't have to restart Visual Studio (which is a beast, if an elegant beast, that groans and complains for 60+ seconds every time it needs to be restarted).\r\n\r\nI'm running VS2012 Update 3, on Windows 7 32-bit, with 4 GB of RAM.",
    "LastUpdatedDate": "2013-08-12T13:10:47.997-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "typescript",
    "ReportedDate": "2013-08-12T09:06:43.987-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Need More Info"
    },
    "Summary": "VS language service won't build file but won't display errors",
    "Type": {
      "Name": "Unassigned",
      "Id": 5
    },
    "VoteCount": 1,
    "Id": 1492
  },
  "FileAttachments": [],
  "Comments": []
}