{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "With the latest bits I can't reproduce the error you're seeing in the sequence above. I always get the correct errors on the lines where I expect to. If you have other repros please re-open with them. We're aware of some issues in this space which we have fixed and with more to come. \n\nThe Typescript compiler intentional still emits JavaScript when there are type errors in your code (ie they are treated as warnings, not errors), but not when there are syntax errors. This is intentional to aid with the migration from and interop with JavaScript. We may eventually provide a means to do something like 'treat warnings as errors' so that you won't get emit when type errors exist.",
    "ClosedDate": "2013-08-22T13:03:02.263-07:00",
    "CommentCount": 3,
    "Custom": null,
    "Description": "When editing .ts files in VS 2012 Update 3 with TS 0.9.1.0, the following lines of invalid typescript appears to be valid in the TS editor:\r\n\r\n![Image](https://sluesa.dm1.livefilestore.com/y2mm1dTSJE7M0ebveIzUi8pVOuccnpFUZ4VFnhfQHc6Pm5N_5J9JWWZ4LHvTiXzH7CK0OXWTnNflFMqOF68CAB1X1lR9LxlzO4IVbZYYFOeB5SOKV5AVnW0sYDPW02dAbHs/TypeScriptHTMLApp1%20-%20Invalid.jpg?psid=1)\r\n\r\nTo repro this problem type a line of invalid JS like \"x = 10 + L\" and when the intellisense popup appears after pressing \"L\", wait for a few seconds (the red squiggly marks disappear) then press ESC to dismiss the intellisense popup. Now, the line will appear valid. If you save the file at this point, invalid JS gets compiled and output.\r\n\r\nSometimes tinkering with the code and/or interacting with the editor fixes the issue, displaying the expected error highlighting but the JS that is compiled when you save is still invalid:\r\n\r\n![Image](https://sls5jq.dm1.livefilestore.com/y2pFWET0BMcEjSWHE9ojouJWAbk9YVkSxWWkkVqPH2TtlCyCJAxUhRd6oo4MTs2faAXsBIREprCrCphuPWl7_eKtypI3NwPZDs0-82QMi2A0g8/TypeScriptHTMLApp1%20-%20Valid.jpg?psid=1)\r\n\r\nThis seems to happen a lot with a large TS project. I don't understand why TS is allowing invalid JS to be output. In the past when I used Web Essentials to compile the TS it would simply display a list of errors that needed to be corrected instead of invalid JS. \r\n\r\nThis problem makes it impossible to trust the error highlighting in the VS 2012 Plug-In with TS 0.9.1 and that the TS compiler is generating valid JS. This is a major pain point.\r\n\r\nI have Web Essentials installed but I have turned off its compile on save and preview window features in an attempt to just use the TS Plug-In's built-in capabilities.",
    "LastUpdatedDate": "2013-08-27T09:44:17.467-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "typescript",
    "ReportedDate": "2013-08-20T15:52:06.827-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Need More Info"
    },
    "Summary": "Error highlighting in 0.9.1 is flakey",
    "Type": {
      "Name": "Unassigned",
      "Id": 5
    },
    "VoteCount": 1,
    "Id": 1539
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "This issue seems to be resolved in the 0.9.1.1 release. ",
      "PostedDate": "2013-08-21T21:56:11.113-07:00",
      "Id": 110708
    },
    {
      "Message": "the flakey error problems are not resolved in the develop branch either.",
      "PostedDate": "2013-08-22T02:38:39.363-07:00",
      "Id": 110723
    },
    {
      "Message": "Makes sense. Keep up the great work and thanks for being so responsive!",
      "PostedDate": "2013-08-22T13:20:36.76-07:00",
      "Id": 110800
    }
  ]
}