{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "As part of our move to GitHub, we're closing our CodePlex suggestions and asking that people move them to the GitHub issue tracker for further discussion.  Some feature requests may already be active on GitHub, so please make sure to look for an existing issue before filing a new one.\n\nYou can find our GitHub issue tracker here:\nhttps://github.com/microsoft/typeScript/issues\n",
    "ClosedDate": "2014-07-28T15:18:56.643-07:00",
    "CommentCount": 3,
    "Custom": null,
    "Description": "I'd like for my comments to be included with my compiled output as an option to the VS extension. TypeScript HTML applications have a BeforeBuild target that I believe can be manipulated. Including TypeScript files inside an existing application doesn't seem to have an option to be manipulated. Correct me if I am overlooking something.",
    "LastUpdatedDate": "2017-11-27T11:51:33.707-08:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "typescript",
    "ReportedDate": "2012-10-19T08:53:46.8-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "External"
    },
    "Summary": "VS extension option to include -c",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 292
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Install Web Essentials for VS 2012. It's free and allows you to control most typescript compile options.\n\nhttp://visualstudiogallery.msdn.microsoft.com/07d54d12-7133-4e15-becb-6f451ea3bea6\n\n",
      "PostedDate": "2012-10-19T21:35:52.483-07:00",
      "Id": 80522
    },
    {
      "Message": "Open the project file in Notepad, search for 'tsc' and add that -c option manually. ",
      "PostedDate": "2012-10-21T10:55:59.053-07:00",
      "Id": 80589
    },
    {
      "Message": "@mihailik that doesn't work as my project isn't a TypeScript application. I simply have ts files embedded inside an existing web application.\n\n@ashkandaie this is exactly what I was looking for and more. Thanks! I actually had this extension installed already but didn't know it supported TypeScript options until you mentioned it.",
      "PostedDate": "2012-10-22T06:06:17.87-07:00",
      "Id": 80648
    }
  ]
}