{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "The fix should be visible in the upcoming release. Thanks!",
    "ClosedDate": "2014-03-31T17:34:12.853-07:00",
    "CommentCount": 20,
    "Custom": null,
    "Description": "I have included a screenshot of a before and after output of a class from 0.9.5 and 1.0 RC that has caused our application to completely stop working.\r\n\r\nTypescript is incorrectly referencing an exported class on a module (app.reports._report.Report) because it is looking for the module prepended with an underscore where as it should be app.reports.report.Report (or the local var _report.Report).\r\n\r\nThis is then throwing an error in chrome because the module is undefined and any export classes, enums etc on it are not available.\r\n\r\nThe screenshot should clarify this better as I have highlighted the differences in the before and after output.",
    "LastUpdatedDate": "2017-11-27T11:51:34.217-08:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "typescript",
    "ReportedDate": "2014-02-26T03:30:54.807-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Fixed"
    },
    "Summary": "1.0 RC incorrectly referencing module",
    "Type": {
      "Name": "Unassigned",
      "Id": 5
    },
    "VoteCount": 15,
    "Id": 2222
  },
  "FileAttachments": [
    {
      "FileId": 807562,
      "FileName": "ts_error.jpg",
      "DownloadUrl": ".\\807562"
    },
    {
      "FileId": 807563,
      "FileName": "TypeScriptProblem.zip",
      "DownloadUrl": ".\\807563"
    },
    {
      "FileId": 809737,
      "FileName": "tsc.js",
      "DownloadUrl": ".\\809737"
    }
  ],
  "Comments": [
    {
      "Message": "Same problem.\r\n\r\nI guess it happens when method variable names match with module name.\r\n\r\nAttach the sample app to reproduce the problem.",
      "PostedDate": "2014-02-26T03:41:43.72-08:00",
      "Id": 134848
    },
    {
      "Message": "I'm also seeing this and it's a huge breaking issue. We have a tons of errors due to this.  Code can be found here: https://github.com/exceptionless/Exceptionless",
      "PostedDate": "2014-02-26T05:30:12.69-08:00",
      "Id": 134856
    },
    {
      "Message": "I fixed this issue by renaming my parameters and variables so they don't match a module namespace.\n\nhttps://github.com/exceptionless/Exceptionless/commit/56c290c8173c329aff8cbf007cb6a2ce67988148",
      "PostedDate": "2014-02-26T05:57:44.453-08:00",
      "Id": 134857
    },
    {
      "Message": "This too is a big problem for me. How did a problem this big slip through testing????",
      "PostedDate": "2014-02-26T06:18:34.027-08:00",
      "Id": 134858
    },
    {
      "Message": "Working on a fix now",
      "PostedDate": "2014-02-26T11:41:24.92-08:00",
      "Id": 134909
    },
    {
      "Message": "I am having the same issue... is there a fix yet???? thank you",
      "PostedDate": "2014-02-28T07:01:51.517-08:00",
      "Id": 135393
    },
    {
      "Message": "Exact same problem here. \n\nAny timeline? Will this be fixed in a few hours, a few day, or a few months?\n\n(Here's hoping for a 'by Monday' answer)",
      "PostedDate": "2014-02-28T13:04:24.883-08:00",
      "Id": 135447
    },
    {
      "Message": "We're looking at two possible fixes to make sure we do the right thing and don't break anything else. We've just finished validating the \"better\" fix against our partner codebases and have a few more checks to do before we commit it to the release-1.0 branch and start a new build for release.\n\nThere should be something available for use (i.e. a drop-in tsc.js replacement) by the end of the day.",
      "PostedDate": "2014-02-28T14:17:22.21-08:00",
      "Id": 135464
    },
    {
      "Message": "We've checked in a fix and an LKG update to branch release-0.9.7. Please try it out and see if it fixes your problem:\r\n\r\nhttps://typescript.codeplex.com/SourceControl/changeset/30dd016c5cb952c61b9fabb6bf9d155e697788ee\r\n\r\nI am also attaching a tsc.js with the fix.",
      "PostedDate": "2014-02-28T18:30:57.283-08:00",
      "Id": 135485
    },
    {
      "Message": "Hi,\n\nI reinstalled 0.9.7 and updated typescript.js and tsc.js in your update. This doesn't appear to have fixed the issue as I am getting the same compiled output as before. \n\nCheers",
      "PostedDate": "2014-03-03T07:02:50.377-08:00",
      "Id": 135619
    },
    {
      "Message": "hi there... i downloaded the \"release-0.9.7\" branch... i built the compiler using jake local... i grabbed the files from \"built/local\" (tsc.js, typescriptservices.js, typescript.js, lib.d.ts)... i placed these in the following dirs: \"C:\\Program Files (x86)\\Microsoft SDKs\\TypeScript\\0.9\" and \"C:\\Program Files (x86)\\Microsoft Visual Studio 11.0\\Common7\\IDE\\CommonExtensions\\Microsoft\\TypeScript\"... i rebuilt my solution but the problem persists... i am using vs 2012... i am wondering if perhaps there is something wrong with the steps i took... any ideas? thank you",
      "PostedDate": "2014-03-03T07:05:49.817-08:00",
      "Id": 135620
    },
    {
      "Message": "Hi,\r\n\r\nUpon further inspection, the tsc.js file I attached did not contain my update. I've now swapped it out for the correct updated version. Please try downloading it again.\r\n\r\nThose of you who pulled the release-0.9.7 branch and built yourself, make sure you are synched to commit 30dd016c5cb952c61b9fabb6bf9d155e697788ee. Also note that I updated the LKG in the branch, so just using bin\\tsc.js should be sufficient.\r\n\r\nA good way to make sure the file has my update is to search the file for the string \"shouldQualifySymbolNameWithParentName\". If you get a hit, then you have the updated file.\r\n\r\nThanks,\r\nJason",
      "PostedDate": "2014-03-03T11:00:16.717-08:00",
      "Id": 135652
    },
    {
      "Message": "hello... i downloaded the release-0.9.7 branch and copied the bin\\tsc.js into \"C:\\Program Files (x86)\\Microsoft SDKs\\TypeScript\\0.9\" and \"C:\\Program Files (x86)\\Microsoft Visual Studio 11.0\\Common7\\IDE\\CommonExtensions\\Microsoft\\TypeScript\"... but the problem persists... i verified the file contains the string \"shouldQualifySymbolNameWithParentName\"... any ideas? thank you",
      "PostedDate": "2014-03-03T11:46:12.69-08:00",
      "Id": 135662
    },
    {
      "Message": "Can you copy or attach a code block that demonstrates the bug (compiled with the update I pushed)? Please indicate which name reference is incorrect, and what you think it should be. Thanks!",
      "PostedDate": "2014-03-03T12:08:03.97-08:00",
      "Id": 135667
    },
    {
      "Message": "sorry... it looks like i jumped the gun... things look ok now i believe... the name of my module is \"fng.space.deal\"... down below is the generated output from the update... i thought there was still an issue given that the name of the func param below is still \"_deal\" instead of \"deal\"... but i realize that latter code is correctly using the \"_deal\" param... sorry... thanks for the fix...\n\nvar __extends = this.__extends || function (d, b) {\n    for (var p in b) if (b.hasOwnProperty(p)) d[p] = b[p];\n    function __() { this.constructor = d; }\n    __.prototype = b.prototype;\n    d.prototype = new __();\n};\nvar fng;\n(function (fng) {\n    (function (space) {\n        (function (_deal) {\n\n.....a bunch of code\n\n\n        })(space.deal || (space.deal = {}));\n        var deal = space.deal;\n    })(fng.space || (fng.space = {}));\n    var space = fng.space;\n})(fng || (fng = {}));\n",
      "PostedDate": "2014-03-03T13:30:54.38-08:00",
      "Id": 135680
    },
    {
      "Message": "Great! Thanks for verifying, and glad the issue was resolved.",
      "PostedDate": "2014-03-03T14:05:12.233-08:00",
      "Id": 135685
    },
    {
      "Message": "Hi Jason,\n\nThis appears to have fixed the issue for me as well.\n\nCheers",
      "PostedDate": "2014-03-04T01:24:56.497-08:00",
      "Id": 135742
    },
    {
      "Message": "Hi again!\n\nI have discovered that this fix does not work with 'Compile on save' set on and the output is the same as I originally showed. This may not be an issue once this is merged in fully but thought I'd let you know nonetheless.\n\nCheers",
      "PostedDate": "2014-03-04T01:56:08.553-08:00",
      "Id": 135744
    },
    {
      "Message": "Interesting. What exact files did you replace on your computer? There are actually two files that would need to be replaced:\n\n\"C:\\Program Files (x86)\\Microsoft SDKs\\TypeScript\\0.9\\tsc.js\"\n\n\"C:\\Program Files (x86)\\Microsoft Visual Studio 12.0\\Common7\\IDE\\CommonExtensions\\Microsoft\\TypeScript\\typescriptServices.js\"\n\nor the corresponding 11.0 folder if you are using VS 2012. The second of these is required for compile on save to work properly.",
      "PostedDate": "2014-03-04T10:42:27.3-08:00",
      "Id": 135797
    },
    {
      "Message": "Hi,\n\nThis is actually working fine, I didn't realise I had to replace the typescriptServices file (I'm a noob at this!) Thanks for the fix.\n\nCheers",
      "PostedDate": "2014-03-05T01:50:57.143-08:00",
      "Id": 135877
    }
  ]
}