{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "",
    "ClosedDate": "2013-01-22T10:08:08.193-08:00",
    "CommentCount": 3,
    "Custom": null,
    "Description": "While JSDoc appears to work fine on classes, methods and properties, the following is ignored in 0.8.2:\r\n\r\n```\r\nmodule MyModule {\r\n    /**\r\n     * This is a simple Js function.\r\n     */\r\n     function Hello() { console.log(\"hello.\"); }\r\n```",
    "LastUpdatedDate": "2013-08-13T12:14:27.23-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "typescript",
    "ReportedDate": "2013-01-22T09:46:40.693-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "JSDoc comments ignored on simple functions",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 635
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Code such as the above is working fine for me if I call the function directly or within another function in the module (as it's not exported), or if I export it and then call if from outside the module.  In both cases I see the JSDoc comments appear in intellisense.  \n\nCan you please reopen with more detailed steps on what actions you are performing, what you expect to see, and what you are observing?  Then I'll try to repro again.  Thanks.",
      "PostedDate": "2013-01-22T10:08:04.427-08:00",
      "Id": 86866
    },
    {
      "Message": "Weird - it's working now too. Thanks for double checking. It may just have been some churning or paging going on in VS that was delaying the parsing... who knows.",
      "PostedDate": "2013-01-22T12:51:02.03-08:00",
      "Id": 86884
    },
    {
      "Message": "No, I'm getting this too.  Same scenario except that my function is exported.  The private var of the same type as the function's return type, for example, IS recognized and shows the comments from the class.  But the exported function doesn't show that information and even if I give the function it's own comments, as in the op's example, it doesn't recognize it even at the definition site, let alone the call site.",
      "PostedDate": "2013-02-06T07:03:22.38-08:00",
      "Id": 88692
    }
  ]
}