{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "As part of our move to GitHub, we're closing our CodePlex issues and suggestions and asking that people move them to the GitHub issue tracker for further discussion.  Some issues and feature requests may already be active on GitHub, so please make sure to look for an existing issue before filing a new one.\n\nYou can find our GitHub issue tracker here:\nhttps://github.com/microsoft/typeScript/issues\n",
    "ClosedDate": "2014-07-28T15:20:17.473-07:00",
    "CommentCount": 3,
    "Custom": null,
    "Description": "The newly added file in Visual Studio should ideally only contain the following:\r\n\r\n```TypeScript\r\nmodule file1 {\r\n\r\n    export class file1 {\r\n\r\n    }\r\n}\r\n```",
    "LastUpdatedDate": "2017-11-27T11:51:34.097-08:00",
    "PlannedForRelease": "TypeScript 0.9.1",
    "ReleaseVisibleToPublic": true,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "typescript",
    "ReportedDate": "2012-11-26T05:32:02.627-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "External"
    },
    "Summary": "Please reduce \"Add > TypeScript file\" content",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 7,
    "Id": 494
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "I agree with this suggestion, but the OP is still requesting too much.  Starting with Modules is still too much.  I think I would almost prefer it to be completely blank, as I cannot think of any suitable to put in there.  The other option would be to make it a fully supported VS language, so you would have Typescript -> Class, Interface, Module, etc.",
      "PostedDate": "2013-03-26T07:56:21.9-07:00",
      "Id": 94394
    },
    {
      "Message": "@jmcqk6 -  That's right, TypeScript is not as proscriptive as C# about how code is organized (it can't be, since JavaScript isn't), so the only real options here are to remove all the content from the file, or keep it as a simple \"tutorial\".  We will almost certainly remove all the content in the future, and leave the more \"tutorial\" content for a project template.",
      "PostedDate": "2013-03-27T09:38:22.623-07:00",
      "Id": 94534
    },
    {
      "Message": "I actually think my suggestion is perfectly reasonable because it is by far the most common use case.\n\nIt also encourages the single class per file rule, and supports the idea that the file is named the same as the class.\n\nI actually don't know what it means that \"TypeScript is not as prescriptive as C# about how code is organized\" because that seems to the whole point of modules and classes!",
      "PostedDate": "2013-04-09T10:19:53.99-07:00",
      "Id": 96505
    }
  ]
}