{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "",
    "ClosedDate": "2014-04-17T18:39:43.657-07:00",
    "CommentCount": 2,
    "Custom": null,
    "Description": "I have tried to install 1.0RC in VS2013 using VS2013 latest update. Previously I had 0.9.7 which worked fine. Installation failed, and now I can't uninstall and I can't repair 0.9.7. Installation freezes while trying to create restore point. I also have VS2012 installed. Any help is appreciated... I can see that there are other with similar problems in this closed issue:\r\nhttps://typescript.codeplex.com/workitem/2253 ",
    "LastUpdatedDate": "2014-04-17T18:39:43.657-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "typescript",
    "ReportedDate": "2014-04-04T17:04:25.15-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Need More Info"
    },
    "Summary": "Can't uninstall and can't repair 0.9.7 after failing to install 1.0RC",
    "Type": {
      "Name": "Unassigned",
      "Id": 5
    },
    "VoteCount": 1,
    "Id": 2385
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Thanks for raising this issue. We would appreciate it if you can share some setup logs with us to be able to further investigate the issues you are running into doing Update 2RC setup.\n\nCould you please share the install logs from your installation of VS2013 Update2 RC (found under the %temp% folder, if you can't tell which install logs are relevant, please just zip up all install logs in that folder starting from the date you installed the problematic update), and the zip'd contents of your \"~\\PF\\MS VS 12.0\\Common7\\IDE\\CommonExtensions\\Microsoft\\TypeScript folder\" when your TypeScript install is in the broken state?\n",
      "PostedDate": "2014-04-07T14:29:56.82-07:00",
      "Id": 140880
    },
    {
      "Message": "Closing this for now. Please re-open if you're able to add the requested information to help us debug how this happened.",
      "PostedDate": "2014-04-17T18:39:40.663-07:00",
      "Id": 142296
    }
  ]
}