{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "This was a known issue with the alpha release. We plan to get it working again in the future. It looks like it might've accidentally been left off the list of known issues in our initial communications, sorry about that. \n\nYou might try to see if the latest version of the Web Essentials VS extension will unblock you for the moment if you must have Compile On Save along with 0.9.0-alpha bits. It has its own implementation of a similar feature.",
    "ClosedDate": "2013-04-25T13:00:29.093-07:00",
    "CommentCount": 1,
    "Custom": null,
    "Description": "I had the  autocompile-on-save feature enabled in my project according to:\r\n\r\nhttp://typescript.codeplex.com/wikipage?title=Compile-on-Save\r\n\r\nIt used to work in 0.8.3\r\n\r\nNow in 0.9 nothing happens when I save the .ts file.\r\nThe associated \"js\" file is only modified when I build the project.\r\n\r\nDid I miss anything?\r\n\r\nUPDATE:\r\nIs there a way to fix this problem somehow? It is a real stopper. Thank you.",
    "LastUpdatedDate": "2013-08-13T12:26:54-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "typescript",
    "ReportedDate": "2013-04-24T12:48:33.003-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "By Design"
    },
    "Summary": "Autocompile on save stopped working in 0.9",
    "Type": {
      "Name": "Unassigned",
      "Id": 5
    },
    "VoteCount": 2,
    "Id": 945
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "I tried WebEssentials again, it works but it generates slightly different JS code: typescript compiler refers to static methods starting from the root module down to the method whereas WebEssential omits the root module and uses the shortest path possible. \nIt is an inconvenience as I have all my js modified every time I switch from tsc (build) to web essential (file save).\n\nIs the a clue when the fix will be available?",
      "PostedDate": "2013-04-25T13:46:21.187-07:00",
      "Id": 98509
    }
  ]
}