{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "",
    "ClosedDate": "2013-11-26T09:27:03.487-08:00",
    "CommentCount": 1,
    "Custom": null,
    "Description": "Hi. I'm trying to use TS with Node.js framework, but it's a little tricky.\r\n\r\nI added a question on stackoverflow: http://stackoverflow.com/questions/20219450/typescript-use-typescript-require-shared-files\r\n\r\nIn summary, I can't use the keyword __extends__ on my classes if I do inheritance, it's not working, the class is not found if I add the keyword.\r\nIt's one issue.\r\n\r\nMaybe do you have some tips for Node.js use? I tried the typescript-required but that's not working, (see the link), do you have any solution?\r\n\r\nWhat I want to do is to have files shared between the server and the client, that means the server will use directly the file wrote using TypeScript but the client will get the file merged with a lot of other files and zipped and I need that files are compatible with both client (browser) and server.\r\n\r\nThank you for your help.\r\n\r\nEdit: OOps, maybe it's not the right place for my personal problem, I'll write a topic on the discussion part.\r\nBut there is still the bug with typescript-require at least.",
    "LastUpdatedDate": "2013-11-26T09:27:03.487-08:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "typescript",
    "ReportedDate": "2013-11-26T07:50:49.56-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "External"
    },
    "Summary": "TypeScript with node.js",
    "Type": {
      "Name": "Unassigned",
      "Id": 5
    },
    "VoteCount": 1,
    "Id": 1948
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "This appears to be more a general question on usage that a specific problem with the TypeScript implementation.  As such, I've continued this discussion over on your stackoverflow post.\n\nPlease respond there and we'll discuss.  I'll close this issue now on the Issue Tracker, and we can reopen it if it does turn out to be a TypeScript issue.\n\nThanks.",
      "PostedDate": "2013-11-26T09:26:45.67-08:00",
      "Id": 124334
    }
  ]
}