{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "That error is the compiler crashing, which isn't ever an intended behavior :)\n\nThis issue has been fixed in the develop branch.",
    "ClosedDate": "2013-11-11T08:39:01.263-08:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "I have been busting my head for the last two days trying to figure out why my typescript project suddenly stopped working. There was no intellisense support and building the project reported strange errors (which I ignored at the time because I had lots of my own errors).\r\n\r\nIn the end I removed all but one file (which contained simple class that has no other purpose than contain data). Building project still produced one error:\r\n\r\n\"Unable to get property 'block' of undefined or null reference\"\r\n\r\nThan I figured out what the problem was...\r\n\r\nIn the last few days I went zealous on all code annotation (accessibility, value types, etc.) and adding public to all of my constructors was one of those things.\r\n\r\nI have googled constructor accessibility and I found that it really isn't supported.\r\n\r\nI do believe visual studio should report a more intuitive error than \"Unable to get property 'block' of undefined or null reference\" though. A simple \"constructor cannot have accessibility modifiers\" would do wonders :).\r\n\r\nI did basic check on this forum and I didn't find anything regarding public constructors, so I hope I didn't make a duplicate issue...\r\n\r\nRegards, Erik\r\n\r\n",
    "LastUpdatedDate": "2013-11-11T08:39:01.263-08:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "typescript",
    "ReportedDate": "2013-11-09T23:31:45.063-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Fixed"
    },
    "Summary": "Public construct accessibility",
    "Type": {
      "Name": "Unassigned",
      "Id": 5
    },
    "VoteCount": 1,
    "Id": 1880
  },
  "FileAttachments": [],
  "Comments": []
}