{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "I was not able to reproduce this. \n\nOne of the things you can try.\nClose all instances of VS.\nIn the install folder for Visual Studio 2013 (e.g. C:\\Program Files\\Microsoft Visual Studio 12.0\\Common7\\IDE) run the following from an administrative prompt.\n````\ndevenv /setup\n````\n\nAnd wait until devenv.exe is done processing, check in task manager.\n\nAlso can you look in the %tmp% folder and attack all the recent logs with TypeScript in the name.\n\nAbout the last remark, I'm not sure what you mean there. Can you start a discussion on the forum so others can chime in.\n\nThanks, \n\nClosing for tracking, can you re-open with the button on top if you added more info.",
    "ClosedDate": "2014-03-05T13:10:29.143-08:00",
    "CommentCount": 1,
    "Custom": null,
    "Description": "I have VS 2012 and 2013 installed on Windows 8.1. After running the TS setup, it appears to have successfully installed for 2012 but not for 2013, even though the download says it works for both, and during setup it says it is installing for both.\r\n\r\nI see TypeScript directories in both VS directories (although they have different conent), but the integration is missing. In 2013, there is no Options > Text Editor > TypeScript entry like there is in 2012. Also, 2012 has the \"HTML Application with TypeScript\" project type. 2013, on the other hand, has the project type \"Install the Latest TypeScript for Visual Studio\", which takes me to the download page for the same setup script I just ran. Then there are the missing .js dependencies on the associated .ts file.\r\n\r\nIt's unfortunate that such a compelling product is being hamstrung by setup failures. This is not an RC quality setup tool.\r\n\r\nAt the very least, if the code were available somewhere, we could figure out how to modify our projects to get compile on build or compile on save working. It's probably foolish to make production applications depend on this, but a lot of people have done so. There are many, many questions and workarounds on the various fora (like CodePlex and StackOverflow) by people just trying to get their projects working. \r\n\r\nAny help here would be appreciated.",
    "LastUpdatedDate": "2014-03-31T16:39:05.943-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "typescript",
    "ReportedDate": "2014-03-05T10:45:44.113-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Need More Info"
    },
    "Summary": "TypeScriptSetup 1.0rc fails for Visual Studio 2013",
    "Type": {
      "Name": "Unassigned",
      "Id": 5
    },
    "VoteCount": 1,
    "Id": 2263
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "I ran the command from an admin prompt. I did not see anything in the logs under %tmp% (findstr /i /s typescript *).\n\nI subsequently ran the setup from the admin prompt and selected repair. I can now see the TypeScript section under Text Editor in options. \n\nIn addition, compile on save is now working. I had added the typescript entries to my .csproj file from the HTML TS template, which would compile on build before.\n\nI have no Idea why this wasn't working. I had tried an uninstall and reinstall of TypeScriptSetup.1.0rc.exe twice, along with repair. I can't imagine I'm the only one who will see this. I have a very vanilla setup. I recently set up a brand new 8.1 machine, then installed VS 2012 Ultimate (RTM), followed by VS 2013 Ultimate (with Update 1 applied).\n",
      "PostedDate": "2014-03-05T21:29:13.147-08:00",
      "Id": 136003
    }
  ]
}