{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "Thanks for reporting.. we're aware of this issue and it will be fixed in the next release of TypeScript.",
    "ClosedDate": "2013-08-30T11:58:37.66-07:00",
    "CommentCount": 1,
    "Custom": null,
    "Description": "I'm using Windows 8 Enterprise x64 Traditional Chinese, with VS 2012 Ultimate Traditional Chinese and VS 2013 Preview Ultimate Traditional Chinese (without ASP.NET and Web Tools for Visual Studio 2013 Preview, cause it's English only) and newest Web Essentials.\r\nNow I'm using VS 2013 Preview mainly, my projects all use Compile-on-Save.\r\n\r\nAfter upgrade from 0.9.0.1 to 0.9.1.1, the initial builds in VS 2013 Preview are all fine.\r\nBut after a rebuild all, it starts to having an error:\r\nVSTSC : error TS5015: Unsupported locale: 'zh-TW'.\r\nAnd no js/map generated.\r\n\r\nI open the same solution with VS 2012, it's still fine.\r\n\r\nBack to VS 2013 Preview. I search all files, the only place that has \"zh-TW\" is web.config <system.web> <globalization culture=\"zh\" uiCulture=\"zh-TW\" />.\r\nI change it into zh-CHT, but the error still shows \"zh-TW\".\r\n\r\nI add [assembly: NeutralResourcesLanguage(\"zh-Hant\")] into AssemblyInfo.cs, but the error remains unchanged.\r\n\r\nMy another notebook that is Windows 7 Professional x86 with VS 2013 Preview Ultimate only, all Traditional Chinese.\r\nAfter upgrade, initial builds are fine, rebuild all is fine too.\r\nI start to add <TypeScriptNoImplicitAny>true</TypeScriptNoImplicitAny>, build, the same error shows up.\r\nEven delete TypeScriptNoImplicitAny item, the same error remains.\r\n\r\nI turn build output level to normal, sees C:\\Program Files\\Microsoft SDKs\\TypeScript\\tsc.exe  --sourcemap --target ES5 --locale zh-TW.\r\nI copy C:\\Program Files\\Microsoft SDKs\\TypeScript\\zh-Hant folder to zh-TW, and the build success.\r\n\r\nI go back to VS 2012, see the normal build output, the parameter of tsc.exe have no --locale parameter. That descripts the successful build in VS 2012.\r\n\r\nI wonder where does the zh-TW comes from?",
    "LastUpdatedDate": "2014-04-10T01:49:37.977-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "typescript",
    "ReportedDate": "2013-08-27T19:11:16.523-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Fixed"
    },
    "Summary": "VSTSC : error TS5015: Unsupported locale: 'zh-TW' on VS 2013 Preview with 0.9.1.1",
    "Type": {
      "Name": "Unassigned",
      "Id": 5
    },
    "VoteCount": 1,
    "Id": 1606
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "I have the same problem but 'zh-CN', i guess this is a Visual Studio bug . I use Visual Studio Ultimate 2013 which version number is 12.0.30110.00 Update 1",
      "PostedDate": "2014-04-10T01:49:37.977-07:00",
      "Id": 141325
    }
  ]
}