{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "See comments.",
    "ClosedDate": "2013-10-21T11:42:00.87-07:00",
    "CommentCount": 2,
    "Custom": null,
    "Description": "Looking at https://typescript.codeplex.com/workitem/1592 reminds me that the current issues workflow isn't working very well. Two suggestions for improvement:\r\n\r\n1. Please link your tests to your workitems, so anyone running tests notices which workitems are affected and adds comments on those items (unlike github, codeplex only partially supports this: http://blogs.msdn.com/b/codeplex/archive/2013/09/27/linking-commits-to-issues.aspx ).\r\n\r\n2. Please also implement the following workaround for codeplex issue https://codeplex.codeplex.com/workitem/25627 :\r\n\r\n  - create a mailing list `typescript-issues`, subscribe codeplex as the only writer, everone else can subscribe as reader, create a codeplex account that follows all workitems and has the mailing list as email address.\r\n\r\n  - then unsubscribe team members from all issues, resubscribing them only to those issues they work on, and subscribe all team members to the mailing list.\r\n\r\nWith this workaround, you will be able to filter general issue tracker email differently than email for your workitems (different color or different folder), so you will actually be able to follow the workitems you work on (without having to close/open them).",
    "LastUpdatedDate": "2013-11-19T16:04:32.477-08:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "typescript",
    "ReportedDate": "2013-10-19T02:27:09.37-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Postponed"
    },
    "Summary": "Please improve issues workflow",
    "Type": {
      "Name": "Unassigned",
      "Id": 5
    },
    "VoteCount": 1,
    "Id": 1810
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "We're satisfied with the current workflow for issues. For IP reasons, we have to use a different internal system for tracking issues and we can't invest extra time doing more CodePlex housekeeping. I realize this isn't ideal, but we have to optimize for actually getting bugs fixed and features implemented.\n\nYou are always welcome to use the \"Contact user\" form with direct questions like the one in 1592 - we're happy to respond.\n\nPlease use the discussion forums for things like this and only use the issue tracker for actual code defects. This gets us broader feedback from other uses who would like issue workflow changes and lets us get more information on what people are wanting to get out of the issue tracker.",
      "PostedDate": "2013-10-21T11:41:28.97-07:00",
      "Id": 119101
    },
    {
      "Message": "You do not notice when commits affect workitems. You do not notice when information or questions are added to workitems. And (since \"contact user\" runs into the same codeplex issue) you do not notice direct codeplex messages, either (I've tried). You do not use codeplex internally. You cannot afford to invest time in your community-fronting tracker. Your two preferred (user-visible) usage patterns for codeplex are either to close items as quickly as possible (even without solution) or to move them to a non-public suggestion list.\n\nHow can you be \"satisfied\" with this situation??\n\nYou seem to be unaware of how this is destroying your community credibility, how it saps energy that could otherwise be dedicated to contributions, or how it hampers community involvement. I myself certainly feel discouraged, not to mention disappointed. And, unless your internal tracker is a lot better organized than your community-visible one, you are losing valuable information (especially for post-1.0 evolution).\n\n> we have to optimize for actually getting bugs fixed and features implemented.\n\nThis is an open-source project - you have to optimize for community involvement. Your user community consists of developers using the same language as you are. If you enable and support even a fraction of that community in getting involved, you will \"optimize for actually getting bugs fixed and features implemented\". If, instead, you close off actual development workflows from the public as you do at the moment, you are **minimizing** progress, not maximizing it. \n\nHave a chat with the GHC folks (another open-source language and compiler project at MS) - they never had as many developers on the team as you have (the core team has actually shrunk) but they have kept their community in the loop.",
      "PostedDate": "2013-10-21T14:06:53.253-07:00",
      "Id": 119140
    }
  ]
}