{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "Please re-open this if you can provide more information or steps to reproduce the issue.",
    "ClosedDate": "2013-02-14T16:17:00.203-08:00",
    "CommentCount": 2,
    "Custom": null,
    "Description": "Whenever I try to install typescript msi it starts up but just sits there with no progress bar or anything saying it is installed or working to install.  \r\n\r\nNow, however, I believe I have set up all of the updates for VS and when I go to start a new project webpage I can see the typescript.  \r\n\r\nMy question is how do I know if I have it installed and if so how can I check the version? I just installed VS today.  ",
    "LastUpdatedDate": "2013-02-14T16:17:00.203-08:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "typescript",
    "ReportedDate": "2013-02-06T13:42:52.22-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "TypeScript 8.2.0 Installer just seems to Just sit there",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 705
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "- Have you tried restarting your system?\n\n- Do you have administrator rights? They are required for installing the TypeScript extension.\n\n- Go to `Tools/Extension and Updates` in VS in order to see the installed extensions.\n\nIf you have installed the extension correctly, there will still be the possibility that it isn't installed yet ;)\nFollow the instructions described here for manual installation (**very easy**): http://stackoverflow.com/a/12687882/603003\n",
      "PostedDate": "2013-02-07T07:40:24.103-08:00",
      "Id": 88834
    },
    {
      "Message": "In addition to the previous comments, make sure you did not miss a UAC prompt that the installer is waiting on before proceeding. Assuming none of those things fix your issue, could you specify which versions of Windows and Visual Studio you're using?",
      "PostedDate": "2013-02-07T15:30:59.367-08:00",
      "Id": 88887
    }
  ]
}