{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "Thanks for logging this issue. We've moved to a new codebase on GitHub; please try your issue against the new compiler (once possible) and log an issue on the GitHub site if it still reproduces.",
    "ClosedDate": "2014-07-21T13:35:17.88-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "There is a bug/inconsistency in the Visual Studio Add TypeScript feature where it doesn't properly handle periods in the file name unless you explicitly enter .ts or .d.ts.  This is in VS 2013 RTM with TypeScript 0.9.1.1.\r\n\r\nRepro:\r\nIn a TypeScript project, right-click... Add... TypeScript File\r\nPut a name with a period such as apple.orange\r\nSince I said I was adding a TypeScript file, I would expect it to generate apple.orange.ts.\r\nInstead, it adds apple.ts.\r\n\r\nIf you enter apple.orange.ts in the field, it works as expected.\r\n\r\nIf I add a new JavaScript file and type \"apple.grape\", it creates a file with exactly that name \"apple.grape\" (though it is still missing the \".js\") - this is better because at least it doesn't truncate my entry.\r\n\r\nIf you're expecting the user to include the \".ts\", then \".ts\" should be prepopulated in the input box (such as when .cs is there when adding a C# class to a C# project).  You don't necessarily have to prevent the user from doing the wrong thing or force them to use .ts, but I don't think that the file name should be truncated either if they want a period in the name.\r\n",
    "LastUpdatedDate": "2017-11-27T11:51:34.217-08:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "typescript",
    "ReportedDate": "2013-10-20T08:29:51.823-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "External"
    },
    "Summary": "Bug/Inconsistency in VS Add TypeScript File with period",
    "Type": {
      "Name": "Unassigned",
      "Id": 5
    },
    "VoteCount": 3,
    "Id": 1814
  },
  "FileAttachments": [],
  "Comments": []
}