{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "Fixed in develop branch",
    "ClosedDate": "2013-06-13T11:23:28.32-07:00",
    "CommentCount": 6,
    "Custom": null,
    "Description": "normal msi install not possible. Error message => there is a problem with the windows installer package....\r\n\r\nSo I did a elevated command line install : \r\nMsiexec /a <path> \r\n showed me install succeeded.\r\n\r\nbut there are  no template in vs 2012 and it does not show in extension from vs nor in installed programmes.\r\n\r\nI added the install.log \r\nany clues ? ",
    "LastUpdatedDate": "2014-01-10T10:34:33.287-08:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "typescript",
    "ReportedDate": "2013-04-03T06:48:26.793-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "succeeded  install TypeScriptSetup.0.8.3.1 but still no templates",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 2,
    "Id": 864
  },
  "FileAttachments": [
    {
      "FileId": 650084,
      "FileName": "typescriptinstall.log",
      "DownloadUrl": ".\\650084"
    },
    {
      "FileId": 650468,
      "FileName": "uninstalldialog.png",
      "DownloadUrl": ".\\650468"
    }
  ],
  "Comments": [
    {
      "Message": "Looking in the log file, it appears to complete successfully.  Are you running one of the supported versions of Visual Studio (either Web Express, Pro, Premium, or Ultimate - not Windows Desktop, Windows 8 or Phone Express SKUs).  If you install the MSI without Visual Studio, or with one of the unsupported versions, we will still install the command-line TypeScript tools, but not the VS support.\n\nIf that is fine, can you detail for me any \"unusual\" setup on your box.  Looks like you have Program Files installed on your E: drive.  Is that correct?  Anything else that may deviate for a completely run-of-the-mill install?\n\nIt also appears from the log that the product was already installed.  If everything else looks good, I'd suggest uninstalling from Add/Remove programs, then manually searching for any \"typescript*\" files or folders possibly left around by older installs, deleting these, and reinstalling.\n\nPlease reopen if none of the above addresses the issue.  Thanks!",
      "PostedDate": "2013-04-03T11:27:40.397-07:00",
      "Id": 95769
    },
    {
      "Message": "\n\r\n\r** Closed by billti 04/03/2013 11:27AM",
      "PostedDate": "2013-04-03T11:27:45.593-07:00",
      "Id": 95779
    },
    {
      "Message": "thanks billti for the swift reply\r\n\r\nmy box : windows 8 64bit  ;vs 2012 ultimate version 11.0.51106.01 update 1 ; location C:\\Program Files (x86)\\Microsoft Visual Studio 11.0\r\nSo it is not on e:\\\r\nBut indeed I noticed indeed a install at E:\\Microsoft SDKs\\TypeScript  of tsc.exe ...en more  \r\nBut no templates on e:\\  but that is no suprise I think.\r\nAnyways uninstall does not work, the msi does not see a installation.\r\nI  added png dialog message. \r\nMy observations:\r\nIs there a explanation why a simple direct install is not possible? This is the reason I use a admin cmd box and perhaps there is a need to specify a target directory in this case? \r\nI looked add a install video and there was a need for license confirmation, in my case the dialog did not appear.\r\nAny ideas ? \r\n\r\n",
      "PostedDate": "2013-04-03T13:08:17.583-07:00",
      "Id": 95784
    },
    {
      "Message": "It is strange that tsc.exe is ending up on E:\\ I will try to see if I can reproduce this myself.\n\nIs there a reason you need to do uninstall from the command line? Is Typescript not visible in Add/Remove Programs (as the error would suggest)?\n\nBy direct installation do you mean choosing an install path? It should support other normal msiexec command line options (like quiet, norestart, etc).\n\r\n\r** Closed by danquirk 04/04/2013 1:58PM",
      "PostedDate": "2013-04-04T13:58:34.763-07:00",
      "Id": 95950
    },
    {
      "Message": "I think I have repro'd your issue. It looks like it's related to using msiexec /a. It shouldn't be necessary to pass that flag to get the MSI working correctly. We'll take a look though.",
      "PostedDate": "2013-04-04T19:29:57.417-07:00",
      "Id": 95955
    },
    {
      "Message": "thanks for you reply. fine you can reproduce the error.( do you mean that you also have the target directory change on you ? ) \nI wil try to answer your question: \n__is there a reason you need to do uninstall from the command line?__ \nthe same reason as the direct install does not work (repeated the text here  from above \n_normal msi install not possible. Error message => there is a problem with the windows installer package.... \n\nSo I did a elevated command line install : \nMsiexec /a <path> \nshowed me install succeeded.__ \n\n__Is Typescript not visible in Add/Remove Programs (as the error would suggest)?__\ncorrect . \n__By direct installation do you mean choosing an install path?__ \nNo, I mean install directly double clicking on the executable .exe in de explorer.  The preferred method, but this give the above error message. when I google this error message brings me to \nhttp://www.java.com/en/download/help/error_1722.xml\nI suspected permission issue so that is the reason I used the elevated command line and the Msiexec /a \nthis does give me screen install succeeded. \n\nMy questions :  \n\nwhat is the best way Remove any traces of the failed installation ? (will reinstall with uninstall monitor the Msiexec way work ? )\nhow can I do the install the Msiexec way without having the target directory change on me ? \n",
      "PostedDate": "2013-04-05T14:25:08.867-07:00",
      "Id": 96047
    }
  ]
}