{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "Fixed here: https://typescript.codeplex.com/SourceControl/changeset/586334bb218f9505495a413b79661451092364e3\n\nWe'll get a hotfix out for this shortly.",
    "ClosedDate": "2013-06-28T11:55:28.777-07:00",
    "CommentCount": 6,
    "Custom": null,
    "Description": "New with v0.9.0\r\n\r\nIf inside the Typescript file there are umlauts in comments, the compiler does not do its job. It always gives back.\r\n\r\n```\r\nerror TS5004: Could not find file: '....ts'.\r\n```\r\n\r\nUmlauts are special characters here in Germany. I guess the problem might also appear with other special characters from other countries.\r\n\r\nI tried by storing the Typescript file as ANSI and as UTF-8, both did not work.\r\n\r\nI tried by compiling  from withing Web Essentials and from the command line, both did not work.",
    "LastUpdatedDate": "2014-01-10T10:34:33.287-08:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "typescript",
    "ReportedDate": "2013-06-19T23:20:45.94-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Fixed"
    },
    "Summary": "Compiler does not find file if it contains umlauts",
    "Type": {
      "Name": "Unassigned",
      "Id": 5
    },
    "VoteCount": 7,
    "Id": 1186
  },
  "FileAttachments": [
    {
      "FileId": 695208,
      "FileName": "test.ts",
      "DownloadUrl": ".\\695208"
    }
  ],
  "Comments": [
    {
      "Message": "Correction: if the file is saved as UTF-8, it can be compiled.\n\nNevertheless, also ANSI has worked in the past.",
      "PostedDate": "2013-06-19T23:34:46.063-07:00",
      "Id": 103572
    },
    {
      "Message": "I know you guys just closed a similar bug report, but you really need to fix this issue as it's a major regression. I had a file with the non-ASCII double quotes in it (forward and rear facing) and as of 0.9 the compiler suddenly says it \"can't find the file\", with no indication of what the real error was. It took me 30 minutes of stripping the file away piece by piece only to realize the issue was a few offending characters.",
      "PostedDate": "2013-06-20T06:46:04.983-07:00",
      "Id": 103609
    },
    {
      "Message": "I have the same problem with \"czech\" letters (Win-1250).\r\nWorkaround is saving file with enconding utf-8 with signature (meaning byte order mask).\r\n\r\nWhen there is a byte order mask (signature), csc loads file as UTF-8.\r\nWhen there is NO byte order mask, csc loads file with encoding depending on windows culture (czech windows means win-1250, english windows means Latin1 (afaik)). So it is not a good idea to have files with no byte order mask in multilingual envinronment.\r\n\r\nIn tsc this behavior is different. Tsc usually works with utf-8 with signature encoding, but causes this error with \"special\" characters in comments in files with no signature.\r\n\r\n",
      "PostedDate": "2013-06-20T06:54:28.277-07:00",
      "Id": 103612
    },
    {
      "Message": "Thanks for the report, marking as active so all these issues get a look.",
      "PostedDate": "2013-06-20T19:26:00.243-07:00",
      "Id": 103736
    },
    {
      "Message": "I had the same problem but it was also due to a syntax error. \n\nOnce replaced all the NO ANSSI char, I had some array declaration like\nstring[] a = new string[];\nwhich gave me error.\n\nReplaced the declaration with\nstring[] a = new Array<string>();\n\nthe problem has been solved.",
      "PostedDate": "2013-06-21T00:52:12.133-07:00",
      "Id": 103754
    },
    {
      "Message": "FYI: See http://blogs.msdn.com/b/typescript/archive/2013/06/28/announcing-typescript-0-9-0-1.aspx .  This improves the error handling in this situation.",
      "PostedDate": "2013-06-28T17:23:52.34-07:00",
      "Id": 104614
    }
  ]
}