{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "Closing this as 'Need More Info' for tracking purposes. Just re-open the issue with additional details when you have it and we'll see it pop back up.",
    "ClosedDate": "2013-11-13T18:34:58.913-08:00",
    "CommentCount": 2,
    "Custom": null,
    "Description": "For some reason, even though \"require source files to exactly match\" is enabled in the VS 2012 options, the source stepping while debugging for TypeScript is not always in sync (i.e. the highlighting doesn't match the code while stepping through).  To resolve this, I have to keep restarting the IDE.\r\n\r\nThis issue doesn't happen all the time, just after awhile of development using VS 2012.  It seems to happen in almost every case where I accidentally update and save the source while forgetting the web app is still running in the browser (while debugging).  When I stop debugging, and attempt to rebuild, the old map file seems to keep getting used by the debugger - even if I modify and save in attempts to force it to update.",
    "LastUpdatedDate": "2013-11-13T18:34:58.913-08:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "typescript",
    "ReportedDate": "2013-11-11T10:28:00.247-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Need More Info"
    },
    "Summary": "Visual Studio Source Stepping Out Of Sync",
    "Type": {
      "Name": "Unassigned",
      "Id": 5
    },
    "VoteCount": 1,
    "Id": 1886
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Thanks.  We do have some issues where compile on save would stop working.  Are you able to verify that when this problem occurs, that when you save the source file the .map is getting regenerated?  Or does it appear the .map and .js are definitely getting rebuilt, but Visual Studio is still somehow holding on to stale data in memory?\n\nCould you also please confirm if you are using a full project build, or depending on 'compile on save' for building the TypeScript sources.\n\nPlease also let us know how this project is created and what you are debugging in (i.e. did you create a new TypeScript project from a template and are launching from VS and debugging in IE?  Or do you have a custom project, are attaching to process, etc....).  If there is anything specific to your project that might be helpful to us reproducing this problem, it would be great if you can attach any files to this issue.\n\nThanks.",
      "PostedDate": "2013-11-12T11:12:06.223-08:00",
      "Id": 122784
    },
    {
      "Message": "Ok, I'll look into this further ;) ...",
      "PostedDate": "2013-11-12T14:50:20.253-08:00",
      "Id": 122828
    }
  ]
}