{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "Please re-open when you're able to attach that file.",
    "ClosedDate": "2014-02-17T12:01:51.677-08:00",
    "CommentCount": 1,
    "Custom": null,
    "Description": "After I install 0.9.5 version of the Visual Studio plugin from [here](http://www.microsoft.com/en-us/download/details.aspx?id=34790), Visual Studio itself cannot be started. The only message displayed states \"exception thrown by the target of an invocation\" and it shuts down even before the main window loads.\r\n\r\nI have tried mounting the plugin to a few different versions of the IDE: \r\n- 2012 Ultimate Update 2\r\n- 2012 Ultimate Update 4\r\n- 2013 Ultimate\r\n- 2013 Ultimate Update 1\r\nwith the final result more or less the same. The error message was slightly different with VS 2012 where it first displayed warnings about missing MRU module before crashing on the same error.\r\n\r\nThe plugin installer completes smoothly and I can see the TypeScript folder in \"C:\\Program Files (x86)\\Microsoft SDKs\". Until I uninstall the plugin, it is not possible to start either VS 2012 or 2013.\r\n\r\nCould it be that there are some components missing on machine or maybe there are \"too many\" of them, which causes a conflict?  Just to give a hint I recall I had trouble getting Python Tools for VS 2012 to work with VS 2010 installed. Uninstalling VS2010 fixed the issue at that time. But now I have only 2012 and 2013 on my machine. Or maybe it's registry-related?\r\n\r\nI'd appreciate any help as for now I'm effectively not able to use typescript at all. If you need additional information on this issue, feel free to say.",
    "LastUpdatedDate": "2014-02-17T12:01:51.677-08:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "typescript",
    "ReportedDate": "2014-02-08T11:29:18.557-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Need More Info"
    },
    "Summary": "After installing VS plugin it stops working ",
    "Type": {
      "Name": "Unassigned",
      "Id": 5
    },
    "VoteCount": 1,
    "Id": 2160
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Can you upload your ActivityLog.xml file? This should help us diagnose the issue. See instructions here: http://msdn.microsoft.com/en-us/library/ms241272.aspx\n\nThanks!",
      "PostedDate": "2014-02-10T12:47:27.757-08:00",
      "Id": 133140
    }
  ]
}