{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "As part of our move to GitHub, we're closing our CodePlex suggestions and asking that people move them to the GitHub issue tracker for further discussion.  Some feature requests may already be active on GitHub, so please make sure to look for an existing issue before filing a new one.\n\nYou can find our GitHub issue tracker here:\nhttps://github.com/microsoft/typeScript/issues\n",
    "ClosedDate": "2014-07-28T15:18:40.973-07:00",
    "CommentCount": 3,
    "Custom": null,
    "Description": "There is currently no way to change the name of the JavaScript file generated by tsc.exe except for the --out parameter. However, when you use this parameter, tsc assumes you are generating a single output file from all of your TypeScript sources, and changes the behavior of <reference> to physically include the JavaScript from the referenced file in the generated JavaScript file.\r\n\r\nI need a way to just change the naming of the generated JavaScript files without changing the behavior of the compiler. The default file naming behavior (foo.ts -> foo.js) is hostile to source control, because it prevents us from excluding only generated JavaScript files via .gitignore. We want the generated files to be named (for example) foo.ts.js to make this possible.",
    "LastUpdatedDate": "2017-11-27T11:51:33.707-08:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "typescript",
    "ReportedDate": "2013-08-15T08:43:51.117-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "External"
    },
    "Summary": "Allow a way to specify ts -> js name when compiling",
    "Type": {
      "Name": "Unassigned",
      "Id": 5
    },
    "VoteCount": 3,
    "Id": 1514
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "For various reasons, putting the generated files in a separate directory is not a good solution for us. We are already working around this issue by using MSBuild to rename the generated .js files. The problem with this is that source map generation embeds the original filenames generated by tsc in the source map.\n\nWe are also using the Microsoft Ajax Minifier, and it has a simple and elegant solution for specifying the way generated files are named. You might want to take a look at that.",
      "PostedDate": "2013-08-15T11:33:29.007-07:00",
      "Id": 110053
    },
    {
      "Message": "You can use the --outDir to place the .js files wherever you want, then rename them in your build system as you see fit. We're not going to support arbitrary name generation functions from tsc.\n\r\n\r** Closed by RyanCavanaugh 08/15/2013 9:15AM",
      "PostedDate": "2013-08-15T09:15:01.243-07:00",
      "Id": 110054
    },
    {
      "Message": "Changing title, marking as suggestion.",
      "PostedDate": "2013-08-15T11:58:55.187-07:00",
      "Id": 110063
    }
  ]
}