{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "Please reactivate if you're still seeing this on the 1.0 build. Thanks!",
    "ClosedDate": "2014-04-03T14:19:59.58-07:00",
    "CommentCount": 17,
    "Custom": null,
    "Description": "Since installing VS2013 and latest Typescript RC, Intellisense is not working for me at all . The weird thing is my colleagues have the same version of VS2013 and TS and extensions and works on the same solution and project/test project, and for them it works. \r\n\r\nIf I create a new project, instellisense works again...\r\n\r\nWe've tried uninstalling and removing all the extensions to VS and then reinstalling VS2013 and reinstalling Typescript RC, but it still doesn't work.  \r\n\r\nIt's basically the same problem as this:\r\n\r\nhttp://typescript.codeplex.com/workitem/24\r\n\r\n",
    "LastUpdatedDate": "2014-10-02T01:49:40.353-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "typescript",
    "ReportedDate": "2014-03-07T05:34:03.843-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Need More Info"
    },
    "Summary": "Intellisense stopped working ",
    "Type": {
      "Name": "Unassigned",
      "Id": 5
    },
    "VoteCount": 9,
    "Id": 2273
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "I Have the same problem!",
      "PostedDate": "2014-03-07T08:03:38.377-08:00",
      "Id": 136180
    },
    {
      "Message": "I found the solution for me at least: \n\nAppearantly I had installed an extension called \"Typescript Jasmine Tests\", from \"Ronnie Hegelund\". When I removed it, everything worked again...\n\nI thought I needed it to run the jasmine tests, but I didn't...",
      "PostedDate": "2014-03-07T08:26:34.797-08:00",
      "Id": 136186
    },
    {
      "Message": "I've experienced the same problem. To reproduce:\n\nI've got a small project containing only some ts files. My config is vs2013. No updates installed. (I had update 1 installed before), Typescript version RC1.0\n\nWhen I choose the option \"Combine Javascript output into file ...\", after the first build my intellisense is gone.\nThen when I restart vs2013, it still is gone.\nAfter I uncheck, the option to \"Combine javascript output into file\", restart vs once more, it again seems working fine again ...\na pitty, cause I really need the output option ;-(\n",
      "PostedDate": "2014-03-09T09:25:30.54-07:00",
      "Id": 136329
    },
    {
      "Message": "I gave in ... uninstalled 1.0rc and installed 0.9.5 ... all works fine. Cant enjoy the new 0.9.7 release though ... hopefully this issue will be adressed.",
      "PostedDate": "2014-03-09T10:07:21.27-07:00",
      "Id": 136331
    },
    {
      "Message": "I have tried with VS 2012 and the problem still remaining...\n",
      "PostedDate": "2014-03-10T00:49:21.497-07:00",
      "Id": 136362
    },
    {
      "Message": "Is there anything else about the affected projects you're able to share? Or is this all projects? I cannot reproduce what Paul0515 is seeing with a simple project.",
      "PostedDate": "2014-03-10T14:39:27.317-07:00",
      "Id": 136441
    },
    {
      "Message": "I had the same problem as mentioned from Paul0515. I created my project with version 0.9.1.1. I moved to 1.0RC. After that Intellisense, Find all referenced, Go to definition etc. does not work any more. I uninstalled 1.0RC and installed 0.9.5. After that it worked fine again.",
      "PostedDate": "2014-03-12T02:30:29.483-07:00",
      "Id": 136593
    },
    {
      "Message": "We have the same issue when using \"Combine javascript output into file\" on VS Express 2013 and TS RC1.",
      "PostedDate": "2014-03-12T02:52:54.893-07:00",
      "Id": 136595
    },
    {
      "Message": "Same problem here.  Using VS2012 upgraded the plugin from 0.9.1.1 to 1.0RC and now no intellisense.  I cannot get it to work at all even on new projects. ",
      "PostedDate": "2014-03-13T08:05:40.023-07:00",
      "Id": 136749
    },
    {
      "Message": "Just to update on this. I'm pretty sure its to do with this option\n\n<TypeScriptOutFile>app.js</TypeScriptOutFile>\n\nIf I remove this option from my project file, restart VS and build intellisense works fine.  However if I turn it back on an build all my intellisense vanishes.  I have tried this multiple times and every time the same thing happens. ",
      "PostedDate": "2014-03-13T08:28:54.62-07:00",
      "Id": 136752
    },
    {
      "Message": "Workaround: \n\n1. Turn of the option in your project to compile to a single file. \n2. Add a new pre-build evtn step which does the compilation for you externally.  Mine looks like this \n\n\"C:\\Program Files (x86)\\Microsoft SDKs\\TypeScript\\0.9\\tsc.exe\" $(ProjectDir)app\\app.ts --out $(ProjectDir)app.js --sourcemap\n\nRestart visual studio. \n\nFYI errors that occur in the extenal build can be double clicked on to get to the source file and line that is in error.  \n\nUntil its fixed hope this helps. ",
      "PostedDate": "2014-03-13T10:18:12.673-07:00",
      "Id": 136756
    },
    {
      "Message": "I logged http://typescript.codeplex.com/workitem/2330 about the same issue yesterday and danquirk asked me to attach my project. Well I can recreate this with the template project Visual Studio creates with the Greeter class. Just changed the project to Single JS output and tried to open app.ts. Intellisense doesn't work.",
      "PostedDate": "2014-03-18T05:05:24.98-07:00",
      "Id": 137194
    },
    {
      "Message": "Can be also triggered by TypeScriptOutDir",
      "PostedDate": "2014-03-23T13:22:57.427-07:00",
      "Id": 137683
    },
    {
      "Message": "I was able to workaround this bug with an awful hack at the end of csproj after import of typescript targets:\n\n```xml\n<Target Name=\"AwfulTscHack\" BeforeTargets=\"CompileTypeScript\">\n    <PropertyGroup>\n      <TypeScriptOutDir>gen</TypeScriptOutDir>\n      <TypeScriptBuildConfigurations Condition=\"'$(TypeScriptOutDir)' != ''\">$(TypeScriptBuildConfigurations) --outDir &quot;$(TypeScriptOutDir)&quot;</TypeScriptBuildConfigurations>\n    </PropertyGroup>\n  </Target>\n```\n\nAdjust for other compiler options as necessary (see `C:\\Program Files (x86)\\MSBuild\\Microsoft\\VisualStudio\\v12.0\\TypeScript\\Microsoft.TypeScript.targets`)",
      "PostedDate": "2014-03-23T13:45:19.253-07:00",
      "Id": 137687
    },
    {
      "Message": "Sadly it doesn't work with compile-on-save.",
      "PostedDate": "2014-03-23T13:52:24.06-07:00",
      "Id": 137688
    },
    {
      "Message": "Has this bug been fixed? I am confused why this has been closed? ",
      "PostedDate": "2014-04-15T05:16:29.167-07:00",
      "Id": 141930
    },
    {
      "Message": "For me, this was solved by de-installing the MySQL Visual Studio Integration which I had installed. \nThere are more reports here about visual studio extensions messing up TypeScript code completion: \nhttps://typescript.codeplex.com/workitem/24",
      "PostedDate": "2014-10-02T01:49:40.353-07:00",
      "Id": 161260
    }
  ]
}