{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "Please re-open this if you're still seeing issues. As far as I can tell from the descriptions here the symptoms here (crashing on project open) are the result of a known issue in the version of Web Essentials currently on the VS Online Gallery. If anyone is having this issue and does not have Web Essentials installed do re-open this (or file a new issue) and make that clear. ",
    "ClosedDate": "2014-03-26T17:32:10.933-07:00",
    "CommentCount": 10,
    "Custom": null,
    "Description": "\r\nI have been using Typescript for some time and today I upgraded from 9.0.1 to the RC downloadable from typescriptlang. When craeting a new Typescript project vs crashes.\r\n\r\nIf I try running tsc from command line i get \"Cannot initialize ActiveScript\" and wonder if that is why VS crashes also.\r\n\r\n\r\nWonder if its a known issue or its just something related to my machine.",
    "LastUpdatedDate": "2014-03-26T17:32:10.933-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "typescript",
    "ReportedDate": "2014-03-22T05:45:16.103-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Need More Info"
    },
    "Summary": "Typescript RC Crashes visual studio 2013.1 ",
    "Type": {
      "Name": "Unassigned",
      "Id": 5
    },
    "VoteCount": 4,
    "Id": 2348
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "The \"cannot initialize activescript\" was resolved uninstalling the old version. (somehow I had both RC and 9.0.1 installed.\n\nVisual studio still crashes.\nI tried uninstalling RC and installed 9.0.1.1 again and then visual studio still crashes also. So somehow I got VS broken by installing the RC in the first place :(\n\n",
      "PostedDate": "2014-03-22T06:11:28.497-07:00",
      "Id": 137637
    },
    {
      "Message": "I uninstalled typescript and installed update 2 CTP for visual studio and everything works as i wanted. Not sure if the RC do not work with 2013.1.",
      "PostedDate": "2014-03-22T07:21:47.493-07:00",
      "Id": 137638
    },
    {
      "Message": "Same thing happened with me.\n\nTypeScript RC also crashes Visual Studio 2013 Ultimate with Update 1 applied.\n\nHere's two ways that I've found to repro:\n\n1) create a new project > Other Languages > TypeScript > HTML Application with TypeScript\n           Project creates successfully, however Visual Studio opens TypeScript .ts file and immediately crashes\n\n2) create a new project > Visual C# > Windows > Class Library, then add a new item > TypeScript File\n          Immediate crash\n\n\nAlso note: I've tried completely uninstalling and reinstalling TypeScript RC, but no effect.           \n\n ",
      "PostedDate": "2014-03-24T07:58:02.003-07:00",
      "Id": 138091
    },
    {
      "Message": "@pksorensen - What version of IE are you running?  Some releases require IE10 or above.",
      "PostedDate": "2014-03-24T08:38:39.577-07:00",
      "Id": 138099
    },
    {
      "Message": "Do any of you have any Visual Studio extensions installed (Web Essentials, Resharper, etc)?",
      "PostedDate": "2014-03-24T08:56:24.61-07:00",
      "Id": 138106
    },
    {
      "Message": "I got this too. Basically, if you have a project with TypeScript files from previous versions of TypeScript and you try to open those files with the new version of TypeScript, Visual Studio crashes hard.\n\nHere's how I fixed it.\n\nOpen the project.\nAdd a new TypeScript file. This will cause VS to configure your project for TS files.\nDelete the TS file.\nOpen your \"old\" TS files. VS shouldn't crash now.\n\nOld versions of TS associated the JS files with the TS files. What I did to update to the new way was to delete both, then add a new TS file with the same name as the old, then go into my source control and revert the delete of the TS file.",
      "PostedDate": "2014-03-24T10:38:14.483-07:00",
      "Id": 138120
    },
    {
      "Message": "For my case I could not add new files because it crashed right away. Also, I created a new project so it was not due to old files.\n\nBut for now I am running Update 2 of visual studio and dont have any issues.",
      "PostedDate": "2014-03-24T12:24:26.827-07:00",
      "Id": 138131
    },
    {
      "Message": "Yes, have latest version of Web Essentials installed as well...  I will attempt to uninstall it.\nI have IE 11\nTried reverting back to previous version of TypeScript however Visual Studio 2013 (w Update 1) still crashes on new TypeScript project and just adding TypeScript files to an existing project (with no TypeScript there first).\n",
      "PostedDate": "2014-03-24T14:16:19.05-07:00",
      "Id": 138153
    },
    {
      "Message": "The latest version of Web Essentials will cause VS to crash when opening/creating TypeScript projects.",
      "PostedDate": "2014-03-24T16:32:32.24-07:00",
      "Id": 138179
    },
    {
      "Message": "To be clear, by latest I mean what's in the VS Extensions Online Gallery. The latest nightly build of Web Essentials should not have this issue.",
      "PostedDate": "2014-03-24T18:49:38.117-07:00",
      "Id": 138188
    }
  ]
}