{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "",
    "ClosedDate": "2013-07-02T14:07:33.567-07:00",
    "CommentCount": 2,
    "Custom": null,
    "Description": "> problems with VS integration makes 0.9.0.1 hard to use:\r\n\r\nwith a largish project, here are my issues:\r\n1. Loss of intellisence when errors occur (autocomplete no longer works)\r\n1. Fixed errors perist in the error list, Project-Build confirms the errors are actually resolved\r\n\r\nif i restart visual studio, the behavior improves, but quickly degrades with use.\r\n\r\nsee attached screenshot\r\n",
    "LastUpdatedDate": "2013-07-02T14:07:33.567-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "typescript",
    "ReportedDate": "2013-07-01T23:58:10.527-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Need More Info"
    },
    "Summary": "VS plugin bugs: (ghost errors, loose intellisence)",
    "Type": {
      "Name": "Unassigned",
      "Id": 5
    },
    "VoteCount": 2,
    "Id": 1291
  },
  "FileAttachments": [
    {
      "FileId": 698415,
      "FileName": "0.9.0.1-errors.png",
      "DownloadUrl": ".\\698415"
    }
  ],
  "Comments": [
    {
      "Message": "#2 has been there ever since early 0.9 beta, but is still here.  The only solution is to close the TS file and reopen it.  Then the phantom errors no longer show up.\n\nIt almost always happens then a referenced definitions file was fixed (but obviously the current file in the editor doesn't know about it), but there are many cases where it happens when code was fixed inside the editor and the red squiggles won't go away.  There are definitely problems with incremental checking...\n\n",
      "PostedDate": "2013-07-02T03:42:12.777-07:00",
      "Id": 104844
    },
    {
      "Message": "Thanks. We did have some issues with the error list not refreshing that we addressed recently, so if you have a specific repro I can check if this is still a problem in the latest bits.\n\nOne issue we do still have is detecting cross file changes.  We are working on getting this fixed currently.  For now the workaround is to edit the current file that is consuming the changed file ( simply cut/paste the references tags or imports statements at the top should do it).\n\nFor the loss of intellisense, this generally means you have some code in the editor which is crashing the compiler.  Trying to compile the same content at the \"tsc\" command-line should show this.  We'd be very interested in seeing the code you have which is causing this to occur.  \n\nPlease reopen with further details if you are able to provide the code causing intellisense to stop, or if you have a non-cross file repro for the error list not refreshing.  Thanks!",
      "PostedDate": "2013-07-02T14:07:27.233-07:00",
      "Id": 104923
    }
  ]
}