{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "As part of our move to GitHub, we're closing our CodePlex suggestions and asking that people move them to the GitHub issue tracker for further discussion.  Some feature requests may already be active on GitHub, so please make sure to look for an existing issue before filing a new one.\n\nYou can find our GitHub issue tracker here:\nhttps://github.com/microsoft/typeScript/issues\n",
    "ClosedDate": "2014-07-28T15:18:41.3-07:00",
    "CommentCount": 2,
    "Custom": null,
    "Description": "On multiple occasions I spent large amounts of time debugging compilation issues that turned out to be because of simple syntactical errors in the reference comment.\r\n```\r\n/// <reference path=\"foo/bar.ts\">\r\n```\r\nThe error could be as simple as leaving out the ending double-quote or the angle bracket. The compiler should print an error if the reference comment is not valid.\r\n\r\nWhich leads to the question... why is the reference a comment instead of a normal part of the language, just like \"using\" in C# or \"import\" in Java?\r\n",
    "LastUpdatedDate": "2017-11-27T11:51:33.707-08:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "typescript",
    "ReportedDate": "2013-10-26T14:23:18.92-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "External"
    },
    "Summary": "reference comment should be validated",
    "Type": {
      "Name": "Unassigned",
      "Id": 5
    },
    "VoteCount": 1,
    "Id": 1842
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "I'm not sure how we would detect an invalid reference comment. For example, which of these (if any) are errors?\r\n\r\n```\r\n// <reference path=\"foo.ts\"/ >\r\n/// This is a reference to foo.ts\r\n/// Don't reference x unless it's > 5\r\n/// <references>\r\n```",
      "PostedDate": "2013-10-28T10:59:31.62-07:00",
      "Id": 119874
    },
    {
      "Message": "Ryan, that's the reason reference should be a statement, as opposed to a comment. Just like the using statement in C# and import statement of Java, the reference statement in Typescript should look like this:\n```\nreference \"foo.ts\";\n```\nSince Typescript 1.0 is not out yet it may not be too late to make this change.\n\nBut if we are stuck with reference comments then we have to guess the programmer's intention in order to validate the reference comment. If the line starts with \"/// <reference\" then it is fairly safe to assume the programmer intended to type a reference comment. Most of the typos I have seen come after this part, so the compiler will be able to catch almost all typos. ",
      "PostedDate": "2013-10-28T19:48:08.95-07:00",
      "Id": 119980
    }
  ]
}