{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "",
    "ClosedDate": null,
    "CommentCount": 7,
    "Custom": null,
    "Description": "This issue was addressed back in 2014 but does not seem to be solved correctly.\r\n\r\nhttps://typescript.codeplex.com/workitem/2477\r\n\r\nWhen debugging in visual studio a \"dynamic\" version of the typescript file is opened, but it is incorrect, old, has been updated. Yet the dynamic version is where the break point is hit.\r\n\r\nI've tried \"Build-Clean project\".  Showing the hidden files (*.js and *.js.map)  in solution explorer and deleting them before rebuilding which should (and does) recreate the files.  Yet still for some reason a cached file remains and this is what is being used.\r\n\r\nEDIT - workaround - Restarting Visual studio, results in the correct files loading... sometimes.  Sometimes you have to restart numerous times and of course many times per day.",
    "LastUpdatedDate": "2016-09-14T12:28:10.287-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "typescript",
    "ReportedDate": "2016-09-14T09:03:22.043-07:00",
    "Status": {
      "Name": "Proposed",
      "Id": 1
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "Visual studio 2013 Ultimate Update 5 using wrong dynamic TS files",
    "Type": {
      "Name": "Unassigned",
      "Id": 5
    },
    "VoteCount": 1,
    "Id": 2675
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Have you tried clearing your browser cache?",
      "PostedDate": "2016-09-14T10:01:44.467-07:00",
      "Id": 204072
    },
    {
      "Message": "it is a visual studio issue.  Typescript files are not used in the browser only JS files.  The problem is that when debugging Visual Studio sometimes loads some old bogus file and calls it \"dynamic\" rather than the current one.  Please see the original problem.  There is a good video explaining it.\n",
      "PostedDate": "2016-09-14T10:39:51.16-07:00",
      "Id": 204073
    },
    {
      "Message": "My thought wasn't on the .ts file, it was on the map file that is used to locate the .ts (source) file, and if the map file was cached, it might that the .ts file pulled also get's cached.  It was just a long shot. ;)",
      "PostedDate": "2016-09-14T11:20:52.403-07:00",
      "Id": 204074
    },
    {
      "Message": "Instead of restarting VS, try stopping IIS Express via the system/status tray instead, then retry, and see if that does anything.",
      "PostedDate": "2016-09-14T11:39:10.777-07:00",
      "Id": 204075
    },
    {
      "Message": "I've tried that as well, it is definitely a problem with Visual studio.  If before you begin any debug session you have the TS window you want open and set a breakpoint, it will break correctly.  If then you step through to the code of a second file, then it loads some bogus version.  Once it happens, it always seems to load the same bogus file when debugging until visual studio is restarted.",
      "PostedDate": "2016-09-14T12:18:19.35-07:00",
      "Id": 204077
    },
    {
      "Message": "@jamesnw, I didn't see your earlier comment.  I physically delete both the .js and the .js.map files.  There are gone, so when recompiling they are created again new.  Yet when you start the debug session (like the comment above), the same bogus file is loaded.  It has to be cached in VS memory somewhere.",
      "PostedDate": "2016-09-14T12:20:52.243-07:00",
      "Id": 204078
    },
    {
      "Message": "Just a side note that you might get more responses posting in the new location to where the team has moved to: https://github.com/Microsoft/TypeScript\n\n;)",
      "PostedDate": "2016-09-14T12:28:10.287-07:00",
      "Id": 204079
    }
  ]
}