{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "",
    "ClosedDate": "2013-04-23T20:16:52.517-07:00",
    "CommentCount": 1,
    "Custom": null,
    "Description": "I'm currently running 0.8.1.1 and am experiencing following problem (I'm not sure this is fixed in 0.8.3 and can't upgrade at this time).\r\n\r\nWhen I compile a .ts file using the --module AMD flag and there's no export or import statement defined in the file, it won't compile to an AMD module.\r\n\r\nThis is probably a specific use case, but just wanted to point it out.",
    "LastUpdatedDate": "2013-04-23T20:16:52.517-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "typescript",
    "ReportedDate": "2013-04-23T01:18:34.093-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "By Design"
    },
    "Summary": "Can't compile to AMD when no exports are defined",
    "Type": {
      "Name": "Unassigned",
      "Id": 5
    },
    "VoteCount": 1,
    "Id": 939
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Thanks.  I believe this is 'by design', and the same behavior occurs in the under development 0.9 branch.\n\nCurrently we allow you to compile an entire application from one \"tsc\" statement.  What this does (it not using the --out switch to generate one output file), is compile all your non-module files given to straight JavaScript, and all your module files given to whatever module type you specify.  If you don't export or import anything, then it is not considered an external module.\n\nWe are revisiting some of this design, and I believe current PoR is to only emit modules if the --module switch is given, so it may change before release to match your desired behavior.  But currently this is as intended.",
      "PostedDate": "2013-04-23T20:16:43.69-07:00",
      "Id": 98284
    }
  ]
}