{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "If you can provide some files that reproduce this issue without Web Essentials we'd be happy to take a look. We have a number of performance improvements planned for the future. Note that Typescript does support compile on save natively without Web Essentials.",
    "ClosedDate": "2013-06-27T16:36:51.813-07:00",
    "CommentCount": 1,
    "Custom": null,
    "Description": "I have a project of about 20 files/1400 lines (1400 total, 50-100 lines per file) of ts.\r\nWhen I first upgraded from 0.8.2 to 0.9.0 alpha the compile would hang indefinitely. Some research got me to make sure all files are saved in UTF8 encoding.\r\nI can now compile all files with a batch job from the command line, one by one. This is however fairly slow more then 1s per file.\r\n\r\nWhen I load the project in Visual Studio 2012 and save the files one by one from the editor (webessentials compile on save on) they do! compile.\r\n\r\nWith webessentials \"Compile all ts on build\" on, vs kicks off 20 compile jobs and takes all resources on my machine (i5,4gb), I waited for up to 20min for these jobs to finish and then got frustrated and turned the machine off (with the harddisk going, something I hate to do).",
    "LastUpdatedDate": "2013-06-27T16:36:51.813-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "typescript",
    "ReportedDate": "2013-06-26T08:41:02.833-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Need More Info"
    },
    "Summary": "migrating to 0.9.0 : many problems",
    "Type": {
      "Name": "Unassigned",
      "Id": 5
    },
    "VoteCount": 2,
    "Id": 1250
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "I am experiencing the exact same issues.  One thing you can do to at least be able to use Visual Studio is to disable the Web Essentials plugin (or at least the realtime compile option) -- that worked for me.  However, the compiler is still not acting properly, is very slow and memory intense and in the end after a lot of 0.9 language spec changes made it still doesn't compile my code -- results in an error that is a bug in the new compiler.  :-(\n\nI love TypeScript but it probably wasn't wise to release this current compiler/add-in.",
      "PostedDate": "2013-06-26T13:56:56.953-07:00",
      "Id": 104262
    }
  ]
}