{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "Followed up privately. Will re-open when more info is available.",
    "ClosedDate": "2013-10-30T16:15:12.38-07:00",
    "CommentCount": 2,
    "Custom": null,
    "Description": "hello...\r\n\r\nwe are currently using the latest version of TS... 0.9.1.1... we have a rather large solution with many many TS files with many many relationships between those files... the problem we are facing is that the IDE is very unstable when coding in TS... the first time i open the solution and start TS coding, everything is fine... intellisense works great, code formatting commands work great, hovering over code shows correct tooltips, etc... but after a few minutes of coding everything stops working... i literally mean minutes... somewhere between 5 to 10 minutes... intellisense stops working... code formatting commands stop working... tooltips no longer appear... and then the IDE freezes and crashes... right now i basically have to restart the IDE every 5 to 10 minutes... i have a hunch that there's something particular about our solution that's causing this... i am not the only one on our team experiencing these problems... if i had to throw a wild guess out there, i would say things got this bad starting from version 0.9 of TS... back in version 0.8.XXX i don't recall the development experience being this bad... at this point we have so much TS code written that it's going to very difficult for us to stop using TS, and not that we want to either... we love TS... so my question is what can i do on my end to provide info to you guys to help me get closer to a solution to this problem? a VS dump file? or maybe i could send you guys our entire solution somehow? other sorts of log files? i understand this is beta software but we are really in pain right now and anything to help our situation is greatly welcomed... thank you",
    "LastUpdatedDate": "2013-10-30T16:15:12.38-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "typescript",
    "ReportedDate": "2013-10-17T14:04:39.797-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Need More Info"
    },
    "Summary": "how to debug crashes and other TS IDE problems",
    "Type": {
      "Name": "Unassigned",
      "Id": 5
    },
    "VoteCount": 1,
    "Id": 1803
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "thank you paul for your response... sorry for not getting back to you earlier... anyway....\n\nwhenever this happens the memory usage of VS is around 3GB....\n\nwe use alot of generics... we use inheritance but not that deep... 2 or 3 levels... \n\nis there anyway i can email you the code with some notes... zipped up it's a little under 4MB... unfortunately the people here don't want me to upload it unless the upload is only accessible to you guys... if so, my email is giancarlo.aguilera@fox.com... \n\nthanks again",
      "PostedDate": "2013-10-29T09:22:39.527-07:00",
      "Id": 120046
    },
    {
      "Message": "Can you tell me more about the memory and CPU usage of Visual Studio when it stops being response? We've seen a couple of instances where solutions cause an out of memory exception, which sounds a lot like what you're experiencing. \n\nThose solutions all have in common that they use a lot of generics and deep inheritance structures, usually through frameworks like knockout, jquery, linqjs, etc.\n\nIf you can send your sourcecode, upload to skydrive (?), we can open it and how it behaves?\n\nAs noted in todays blogpost [0], our next release is specifically focused on those issues. \n\nClosed for tracking, please re-open using the button on top, when you have more info.\n\n\n[0] http://blogs.msdn.com/b/typescript/archive/2013/10/17/typescript-and-the-road-to-1-0.aspx\n\r\n\r** Closed by paulb 10/17/2013 5:30PM",
      "PostedDate": "2013-10-17T17:30:21.377-07:00",
      "Id": 120047
    }
  ]
}