{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "As part of our move to GitHub, we're closing our CodePlex suggestions and asking that people move them to the GitHub issue tracker for further discussion.  Some feature requests may already be active on GitHub, so please make sure to look for an existing issue before filing a new one.\n\nYou can find our GitHub issue tracker here:\nhttps://github.com/microsoft/typeScript/issues\n",
    "ClosedDate": "2014-07-28T15:18:27.877-07:00",
    "CommentCount": 2,
    "Custom": null,
    "Description": "Could we have a compiler option to output JS in a specified codepage. Right now only UTF-8 codepage js is outputed",
    "LastUpdatedDate": "2017-11-27T11:51:33.707-08:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "typescript",
    "ReportedDate": "2014-03-12T09:39:17.3-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "External"
    },
    "Summary": "Could we have a compiler option to output JS in a specified codepage",
    "Type": {
      "Name": "Unassigned",
      "Id": 5
    },
    "VoteCount": 1,
    "Id": 2305
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Marking as a suggestion, but it'd be great to understand why you want this feature so we can prioritize it appropriately. What's your scenario?",
      "PostedDate": "2014-03-12T11:04:36.253-07:00",
      "Id": 136652
    },
    {
      "Message": "OK, so we are currently trying TypeScript on an existing JavaScript project with file codepages using cp1252 . The database is also in cp1252 and we can't change that at this point of the project so we will keep sources in ANSI. This application only needs to be displayed in french (so we need accents) and target a mobile device with quite low performances so we did not implement internationalization nor externalizing resources to keep it as simple and fast as possible.  We want to output TS compiled JS in a single JavaScript file to avoid multiple http request for each scripts (we have a defect on this too) as this application might be used on a low and unstable bandwidth network. Right now we are manually converting compiled files in ANSI but it would be great if the compiler did that directly. Indeed it is a non-blocking issue and do not need to be treated as a high priority as far as I am concerned. ",
      "PostedDate": "2014-03-13T02:01:07.313-07:00",
      "Id": 136723
    }
  ]
}