{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "Thanks for looking a little deeper. We run in VMs a lot here so that's not an unusual scenario for us, although not specifically with Azure VMs. There are some known issue with single core machines so it's possible the VM was just underpowered.",
    "ClosedDate": "2013-08-29T12:37:13.023-07:00",
    "CommentCount": 1,
    "Custom": null,
    "Description": "With the latest 0.9.1.1 released bits, I am experiencing very bad performance when trying to debug qunit tests that call into my TypeScript-based library.  For example, my test library looks like this:\r\n\r\n```\r\n///<reference path=\"Scripts/typings/qunit/qunit.d.ts\"/>\r\n///<reference path=\"mylibrary.ts\"/>\r\n\r\nQUnit.module(\"My test category\");\r\n    test(\"Test that calls stuff does so successfully.\", function () {\r\n        debugger;\r\n        var a = new MyLibrary.MyClass(\"ParameterValue\");\r\n        a.arrayItem[7].DoSomething(2046);\r\n        strictEqual(a.SomeFunction(), 0.0, \"it worked\");\r\n    });\r\n\r\n```\r\n\r\nOnce the debugger line gets hit, I can usually step at least one line down, but after that my system seems to lock up and will be mostly frozen for several minutes.  Then it comes back and I can end task on IE to get everything working OK again.  I am using TypeScript 0.9.1.1 in VS 2013 preview on the new Azure VM image that was recently released for helping to test this stuff.  This also happens if I set an F9 breakpoint in Visual Studio.  In previous versions this was working at normal speeds and the debugging experience was fine.\r\n\r\nIf I am not debugging, everything seems to work quite well performance-wise, and I wouldn't even call this a performance problem as much as basically a lock-up that seems to eventually resolve itself.  I don't know if this is a TypeScript-specific problem or an issue with the VS2013 preview, but I haven't experienced this issue when using the same machine to step through C# code in an MVC project.  I have also noticed perfwatson running so I believe that you (Microsoft) should be getting some telemetry from these lockups.\r\n\r\nI hope this is easily reproducible for you on the same Azure VM image.  In Azure you have to go to new... Compute... Virtual Machine... From Gallery and pick the Visual Studio Ultimate 2013 Preview and you will have exactly the same setup I do.\r\n\r\n\r\nFor reference, the calling HTML page looks like this, and I am using the latest qUnit (1.12):\r\n```\r\n<!DOCTYPE html>\r\n<html>\r\n<head>\r\n    <meta charset=\"utf-8\">\r\n    <title>QUnit Tests</title>\r\n    <link rel=\"stylesheet\" href=\"/resources/qunit-1.12.0.css\">\r\n</head>\r\n<body>\r\n    <div id=\"qunit\"></div>\r\n    <div id=\"qunit-fixture\"></div>\r\n    <script src=\"MyLibraryData.js\"></script>\r\n    <script src=\"MyLibrary.js\"></script>\r\n    <script src=\"/resources/qunit-1.12.0.js\"></script>\r\n    <script src=\"tests.js\"></script>\r\n</body>\r\n</html>\r\n\r\n```\r\n\r\n",
    "LastUpdatedDate": "2013-08-29T12:37:13.023-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "typescript",
    "ReportedDate": "2013-08-27T20:39:08.013-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Fixed"
    },
    "Summary": "Debugger freezes in 0.9.1.1 / VS 2013 / AzureVM",
    "Type": {
      "Name": "Unassigned",
      "Id": 5
    },
    "VoteCount": 1,
    "Id": 1607
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "I created a new VM in Azure and it doesn't exhibit this problem with my codebase.  I suspect it is an issue with the VM or VS 2013 after all.",
      "PostedDate": "2013-08-28T18:16:35.173-07:00",
      "Id": 111495
    }
  ]
}