{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "As part of our move to GitHub, we're closing our CodePlex issues and suggestions and asking that people move them to the GitHub issue tracker for further discussion.  Some issues and feature requests may already be active on GitHub, so please make sure to look for an existing issue before filing a new one.\n\nYou can find our GitHub issue tracker here:\nhttps://github.com/microsoft/typeScript/issues\n",
    "ClosedDate": "2014-07-28T15:20:16.427-07:00",
    "CommentCount": 14,
    "Custom": null,
    "Description": "starting with vs2013 ultimate , ts 0.9.7, resharper 8.2.\r\nran install for Visual Studio 2013 Update 2 RC,\r\nrestart\r\nloading a typescript project, causes an exception during load (see attachment)\r\ntypescript code is not syntax colored, compiler seems not to be present.  \r\nuninstall rc2 via Visual Studio 2013 Update 2 RC.msi, remove option, \r\n=> the previous typescript 0.9.7 install is not restored\r\nproject doesnt load at all.\r\n\r\nluckily I had kept the ts 0.9.7 installer.\r\nran that and \"repaired\" the ts  0.9.7 install. \r\nnow vs 2013 is back to working and loading the typescript project.\r\n:(\r\n\r\nattached the activitylog.xml \r\n",
    "LastUpdatedDate": "2014-07-28T15:20:16.427-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "typescript",
    "ReportedDate": "2014-04-03T19:58:47.197-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "External"
    },
    "Summary": "Visual Studio 2013 Update 2 RC install fails",
    "Type": {
      "Name": "Unassigned",
      "Id": 5
    },
    "VoteCount": 4,
    "Id": 2379
  },
  "FileAttachments": [
    {
      "FileId": 823328,
      "FileName": "ActivityLog.xml",
      "DownloadUrl": ".\\823328"
    },
    {
      "FileId": 825876,
      "FileName": "logs.zip",
      "DownloadUrl": ".\\825876"
    }
  ],
  "Comments": [
    {
      "Message": "I had the same problem, but I fixed it by repairing the installation (launch Update 2 RC installation again and choose Repair). ",
      "PostedDate": "2014-04-04T02:45:45.77-07:00",
      "Id": 140519
    },
    {
      "Message": "Hi DankoD, thanks, I will try that \nhans",
      "PostedDate": "2014-04-04T10:10:38.57-07:00",
      "Id": 140562
    },
    {
      "Message": "Hello hansrwindhoff,\n\nThanks for bringing this matter to our attention.  We would very much like to investigate what went wrong during your installation of the update2 RC.\n\nCould you please send us or attach the install logs from your installation of VS2013 Update2 RC (found under the %temp% folder, if you can't tell which install logs are relevant, please just zip up all install logs in that folder starting from the date you installed the problematic update), and the zip'd contents of your \"~\\PF\\MS VS 12.0\\Common7\\IDE\\CommonExtensions\\Microsoft\\TypeScript folder\" when your TypeScript install is in the broken state?\n\nThanks,\nChris",
      "PostedDate": "2014-04-04T11:10:31.96-07:00",
      "Id": 140574
    },
    {
      "Message": "Hello Chris, I dont like to post these log files here , could you give me an email address so I can send you a dropbox link?\n\nThey include the rc2 install, the rc2 uninstall which did not restore the previous version of typescript and the re-install of the 0.9.7 version of typescript.\n\nI cant risk to re-install the rc2 at the moment as I need vs to be working :)\nI might try again over the weekend...\n\nOne piece of info I hadn't mentioned before is that I am running windows 8.1 pro as a vhd native boot. Not sure if that is important.\nhans",
      "PostedDate": "2014-04-05T15:42:10.447-07:00",
      "Id": 140684
    },
    {
      "Message": "I did what DankoD suggested, -run the repair- that fixed my issues. Everything is working fine now :)",
      "PostedDate": "2014-04-07T11:39:39.94-07:00",
      "Id": 140845
    },
    {
      "Message": "Glad repair fixed the issue for you. We'd still like to figure what was going on here to avoid any future issues. If you prefer to send the logs privately you can certainly do that. If you click on either my username or Chris' you'll see a Contact link that can be used to send us stuff via private email. You can send either of us the logs and we'll try to figure out what happened.",
      "PostedDate": "2014-04-08T18:39:07.297-07:00",
      "Id": 141042
    },
    {
      "Message": "We have had the same issue too installing into VS2013 Premium.  Trying re-installing the update, but the issue still occurred.",
      "PostedDate": "2014-04-08T20:29:16.137-07:00",
      "Id": 141139
    },
    {
      "Message": "@crankage, did you also have Resharper installed originally?",
      "PostedDate": "2014-04-09T11:51:38.923-07:00",
      "Id": 141229
    },
    {
      "Message": "@crankage also if you're also able to share the contents of  \"~\\PF\\MS VS 12.0\\Common7\\IDE\\CommonExtensions\\Microsoft\\TypeScript\" along with the contents of %TEMP% that could be useful to help us find any common thread between the two cases here",
      "PostedDate": "2014-04-09T11:55:51.747-07:00",
      "Id": 141230
    },
    {
      "Message": "@danquirk, yes we did have resharper installed.  Attached are the logs from my colleague (it was him who had the problem).  The only file in the typescript folder was the .pkgdef file.  Do want that too?",
      "PostedDate": "2014-04-09T15:44:44.507-07:00",
      "Id": 141259
    },
    {
      "Message": "No that should be sufficient thanks. We haven't reproduced this locally but we do have an idea of what might be causing it based on the logs and some additional investigation. I'm leaving this issue open in case anyone else hits it and can chime in with additional details.",
      "PostedDate": "2014-04-15T19:18:07.613-07:00",
      "Id": 142029
    },
    {
      "Message": "Perhaps I can shed some light: I just installed Update 2 for VS2013, but my laptop memory and disk space was low.  I didn't get an error, but the installer disappeared (most likely due to a crash from low memory).  I thought it installed (walked away and came back later), but running VS2013 I could see also that the typescript code was not syntax colored, and the compiler didn't seem active.  I had to do a repair install to make sure it was actually installed correctly, then everything was fine - and I saw the \"completed\" installer screen this time.    I think the installer is erring out in some cases and closing on its own, and thus causing the need to run \"repair\" to complete the installation.  FYI: I installed it side-by-side VS2012 (if that matters).",
      "PostedDate": "2014-05-20T17:41:44.04-07:00",
      "Id": 147287
    },
    {
      "Message": "_(FYI: I do not use nor have resharper installed)_",
      "PostedDate": "2014-05-20T17:42:47.67-07:00",
      "Id": 147288
    },
    {
      "Message": "I'm having the same problem in VS 2013 Update 2 Ultimate. I also have \"VS Express 2013 for Web Update 2\" installed and Typescript works fine in there.\n\nIn \"C:\\Program Files (x86)\\Microsoft Visual Studio 12.0\\Common7\\IDE\\CommonExtensions\\Microsoft\\TypeScript\" I have a TSSource.ico file and a TypeScriptTemplateRegistration.pkgdef file. The contents of the pkgdef file is:\n\n[$RootKey$\\Projects\\{f938420c-e90f-49cd-a24c-6da815ee44e7}]\n@=\"TypeScriptTemplates\"\n\"Language(VsTemplate)\"=\"TypeScript\"\n\"DisplayName\"=\"TypeScript\"\n\"DisplayProjectType(VsTemplate)\"=\"TypeScript\"\n\nI tried doing a repair install of update 2 but that did not fix the problem.",
      "PostedDate": "2014-06-24T09:09:18.173-07:00",
      "Id": 150614
    }
  ]
}