{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "",
    "ClosedDate": "2014-04-15T09:41:52.787-07:00",
    "CommentCount": 8,
    "Custom": null,
    "Description": "This comes up common enough in my conversations to warrant an issue tracker people can vote on. \r\n\r\nReason: More people -> more eyes -> more contributions -> less work for Microsoft.\r\n\r\nMicrosoft has done this before e.g. https://github.com/SignalR/SignalR is hosted on github so I am sure it can be done.\r\n\r\nMy intention here is not to point out any bad UI experience specific to codeplex (those belong on the codeplex project https://codeplex.codeplex.com/). The intention of this issue is to provide a platform that the TypeScript team can observe to see the community desire to migrate to Github. \r\n\r\nThis can be used whenever the team re-evaluates the hosting site based on their business needs.",
    "LastUpdatedDate": "2014-07-22T06:26:21.05-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "typescript",
    "ReportedDate": "2014-04-11T05:17:03.87-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Fixed"
    },
    "Summary": "Move source code to github",
    "Type": {
      "Name": "Unassigned",
      "Id": 5
    },
    "VoteCount": 5,
    "Id": 2420
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "You forgot to mentions the sub-standard usability of the codeplex site.  \n\nThe request for editable tracker comments are pending for almost 2 years! And the code browser.. it is so stark and bleak.\n\nAnd we cannot @mention people. And whenever a ticket is pre-maturely closed it is impossible to get more feedback as everyone seems to instantly unsubscribe even if the discussion is not done.\n\nAs Github user I dread having to come here. I am pretty sure this site is hurting the project and gives a huge penalty to Microsoft's Open Source endeavours. \n\nIn the recent //build/ videos everybody was so enthusiastic about going Open Source. This is very admirable but doing it here is probably not a good idea. Especially if you want to involve the existing open source communities who clearly settled for Github as the superior choice.",
      "PostedDate": "2014-04-11T09:30:40.2-07:00",
      "Id": 141510
    },
    {
      "Message": "Ah.. and as per usually I see a mistake in my comment. But it will have to stand for eternity as I cannot edit it. Pff..",
      "PostedDate": "2014-04-11T09:31:42.803-07:00",
      "Id": 141511
    },
    {
      "Message": "We regularly evaluate which hosting site is correct for our business needs.\n\nPlease do give the CodePlex team your feedback (https://codeplex.codeplex.com/) on any usability issues.\n\r\n\r** Closed by RyanCavanaugh 04/14/2014 8:49AM",
      "PostedDate": "2014-04-14T08:49:40.597-07:00",
      "Id": 141806
    },
    {
      "Message": "The same is true for Roslyn and the F# compiler. I really really tried to use this site here, but it's a really a major pain. If you want to establish a real good community then this step is needed. ",
      "PostedDate": "2014-04-15T01:54:25.663-07:00",
      "Id": 141919
    },
    {
      "Message": "IMO, I prefer Codeplex as I think parts of it are a little more intuitive than Github. I agree that the site development is inexcusably slow though, and that it has stability issues sometimes.",
      "PostedDate": "2014-04-15T05:55:06.587-07:00",
      "Id": 141932
    },
    {
      "Message": "> We regularly evaluate which hosting site is correct for our business needs.\n\nMaybe you guys should make usability a \"business need\". I'm pretty sure this choice was is based on politics and not a conscious evaluation.",
      "PostedDate": "2014-04-15T10:28:31.37-07:00",
      "Id": 141957
    },
    {
      "Message": "Changing resolution to 'Fixed'\r\nhttps://github.com/Microsoft/TypeScript/\r\nhttp://blogs.msdn.com/b/typescript/archive/2014/07/21/new-compiler-and-moving-to-github.aspx",
      "PostedDate": "2014-07-21T10:26:20.23-07:00",
      "Id": 153075
    },
    {
      "Message": "Excellent! Glad to see this moving forward to more usable platform.\n\nAlso thumbs up for the new compiler!",
      "PostedDate": "2014-07-22T06:26:21.05-07:00",
      "Id": 153152
    }
  ]
}