{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "A fix has been checked in and will be visible in an upcoming release.",
    "ClosedDate": "2014-03-31T17:27:28.577-07:00",
    "CommentCount": 1,
    "Custom": null,
    "Description": "I really like the new \"tsc --watch\" functionality - it massively speeds up my compile times and makes development for the browser much more natural - thanks.\r\n\r\nThe issue I am having is that while there is a handy banner that tells you when a compilation starts (including a super-handy timestamp), there is presently no way of knowing when a compilation is done.\r\n\r\nThis makes it much harder to integrate \"tsc --watch\" into ones development workflow.\r\n\r\nFor example:\r\n\r\nI  want emacs M-x compile to show the errors from the last compilation.  I have written a python script to extract this from the compilation log - but not knowing whether the compilation is done means I have to do funny guessing and timeouts.\r\n\r\nI want to be able to just click refresh in the browser after editing the program and have it just run as if it was straight JS - but go to an error page instead of the typescript compilation failed.  My plan was to have the browser fetch the compilation log, grab out the last compilation etc - but again I am stymied by no reliable way of knowing that a compilation is done.\r\n\r\nA simple extra newline (or any other unique marker) at the end of each \"tsc -w\" compilation batch would make me very happy.\r\n\r\n- Thanks\r\n\r\nDavid\r\n\r\n- ",
    "LastUpdatedDate": "2017-11-27T11:51:34.217-08:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "typescript",
    "ReportedDate": "2013-04-08T09:10:20.903-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Fixed"
    },
    "Summary": "Please add newline after compilation results in watch mode.",
    "Type": {
      "Name": "Unassigned",
      "Id": 5
    },
    "VoteCount": 1,
    "Id": 886
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Can you have emacs delete the JS file on save, that way you will get a 404 in the browser until the compilation is done?",
      "PostedDate": "2013-08-13T23:00:32.693-07:00",
      "Id": 109789
    }
  ]
}