{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "This is a VS dialog that appears if a file has been changed externally. There's really not much else to say about this -- if another process or tool is changing a file that you're editing in, you need to change that process or tool accordingly to match your workflow. I'm unclear on what the TypeScript issue is here.",
    "ClosedDate": "2013-10-07T08:25:59.32-07:00",
    "CommentCount": 1,
    "Custom": null,
    "Description": "I've been trying to use typescript with VS 2012 and not 2013RC but I keep getting \r\n\"The file has been modified outside of the source editor\" and often losing changes because I keep finding myself with two unsynchronized copies in VS despite my best efforts to avoid this.\r\n\r\nThis is a C#/Forms project based on Awesomium's Webkit wrapper. I've set the .ts files build action to \"Typescript Compile\" and then load the resulting .JS files at runtime. (I'd prefer to make them resoruces like I could with the .JS but my efforts have so far failed).\r\n",
    "LastUpdatedDate": "2014-11-30T08:24:00.577-08:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "typescript",
    "ReportedDate": "2013-10-05T14:50:03.58-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "External"
    },
    "Summary": "the file has been modified outside of the source editor",
    "Type": {
      "Name": "Unassigned",
      "Id": 5
    },
    "VoteCount": 1,
    "Id": 1762
  },
  "FileAttachments": [
    {
      "FileId": 957451,
      "FileName": "dropbox-and-vs.CSV",
      "DownloadUrl": ".\\957451"
    }
  ],
  "Comments": [
    {
      "Message": "I see this issue also, and I see this __only__ when...\r\n\r\n* I'm editing TypeScript in Visual Studoi 2013 __and__\r\n* Dropbox is monitoring my source files.\r\n\r\nOf course I'm __not__ talking about the case where Dropbox has any reason to actually write anything. In fact when I use process monitor to look at what's accessing the file in question I don't see that it does.\r\n\r\nI attached an appropriately filtered csv from process monitor as I have no idea what to make of this.\r\n\r\nThis is a bug of either the TypeScript part of Visual Studio or Dropbox or both.",
      "PostedDate": "2014-11-30T08:24:00.577-08:00",
      "Id": 166911
    }
  ]
}