{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "As part of our move to GitHub, we're closing our CodePlex suggestions and asking that people move them to the GitHub issue tracker for further discussion.  Some feature requests may already be active on GitHub, so please make sure to look for an existing issue before filing a new one.\n\nYou can find our GitHub issue tracker here:\nhttps://github.com/microsoft/typeScript/issues\n",
    "ClosedDate": "2014-07-28T15:17:22.847-07:00",
    "CommentCount": 14,
    "Custom": null,
    "Description": "Some calls that \"Automatic Semicolon Insertion\" in JavaScript is a feature but I think that the guy who put this inside the spec were on crack when he did that. \r\n\r\nI understand that giving compile time errors if a semicolon is missing by default is going to break a lot of existing code and this is against the main idea of the TypeScript but is it possible to add some sort of config to give compile time errors if a semicolon is missing?\r\n\r\nSuch as \"use strict\" in ECMAScript 5. I know that \"use strict\" doesn't provide this but is it possible that something similar to this can be added?\r\n\r\nI also think that this feature should prevent some stupid mistakes that the JS originally does. For example, the following code:\r\n\r\nfunction sum() { \r\n\t\r\n\treturn \r\n\t{\r\n\t\tfoo: \"bar\"\r\n\t}\r\n}\r\n\r\nCurrently, TS generates the below code for this:\r\n\r\nfunction sum() {\r\n    return;\r\n {\r\n        foo:\r\n\"bar\"\r\n    }\r\n}\r\n\r\nhttps://pbs.twimg.com/media/A4NTLCqCcAAGO9Q.png:large",
    "LastUpdatedDate": "2017-11-27T11:51:33.707-08:00",
    "PlannedForRelease": "TypeScript 2.x",
    "ReleaseVisibleToPublic": true,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "typescript",
    "ReportedDate": "2012-10-01T12:48:05.733-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "External"
    },
    "Summary": "Add some sort of config to give compile time errors if a semicolon is missing",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 26,
    "Id": 6
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Agreed. Even a warning at compile time would be useful. Most of TypeScript seems to have been built to help JS developers produce better looking JavaScript, but it would be all too easy for one to get used to leaving out semicolons and forget quite how broken this can make some JS if left be (without the TS compiler).",
      "PostedDate": "2012-10-02T05:08:12.8-07:00",
      "Id": 78268
    },
    {
      "Message": "Another alternative is to design properly optional semi-colons, but I'm not sure how that would affect compatibility with edge-cases of vanilla js.",
      "PostedDate": "2012-10-02T06:52:03.23-07:00",
      "Id": 78276
    },
    {
      "Message": "@ajanuary no optional semicolons! If they were optional, it wouldn't be called \"Automatic Semicolon Insertion\".",
      "PostedDate": "2012-10-02T07:15:34.017-07:00",
      "Id": 78278
    },
    {
      "Message": "Opt-in lint-like warnings are something we are definitely considering.  Warning on missing semicolons is one of the style rules we would likely include with such support.",
      "PostedDate": "2012-10-02T07:24:52.397-07:00",
      "Id": 78279
    },
    {
      "Message": "@LukeH\n\nGreat, thanks!\n\nAs I indicated on the updated version of my issue, I also think that this feature should prevent some stupid mistakes that the JS originally does. For example, the following code:\n\nfunction sum() { \n\nreturn \n{\nfoo: \"bar\"\n}\n}\n\nCurrently, TS generates the below code for this:\n\nfunction sum() {\nreturn;\n{\nfoo:\n\"bar\"\n}\n}\n\nhttps://pbs.twimg.com/media/A4NTLCqCcAAGO9Q.png:large",
      "PostedDate": "2012-10-02T07:26:56.373-07:00",
      "Id": 78280
    },
    {
      "Message": "@tugberk Proper and well designed optional semi-colons would eliminate pretty much all the issues with ASI.",
      "PostedDate": "2012-10-02T07:51:14.207-07:00",
      "Id": 78287
    },
    {
      "Message": "@ajanuary \n\nI really don't understand why you want them to be optional? tell me one reason?",
      "PostedDate": "2012-10-02T08:03:10.147-07:00",
      "Id": 78291
    },
    {
      "Message": "@tugberk  Ignoring for the moment compatibility with javascript, you can just as easily flip the argument.\n\nWhy have semi-colons at all? They're visual noise on almost every line to guard against an edge case. You can just as easily have it so you only need the visual noise in the edge cases (for example, see Python). Remember, this isn't the same as ASI so none of those ugly cases exist.\n\nBringing compatibility with javascript back into the frame, I don't think you can have a good optional semi-colon solution whilst still being able to compile 100% (or however close it is now) of javascript with the typescript compiler. Which is what I said in my original comment.",
      "PostedDate": "2012-10-02T08:57:11.14-07:00",
      "Id": 78300
    },
    {
      "Message": "@ajanuary\n\nYou are at the wrong place. Here is the one that you need to be: https://github.com/twitter/bootstrap/issues/3057\n\nDid you see the title of this issue? \"Add some sort of config to give compile time errors if a semicolon is missing\" which means that TS honors ASI out of the box for the sake of compatibility and I am requesting a way to opt-in as Luke indicated. So, there is no need for your to start a another semicolon war.\n\nI am repeating loudly for you:\n\n\"Some calls that \"Automatic Semicolon Insertion\" in JavaScript is a feature but I think that the guy who put this inside the spec were on crack when he did that.\"\n\nthanks!",
      "PostedDate": "2012-10-02T09:21:13.55-07:00",
      "Id": 78303
    },
    {
      "Message": "Semicolons helps to make code cleaner and easier to read.  It also help to reduce Javascript error if the script is too complex for Javascript to handle.  So, I'm not sure having this option is worth it to have.  However I'm not against it if you want this feature.",
      "PostedDate": "2012-10-04T16:51:56.067-07:00",
      "Id": 78631
    },
    {
      "Message": "Is a compile-time flag planned for 0.9.5? This is already implemented by the compiler but isn't exposed via the CLI, and I'd rather not hack the compiler every release to get linting. It would be very simple to add:\n\n```\nopts.option('noASI', {\n    usage: {\n        locCode: TypeScript.DiagnosticCode.Automatic_semicolon_insertion_not_allowed,\n        args: null\n    },\n    set: function () {\n        mutableSettings.allowAutomaticSemicolonInsertion = false;\n    }\n});\n```\n\n",
      "PostedDate": "2013-11-18T12:37:50.277-08:00",
      "Id": 123426
    },
    {
      "Message": "I made a similar mistake (separate 'return' statement and return value with new line) and spent hours to trace the issue.\nPlease add this feature. Typescript should give error or at least warning.",
      "PostedDate": "2014-03-22T03:16:33.3-07:00",
      "Id": 137630
    },
    {
      "Message": "For those looking for an immediate solution, tslint has a rule setup to detect missing semicolons.",
      "PostedDate": "2014-05-12T01:38:47.507-07:00",
      "Id": 146273
    },
    {
      "Message": "If such option is added, it would be nice to consider it for auto-indentation.\nToday Ctrl+K,D formats as follows\n```\n    return\n    null;\n```\nWith this option enabled, this could be formatted as we expected it to be:\n```\n    return\n        null;\n```\n",
      "PostedDate": "2014-07-15T08:58:36.72-07:00",
      "Id": 152460
    }
  ]
}