{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "Thanks for logging this issue. We've moved to a new codebase on GitHub; please try your issue against the new compiler and log an issue on the GitHub site if it still reproduces.",
    "ClosedDate": "2014-07-21T17:32:54.147-07:00",
    "CommentCount": 1,
    "Custom": null,
    "Description": "After installing the Typescript PowerTool for VS 2012 (see below), I get the following error \"Output generation failed\" when creating a new typescript file, adding valid typescript code, and saving it.  The .js file is never generated, and I only see the \"...failed\" error in the status bar. There are no other error details in any of my panes/windows.  I've configured the TypeScript text editor to compile on save, and have also installed the Web Essentials 2012 plugin, which shows me the preview screen, but currently on only shows \"// Not compiled to disk yet.\"  I think that MSBuild does not have all of the information necessary to build the .JS files out, but I'm not positive.  I'm checking on a couple of work-arounds to manually add the configurations, but have only got it to work once, and i'm not sure what changes made it work.  \r\n\r\nMy install is VS Pro 2012 Update 4: And I used the link below for the power tool:\r\nhttp://visualstudiogallery.msdn.microsoft.com/fa041d2d-5d77-494b-b0ba-8b4550792b4d\r\n\r\nThanks,\r\n\r\n\r\n",
    "LastUpdatedDate": "2014-07-21T17:32:54.147-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "typescript",
    "ReportedDate": "2014-06-10T12:44:29.36-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "External"
    },
    "Summary": "Output generation failed",
    "Type": {
      "Name": "Unassigned",
      "Id": 5
    },
    "VoteCount": 1,
    "Id": 2551
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Does this issue still occur when Web Essentials is not installed?",
      "PostedDate": "2014-06-10T14:07:57.05-07:00",
      "Id": 149297
    }
  ]
}