{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "It sounds like you have a repro project -- can you please upload it and re-open this issue (use the link at the top of this form)? It's very difficult to determine how your project is set up from the description you have. Thanks!",
    "ClosedDate": "2013-08-12T16:09:51.54-07:00",
    "CommentCount": 9,
    "Custom": null,
    "Description": "I'm using VS.NET 2012 and TypeScript 0.8.3.1. Everything is fine until I install version 0.9.0. With new version, VS.NET notify that there is no loaded symbol and I cannot debug the source code anymore.\r\n\r\nIf I uninstall 0.9.0 and re-install 0.8.3.1, I can debug again.\r\n\r\nIs it an issue of new version or do I miss something?\r\n\r\n----------------------\r\n\r\nUpdated on 2013/08/10\r\n\r\nTried with 0.9.1 but it still occurs.",
    "LastUpdatedDate": "2014-04-03T14:24:57.713-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "typescript",
    "ReportedDate": "2013-06-23T05:57:11.853-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Need More Info"
    },
    "Summary": "Cannot debug TypeScript file with version 0.9.0 and VS.NET 2012",
    "Type": {
      "Name": "Unassigned",
      "Id": 5
    },
    "VoteCount": 1,
    "Id": 1213
  },
  "FileAttachments": [
    {
      "FileId": 762963,
      "FileName": "fixError.png",
      "DownloadUrl": ".\\762963"
    }
  ],
  "Comments": [
    {
      "Message": "Same problem here. Since version 0.9.0 debugging with VS2012 is not possible anymore. Using 0.8.3.1 everything is fine. With 0.9.0 the break points in the ts file are ignored by VS2012 and the dynamically created ts files cannot by opened. So, no way to debug ts files using VS2012 ind IE10 with version 0.9.0",
      "PostedDate": "2013-06-23T12:04:34.177-07:00",
      "Id": 103883
    },
    {
      "Message": "Same issue over here.",
      "PostedDate": "2013-06-27T06:59:48.677-07:00",
      "Id": 104349
    },
    {
      "Message": "For me the issue appears when using SSL.  \n\nWith SSL = no debugging.\nWithout SSL = All ok.\n\nDo you guys have SSL enabled? ",
      "PostedDate": "2013-06-27T19:16:59.79-07:00",
      "Id": 104467
    },
    {
      "Message": "I'm not able to reproduce this, can you attach a *small* repro-project.\n\nDo you have Web Essentials installed? Can you try with that un-installed?\n\r\n\r** Closed by paulb 06/24/2013 10:50AM",
      "PostedDate": "2013-06-24T10:50:40.223-07:00",
      "Id": 109310
    },
    {
      "Message": "Hi paulb,\r\n\r\nI have tried to uninstall all extensions and install newest version (0.9.1) but there is no luck.  I'm using ASP.NET Development Server for debugging; so there is no SSL as JonKragh mentioned too.\r\n\r\nI can see similar issue as my problem here (please check the last post of Geminiman): \r\n\r\nhttps://typescript.codeplex.com/discussions/449596 \r\n\r\nIn my project, I still can see the .ts file attached to .js file but I'm no longer to open that .ts file again. If I set a break-point in .js file, when the execution reach that point, VS.NET notify that \"Source Not Available\".",
      "PostedDate": "2013-08-10T07:03:33.15-07:00",
      "Id": 109311
    },
    {
      "Message": "Hi paulb,\n\nI tried to create a small-repo project and I just found that my problem may relate to the way I refer the final .js file.\n\nCurrently, I add a new virtual directory for the folder which contains .js files. In web page, the code to refer that .js files look like:\n\n  <script type=\"text/javascript\" src=\"http://localhost/demo/demo.js\"></script>\n\nand since i'm using ASP.NET Development Server, my page a in different application:\n\nhttp://localhost:50847/WebForm1.aspx\n\nDoes the issue relate to remote debugging like that?",
      "PostedDate": "2013-08-10T07:48:30.243-07:00",
      "Id": 109313
    },
    {
      "Message": "When I add a .ts file the dependencies for the .map and .js file are no longer being picked up.  \n\nI had to manually add an ItemGroup node to the project file and then add the dependencies order for the maps to be picked up by the debugger.   \n\nIt will fix the problem but it's a real pain.",
      "PostedDate": "2013-08-13T08:02:48.31-07:00",
      "Id": 109604
    },
    {
      "Message": "My problem is related to Azure.  When I set the Cloud Service as the startup project, the debugger fails to find the map files in the WebRole.  If I launch the WebRole directly as the startup project, the debugger successfully loads the map files.",
      "PostedDate": "2013-10-06T04:16:54.183-07:00",
      "Id": 117578
    },
    {
      "Message": "My project works now that I have change by web role's project URL to match my Azure URL.\r\n\r\nI changed the Web | Servers | Project URL to http://127.0.0.1:81 on the web role property sheet.",
      "PostedDate": "2013-11-28T12:58:29.5-08:00",
      "Id": 125580
    }
  ]
}