{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "",
    "ClosedDate": "2013-03-05T09:50:24.143-08:00",
    "CommentCount": 2,
    "Custom": null,
    "Description": "Would like to see the following 'fixed' in VS2012:\r\n\r\nwindow.location.href = \"test\";\r\n\r\nif I have the cursor right after the dot, before href, and when I press CTRL-SPACE, I'd expect to see the autocompletion list. However it jumps to the end of href.\r\n\r\nIf however, I first press space, go back one position, and then do CTRL-SPACE then I do see the autocompletion list.  Next step would be to delete the space and href if I've choosen another option.\r\n\r\nIn c#, the CTRL-SPACE after the dot also works in the case an option is already present.\r\n\r\nCould this be done in TypeScript editor as well.\r\n\r\nI realize this is only a smal annoyance, therefore I hope it is a quickfix which can easily be addressed!",
    "LastUpdatedDate": "2013-08-13T09:52:17.347-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "typescript",
    "ReportedDate": "2013-03-05T01:34:54.077-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "Intellisense on dot show item list",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 783
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Ctrl+Space is the \"Complete word\" shortcut.  As you already have the word there, it is easy to complete.  It is jumping to the end as it is completing the word.  If you had just the \".ha\" there and pressed Ctrl+Space you would see the same behavior (after it completed the rest of the word \"hash\" for you).\n\nThe \"List Members\" keyboard shortcut is (depending on preferences) Ctrl+J.  Using this key combination, you should see the complete drop-down list regardless of the number of characters already present after the \".\".\n\nI hope I am understanding your issue correctly and this explanation addresses it.  Please reopen if not.",
      "PostedDate": "2013-03-05T09:50:19.82-08:00",
      "Id": 92326
    },
    {
      "Message": "CTRL-J ... indeed ... that behaves as I was hoping for ... thanx for the explanation!!",
      "PostedDate": "2013-03-05T11:00:09.36-08:00",
      "Id": 92331
    }
  ]
}