{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "",
    "ClosedDate": "2013-12-13T16:21:19.303-08:00",
    "CommentCount": 9,
    "Custom": null,
    "Description": "From: https://typescript.codeplex.com/discussions/453620\r\n\r\nSounds like we need to investigate ways to make publishing more robust.\r\n\r\nOriginal report:\r\n\"Also, having NuGet package restore enabled for whatever reason prevents the compiled JS files from being published. If you edit the project file and change <RestorePackages>true</RestorePackages> to <RestorePackages>false</RestorePackages> it then publishes the compiled JS files. I've tried moving the nuget targets import around as suggested for the TS targets (by @pgbross) file by putting before/after TS targets import, but that didn't make any difference. So, it seems that the other targets files conflict with the TS targets file for publishes.\"",
    "LastUpdatedDate": "2014-06-20T13:11:21.467-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "typescript",
    "ReportedDate": "2013-09-09T08:25:59.243-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Fixed"
    },
    "Summary": "NuGet package restore breaks publishing JS files in TS projects",
    "Type": {
      "Name": "Unassigned",
      "Id": 5
    },
    "VoteCount": 4,
    "Id": 1661
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Thanks for the report, we'll investigate.",
      "PostedDate": "2013-09-09T15:25:47.903-07:00",
      "Id": 112913
    },
    {
      "Message": "Also, another issue I noticed w/ TS and NuGet is in the web project file, if the TS targets import is not after the NuGet targets import and you have source mapping turned on, it will generate the source map reference on save, but on build it will not.\n\nTo reiterate...\n\nBy placing the TS targets import after the NuGet targets import the source map reference gets generated at the end of my outputted JS files.\n\nBy placing the TS targets import before the NuGet targets import the source map reference does NOT get generated at the end of the outputted JS files.",
      "PostedDate": "2013-09-12T13:30:18.027-07:00",
      "Id": 113397
    },
    {
      "Message": "This was closed and marked as fixed, but it is still an issue in release 0.9.5. And the workitem 3573 referenced by danquirk is not the same thing.",
      "PostedDate": "2013-11-26T12:54:36.493-08:00",
      "Id": 124374
    },
    {
      "Message": "@djarekg - by \"this was closed and marked as fixed\" are you referring to the original reported issue or the second one you mentioned later about reordering the targets and not getting source map references generated at the end of JS files?",
      "PostedDate": "2013-11-26T14:20:37.47-08:00",
      "Id": 125384
    },
    {
      "Message": "I'm not sure if it's still related to NuGet in the 0.9.5 beta, but the JS output TS files still do not publish.",
      "PostedDate": "2013-11-27T05:11:26.647-08:00",
      "Id": 125441
    },
    {
      "Message": "This should be fixed now. You can see the related NuGet issue here https://nuget.codeplex.com/workitem/3573\n\r\n\r** Closed by danquirk 10/21/2013 3:39PM",
      "PostedDate": "2013-10-21T15:39:25.047-07:00",
      "Id": 125458
    },
    {
      "Message": "We believe we've fixed everything on our end here. You may need to wait for a new NuGet update before you can see their fix, it's not entirely clear to me based on the comments in their bug linked earlier in the thread.",
      "PostedDate": "2013-12-13T16:21:14.997-08:00",
      "Id": 127456
    },
    {
      "Message": "What exactly does \"FIXED\" indicate here?  I can confirm that this problem is most certainly not fixed for me, and I'm using TypeScript 1.0.1 Tools for Visual Studio 2012 in VS 2012 on an MVC4 project with ts files in it.  Granted, my project file was created prior to the 1.0.1 release, but I can tell you that my .js files have been \"non-included\" in the project since I created it, and now I find that WebDeploy packages include no .JS files.\n\nWould someone mind explaining what was purported to be fixed so I can figure out why mine doesn't work?  Even a pointer to a commit would better than just \"it's fixed now\".  'Cuz it ain't.\n\nSome food for thought:  \"Fixing it\" for future sln files isn't helpful at all to those with existing projects.  I'm not sure but this seems to be the mindset here.",
      "PostedDate": "2014-06-20T13:08:11.4-07:00",
      "Id": 150367
    },
    {
      "Message": "Please disregard my prior comment.  I ended up on the wrong page after clicking through too many discussions related to typescript not deploying JS files.  My problem is not related to Nuget Package Restore being enabled.",
      "PostedDate": "2014-06-20T13:11:21.467-07:00",
      "Id": 150368
    }
  ]
}