{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "This is by design at the moment. If you want multiple files to contribute to the same output .js file then you can use the --out compiler switch and internal modules. That is, don't use import and export in your individual files, just use triple slash references for the necessary dependencies, then compile with --out and specify the .js you want everything concatenated into.\n\nFor creating a single external module from multiple source .ts files we have an outstanding design issue we're hoping to address.",
    "ClosedDate": "2013-05-10T13:09:02.953-07:00",
    "CommentCount": 1,
    "Custom": null,
    "Description": "if you have multiple files under same namespace(module), you will not be able to compile two ts file into one js file.\r\n\r\nfor example, I have two files: Bar.ts & Bars.ts, I want to put two class under same namespace(module),\r\nthose two files can be compiled successfully  into two separate js files, but will get compile error if I want to compile two ts files into one js file.\r\nI attached the solution, you can check it with the solution. I updated the project file to compile ts files into one js file for Debug mode.\r\nyou will get a compile error if you compile in Debug mode.\r\nit compiles if you compile in Release mode.\r\n",
    "LastUpdatedDate": "2013-05-10T13:09:02.953-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "typescript",
    "ReportedDate": "2013-05-08T02:06:56.177-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "By Design"
    },
    "Summary": "Can't compile two files under same namespace(module) into one js file",
    "Type": {
      "Name": "Unassigned",
      "Id": 5
    },
    "VoteCount": 5,
    "Id": 1012
  },
  "FileAttachments": [
    {
      "FileId": 677320,
      "FileName": "TypeScriptHTMLApp2.zip",
      "DownloadUrl": ".\\677320"
    }
  ],
  "Comments": [
    {
      "Message": "Yes ,I have met the same problem, I hope module keyword in typescript have the same function with C# namespace, So I can separate some Class into different typescript file but with the same namespace. that will be great.",
      "PostedDate": "2013-05-08T02:19:08.647-07:00",
      "Id": 99670
    }
  ]
}