{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "As part of our move to GitHub, we're closing our CodePlex suggestions and asking that people move them to the GitHub issue tracker for further discussion.  Some feature requests may already be active on GitHub, so please make sure to look for an existing issue before filing a new one.\n\nYou can find our GitHub issue tracker here:\nhttps://github.com/microsoft/typeScript/issues\n",
    "ClosedDate": "2014-07-28T15:18:41.347-07:00",
    "CommentCount": 2,
    "Custom": null,
    "Description": "Hi Guys,\r\n\r\nThis isn't strictly an issue - more a question / concern.  I initially published this as a comment on Jonathans blog post but it looks like I may have missed the boat for replies so I thought I'd raise it here so it doesn't get lost.\r\n\r\nCould you confirm if the TypeScript plug-in support that currently exists for Visual Studio 2012 will be maintained going forwards given that Visual Studio 2013 has shipped?\r\n\r\nMy hope is \"yes\" because developers are not always free in the enterprise environment to move to the latest version of Visual Studio.  It sounds like this situation is compounded with the Visual Studio 2013 release because it has a installation dependency on IE 10.  And unfortunately most enterprise environments I'm aware of don't appear to be willing to move beyond IE 9 for now.  \r\n\r\nMy fear is that the TypeScript plugin will only be supported for the latest version of Visual Studio and in a corporate environment it may no longer be possible to use TypeScript.  Please say it isn't so! \r\n\r\nIf it is then I'll likely only be able to use TypeScript on my side projects.  In a workplace environment (and I imagine this will be a scenario that many devs share) we'd have to stop using TypeScript and move back to native JavaScript.  This would very frustrating for me personally but more importantly it would likely hurt the adoption of TypeScript which would be a terrific shame given how useful it is.\r\n",
    "LastUpdatedDate": "2017-11-27T11:51:33.707-08:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "typescript",
    "ReportedDate": "2013-10-18T00:50:52.95-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "External"
    },
    "Summary": "Maintain support for TypeScript VS2012 plugin now VS2013 launched",
    "Type": {
      "Name": "Unassigned",
      "Id": 5
    },
    "VoteCount": 1,
    "Id": 1806
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Assigning this to Jon for visibility, but right now we can't announce anything about the supported VS versions for the next releases of the TypeScript plugin. I realize this is not what you want to hear, but when we have something to announce we'll post it on the typescript blog. [0]\r\n\r\n[0] http://blogs.msdn.com/b/typescript/",
      "PostedDate": "2013-10-18T12:02:07.2-07:00",
      "Id": 118852
    },
    {
      "Message": "Thanks paulb",
      "PostedDate": "2013-10-18T12:38:21.007-07:00",
      "Id": 118859
    }
  ]
}