{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "This is by design. If you want multiple declaration spaces like this then you need to use multiple projects or compilations. \n\nWhy can you not have separate projects for the mobile and desktop versions of the site? They can each reference the correct .d.ts for their particular needs, as well as any additional .d.ts or libraries which encapsulate behavior common to both mobile and desktop.",
    "ClosedDate": "2013-05-10T15:25:41.253-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "I have a MVC project which supports both desktop view and mobile view. I am using jQuery UI for desktop view and jQuery Mobile for mobile view. Therefore I have added 2 typing files into my project: jquery-ui.d.ts and jquerymobile.d.ts. However Visual Studio complaints about duplicated identifiers and signatures:\r\n\r\n- Duplicate identifier 'create'\r\n- Signature for 'dialog' is duplicated\r\n- Signature for 'button' is duplicated\r\n\r\nSince Visual Studio always compiles all type script files in the same project at the same time, and complains that two jQuery libraries are redefining the identifiers and signatures. E.g., they both defined diglog widget and button widget.\r\n\r\nIn JavaScript world, this conflict will never happen, because I am only using jQuery UI scripts in desktop view, and jQuery Mobile scripts in mobile view. TypeScript should handle this scenario.\r\n\r\nI am suggesting that TypeScript should have multiple memory spaces for identifiers and signatures, one per scripts reference chain (e.g., <reference path=\"*.ts\" />).\r\n\r\n\r\n",
    "LastUpdatedDate": "2013-05-10T15:25:41.253-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "typescript",
    "ReportedDate": "2013-05-07T21:02:46.613-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "By Design"
    },
    "Summary": "Duplicate identifier / Signature when using multiple jQuery libraries in the same project.",
    "Type": {
      "Name": "Unassigned",
      "Id": 5
    },
    "VoteCount": 1,
    "Id": 1009
  },
  "FileAttachments": [],
  "Comments": []
}