{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "As part of our move to GitHub, we're closing our CodePlex suggestions and asking that people move them to the GitHub issue tracker for further discussion.  Some feature requests may already be active on GitHub, so please make sure to look for an existing issue before filing a new one.\n\nYou can find our GitHub issue tracker here:\nhttps://github.com/microsoft/typeScript/issues\n",
    "ClosedDate": "2014-07-28T15:18:11.267-07:00",
    "CommentCount": 2,
    "Custom": null,
    "Description": "This results in compiling TS files every single time the build runs, whether anything changed or not, which significantly slows down the development process.",
    "LastUpdatedDate": "2017-11-27T11:51:33.707-08:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "typescript",
    "ReportedDate": "2013-10-24T20:19:20.57-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "External"
    },
    "Summary": "MSBuild CompileTypeScript target does not check if output is up to date",
    "Type": {
      "Name": "Unassigned",
      "Id": 5
    },
    "VoteCount": 8,
    "Id": 1832
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "We currently don't do incremental build, this is something we would consider for a future version. Assigning to Jon to track.",
      "PostedDate": "2013-10-25T10:42:18.68-07:00",
      "Id": 119701
    },
    {
      "Message": "Where is the source for the TS targets file? I can't seem to find it in the source code for this project.\n\nI have improved this slightly in my build by copying the CompileTypeScript task from the VS targets file to my project files (which overrides the built-in one) and adding Inputs and Output attributes to allow MSBuild to recognize when the task needs to be executed. This is better than the default, since at least the task won't run if no TS file has changed. But it is only a partial solution, since changing a single file causes all TS files to be recompiled.\n\nIf possible I would like to see the partial solution officially released, since overriding a built-in task in my build is brittle.",
      "PostedDate": "2014-05-12T10:39:31.203-07:00",
      "Id": 146312
    }
  ]
}