{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "We would love to fix any performance issues you're having here. We have a number of issues that we're already planning to address but if you can provide any particular files or projects that reproduce this behavior we'd be happy to look into the particulars.",
    "ClosedDate": "2013-06-27T16:45:20.903-07:00",
    "CommentCount": 1,
    "Custom": null,
    "Description": "I had been using the 0.9 Beta with only a few bugs (such as slow compilation and persistent error squiggles). For an Alpha/Beta release it was working surprisingly well.\r\n\r\nGetting more and more irritated by the slow compilation for minor changes (as you do with javascript development) I was glad to see the proper 0.9 release.\r\n\r\nVS2012 which was using 0.5-0.8GB of RAM (quite high, but forgivable considering the amount of files contained, which are mostly typescript files). But since installing 0.9 (non-beta) VS2012 is using 2-3GB of RAM for the same project. And that's before saving any files (with Web Essentials auto-compile on).\r\n\r\nI've now uninstalled the 0.9 release and reinstalled the 0.9 Beta. VS2012 is currently using 0.4GB of RAM.",
    "LastUpdatedDate": "2013-06-27T16:45:20.903-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "typescript",
    "ReportedDate": "2013-06-26T06:42:13.323-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Need More Info"
    },
    "Summary": "High RAM Usage",
    "Type": {
      "Name": "Unassigned",
      "Id": 5
    },
    "VoteCount": 3,
    "Id": 1249
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "I have watched tsc.exe as it compiles each of my 30+ files.  For some files it spikes up to over 100MB of memory for a couple seconds.  Luckily I'm on an i7 with 16GB ram so it's only a minor issue -- but of course my larger issue is that the new compiler has a bug that ultimately won't let me compile my scripts anyway.",
      "PostedDate": "2013-06-26T13:58:38.617-07:00",
      "Id": 104263
    }
  ]
}