{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "",
    "ClosedDate": "2013-08-26T09:09:44.41-07:00",
    "CommentCount": 3,
    "Custom": null,
    "Description": "When attempting to install Typescript 0.9.1.1, the Visual Studio update installer opens with the error message: \"This version of Visual Studio requires a computer with a newer version of Windows.\"\r\n\r\nThe words 'newer version of Windows' are a clickable link which takes me to the VS2013 preview download page.\r\n\r\nI am currently running Windows 7 Professional x64, and Visual Studio 2012 Ultimate.\r\n\r\nThe download info here: http://www.microsoft.com/en-us/download/details.aspx?id=34790 says that both Windows 7 and VS2012 Ultimate are supported by the plugin.\r\n\r\nThis appears to be a bug in the installer.\r\n\r\nThanks for your time!",
    "LastUpdatedDate": "2013-08-26T09:09:44.41-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "typescript",
    "ReportedDate": "2013-08-26T07:18:09.293-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "External"
    },
    "Summary": "Visual Studio requires a computer with a newer version of Windows.",
    "Type": {
      "Name": "Unassigned",
      "Id": 5
    },
    "VoteCount": 1,
    "Id": 1589
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Is your system completely up to date (SP1, any additional updates)? Same for Visual Studio (Tools > Extensions and Updates...)",
      "PostedDate": "2013-08-26T07:30:13.233-07:00",
      "Id": 111138
    },
    {
      "Message": "Checking now - VS is up to date, though I'm installing a nuGet update just to be safe.\n\nI don't have Win7 SP1. Seems like it may be the culprit (thought I had it installed already along with the other 106 important updates when I reinstalled my OS, haha.) Downloading it now, I'll reply once I install it and let you know if that fixes it.\n\nThanks for the quick response!",
      "PostedDate": "2013-08-26T07:41:28.617-07:00",
      "Id": 111139
    },
    {
      "Message": "Yep, that did the trick. Thanks a bunch for the quick response.\n\nNo bug, just an error message with not enough detail. Perhaps the download page should specify Windows 7 SP1 in the system requirements? Might prevent others from bumping up against this in the future.\n\nThanks a lot for your help!",
      "PostedDate": "2013-08-26T07:54:17.04-07:00",
      "Id": 111142
    }
  ]
}