{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "Please file a bug with Web Essentials on that one. Thanks!",
    "ClosedDate": "2014-07-14T09:36:58.173-07:00",
    "CommentCount": 1,
    "Custom": null,
    "Description": "please see this url for description of the issue: http://stackoverflow.com/questions/24420500/typescript-error-runtime-error-cannot-read-property-prototype-of-undefined-wh\r\n\r\ntypescript users should not have to manually order the js files in a bundle. the compiler should be fixed so that the code it geneerates works irrespective of the order of js files. in javascript following code produces error:\r\nvar x = f(2);\r\nvar f = function(x)\r\n{\r\nreturn x * x;\r\n}\r\nbut this does not:\r\nvar x = f(2);\r\nfunction f(x)\r\n{\r\nreturn x * x;\r\n}\r\n\r\ncan you not use above finding to alter the js code geneerated by ts compiler so that it does not give runtime error?\r\n\r\nif not then make the compiler smart so that it can be used to generate a bundle from input files and the compiler takes the burden of ordering the files properly - i am sure this is a doable task.",
    "LastUpdatedDate": "2014-07-14T09:36:58.173-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "typescript",
    "ReportedDate": "2014-07-12T09:54:43.99-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "External"
    },
    "Summary": "please fix this error: Cannot read property 'prototype' of undefined",
    "Type": {
      "Name": "Unassigned",
      "Id": 5
    },
    "VoteCount": 1,
    "Id": 2619
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "i see that the --out compiler option can be used to concatenate the js files and relieves developer from having to manually specify the order of the files (well only sort of, it depends on the <reference> tags that a developer has to manually specify in the ts file). i think the issue can be closed. however, i am having some issues. my project was building successfully in vs. i added <reference> tags and now vs crashes when i hit f6. the other thing i did was to install web essentials. has anyone encountered this and know how to fix? i am using ts v1.0 and vs 2012",
      "PostedDate": "2014-07-12T12:05:50.797-07:00",
      "Id": 152169
    }
  ]
}