{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "",
    "ClosedDate": "2014-05-16T11:08:18.327-07:00",
    "CommentCount": 7,
    "Custom": null,
    "Description": "First of all, congrats on the 1.0RC release. Great to see that we're nearing 1.0. \r\n\r\nUnfortunately though the 1.0RC release has broken TypeScript source debugging in SharePoint 2010 projects in Visual Studio 2013. \r\n\r\nUsing TypeScript in SharePoint 2010 projects has always been tricky since I need to add the .js and .js.map to the project so that the files will be added to the WSP so that the .js and .js.map files can be deployed to the SharePoint site.\r\n\r\nWhilst I totally agree that the .js and .js.map files should be regarded as output and not be source controlled and therefore not be added to the Visual Studio project, for SharePoint 2010 projects this was necessary to get the .js and .js.map files added to the WSP. \r\n\r\nYou can find my request to bring back the option in Web Essentials to add .js and .js.map files to the project automatically [here](http://webessentials.uservoice.com/forums/140520-general/suggestions/5507660-typescript-bring-back-option-to-add-js-and-js-m).\r\n\r\nWhen I upgraded to 1.0RC I started getting errors for all generated .js files like:\r\n\r\nBoth \"Layouts\" and \"Layouts\" contain a file that deploys to the same Package location: Layouts\\MyApplicationName\\Scripts\\app\\Bootstrapper.js\r\n\r\nI had never seen this error before, but I suspect that TypeScript 1.0RC now adds the .js files to the WSP automatically without the need to add the .js file to the Visual Studio project. Great!\r\n\r\nSo I removed all the generated .js files and .js.map files from my project, deployed the project to SharePoint and found the .js files were nicely deployed to SharePoint. Great! \r\n\r\nUnfortunately the .js.map files were not automatically added to the WSP and therefore were not deployed to SharePoint. So I added the .js.map files back to my Visual Studio project to get them added to the WSP and deployed to SharePoint. So now I have both .js and .js.map files deployed to SharePoint again.\r\n\r\nUnfortunately then I found out that TypeScript source debugging would no longer work. That became the show stopper for me and I have now reverted back to TypeScript 0.9.5. \r\n\r\nCan you please fix the source debugging issue? It would also be great if the .js.map files will be automatically added to the WSP like the .js files now are.",
    "LastUpdatedDate": "2017-11-27T11:51:34.217-08:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "typescript",
    "ReportedDate": "2014-02-25T15:35:43.667-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Fixed"
    },
    "Summary": "1.0RTM source debugging broken in SharePoint 2010 project",
    "Type": {
      "Name": "Unassigned",
      "Id": 5
    },
    "VoteCount": 1,
    "Id": 2213
  },
  "FileAttachments": [
    {
      "FileId": 973272,
      "FileName": "SPTypescriptDemo.zip",
      "DownloadUrl": ".\\973272"
    }
  ],
  "Comments": [
    {
      "Message": "Is there a project you can share with us that exhibits this behavior? I'm far from a SharePoint expert and I'm not sure how accurately I'll reproduce your project's environment from guessing at which VS SharePoint Project templates to use (and how to use them).",
      "PostedDate": "2014-02-26T15:31:54.87-08:00",
      "Id": 135216
    },
    {
      "Message": "I've sent you an email Dan. Thanks for your help.",
      "PostedDate": "2014-02-27T08:03:34.8-08:00",
      "Id": 135284
    },
    {
      "Message": "Unfortunately this issue is still present in 1.0 RTW. Debugging using TypeScript source files is still broken. The .js files are automatically added to the WSP, but the .js.map files are not. Can this issue be re-opened please? \n\nThis remains a show-stopper for me. I can only use TypeScript 0.9.5 now. I cannot update Visual Studio either now as I cannot use TypeScript 1.0. With TypeScript shipped as part of Visual Studio 2013 now, how will updates to TypeScript be deployed? Only as part of updates of Visual Studio?",
      "PostedDate": "2014-04-12T06:30:10.197-07:00",
      "Id": 141584
    },
    {
      "Message": "Dan is investigating; pending update.\n\r\n\r** Closed by RyanCavanaugh 04/03/2014 2:19PM",
      "PostedDate": "2014-04-03T14:19:33.23-07:00",
      "Id": 141933
    },
    {
      "Message": "Marked as active, not sure how this might've regressed but we've got some work planned to fix this and related issues with Azure/ASP.NET projects.",
      "PostedDate": "2014-04-17T18:42:20.367-07:00",
      "Id": 142297
    },
    {
      "Message": "Apparently still a problem in VS2013 with Update 4, SharePoint 2013 and TS 1.3.\r\n\r\nWhen I try to debug the TS file, VS locks up and I need to kill the process\r\n\r\nSample project attached.\r\n\r\nThx.\r\n\r\nDave\r\n",
      "PostedDate": "2014-12-09T15:30:46.107-08:00",
      "Id": 167654
    },
    {
      "Message": "Hi Dave,\n\nWe moved the TypeScript project over to GitHub earlier this year.  Because there has been a long time since there was activity on this bug, if it's still repro'ing, you may want to see if there is a corresponding issue on GitHub, or, alternatively, open a new issue.\n\nYou can look through the currently known issues here, including being able to file a new one:\n\nhttps://github.com/Microsoft/TypeScript/issues\n\n",
      "PostedDate": "2014-12-10T08:56:37.153-08:00",
      "Id": 167718
    }
  ]
}