{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "Thanks, we'd love to get to the bottom of issues like this. Can you re-open this with some additional info. What kind of hardware are you doing this compilation on? How many files are in your project? Approximately how many lines of code are your files? Are you using a lot of generics?",
    "ClosedDate": "2013-07-03T12:24:40.797-07:00",
    "CommentCount": 2,
    "Custom": null,
    "Description": "I had the web essentials plugin, but based on Jonathan Turner's comments, I disabled the plugin.  I am still seeing compilation of the project taking at least 10x longer to compile as to compared to the 0.8.x compiler.  It was instant before, now compilation times are averaging 20 to 30 seconds.  I also constantly receive the \"Microsoft Visual Studio is busy\" warning message when working in the project.  If I can enable any kind of debug output or otherwise please let me know.",
    "LastUpdatedDate": "2013-08-13T12:16:17.917-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "typescript",
    "ReportedDate": "2013-07-02T18:27:24.667-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Need More Info"
    },
    "Summary": "TypeScript Compiler performance degradation .9.x",
    "Type": {
      "Name": "Unassigned",
      "Id": 5
    },
    "VoteCount": 4,
    "Id": 1298
  },
  "FileAttachments": [
    {
      "FileId": 700832,
      "FileName": "NEWS.txt",
      "DownloadUrl": ".\\700832"
    }
  ],
  "Comments": [
    {
      "Message": "I found WebEssentials compilation of TypeScript was opening dozens of console tasks and not closing them. Eventually Visual Studio ground to a halt. Have turned off all TypeScript options in WebEssentials and modified the project file to invoke tsc command directly - works fine.",
      "PostedDate": "2013-07-06T16:05:30.64-07:00",
      "Id": 105285
    },
    {
      "Message": "ddd",
      "PostedDate": "2013-07-08T03:55:48.74-07:00",
      "Id": 105377
    }
  ]
}