{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "",
    "ClosedDate": "2013-12-31T09:13:19.463-08:00",
    "CommentCount": 2,
    "Custom": null,
    "Description": "I'm having a lot of trouble reproducing the full extent of the poor performance I'm experiencing after isolating my code down to a small reproducible subset, though I still have an example which seems like it should be a whole lot quicker. Around 3 seconds for around 500 lines of code and a few definition files. Given that I have over 25000 lines of code all up, this adds up. I would like to send a more comprehensive strip-down that can reproduce the issue (a couple thousand lines of code taking 16-17 seconds on an intel i7 processor) but I don't really want to put that much of my code out in the wild. I'd be happy to send it to you guys.\r\n\r\nWhat I *did* notice though, in the process of stripping things down to the example I've attached, is that the compiler was failing to notice missing references in various places, both from one definition file referencing another, and for certain type identifiers which should have thrown errors due to not being defined anywhere. I'm guessing the compiler still has a few bugs in it, and some of those bugs cause major performance hits.\r\n\r\nI've attached an example of the lesser performance issue I mentioned earlier.",
    "LastUpdatedDate": "2013-12-31T09:13:19.463-08:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "typescript",
    "ReportedDate": "2013-12-16T13:37:09.747-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Need More Info"
    },
    "Summary": "Poor compiler performance",
    "Type": {
      "Name": "Unassigned",
      "Id": 5
    },
    "VoteCount": 2,
    "Id": 2022
  },
  "FileAttachments": [
    {
      "FileId": 768874,
      "FileName": "test-case.zip",
      "DownloadUrl": ".\\768874"
    }
  ],
  "Comments": [
    {
      "Message": "3 seconds / 500 LOC is pretty normal (it's really 3 seconds for almost anything). If you can send me a zip file (ryanca@microsoft.com) we can investigate further.",
      "PostedDate": "2013-12-16T14:12:48.39-08:00",
      "Id": 127698
    },
    {
      "Message": "Still waiting on further info, so closing this for now.  Please email Ryan and/or reopen this issue when you have more data we can use to investigate further.  Thanks.",
      "PostedDate": "2013-12-31T09:13:14.783-08:00",
      "Id": 128776
    }
  ]
}