{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "Duplicate error as in https://typescript.codeplex.com/workitem/1491",
    "ClosedDate": "2013-08-12T12:06:36.217-07:00",
    "CommentCount": 3,
    "Custom": null,
    "Description": "(from https://typescript.codeplex.com/discussions/453115)\r\n\r\nI've come to the conclusion that the errors are utterly bogus, and that the actual real error is simply this:\r\n\r\n1>VSTSC : tsc.js(40622, 13) JavaScript runtime error : Unable to get property 'type' of undefined or null reference\r\n\r\nAm I right in thinking this is the new IE JS VM doing it's thing? It appears that I can hit compile over and over, and sometimes (if the luck of the Gods are on my side) it will compile successfully, but most of the time it errors with the above. It's as if my project is too large for the compiler to cope with and by some fluke it will occasionally make it through. But most the time the JS parser is erroring before maybe the compiler has finished building the output file?  Not sure if that's even how it works, but it would make sense given the inconsistent results I'm getting. There is no way on earth that a compiler should work sometimes and not others without changing code in between.\r\n\r\nRight now I can't in all seriousness recommend anyone use TypeScript for any real project. I think it's time to re-evaluate dropping it entirely and returning my framework back to native JavaScript. I'd rather not do this, but this is beyond a joke really.",
    "LastUpdatedDate": "2014-01-10T10:34:33.287-08:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "typescript",
    "ReportedDate": "2013-08-12T07:42:53.09-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Duplicate"
    },
    "Summary": "Seriously broken compiler in 0.9.1",
    "Type": {
      "Name": "Unassigned",
      "Id": 5
    },
    "VoteCount": 2,
    "Id": 1491
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "I too have the same exact problem. And on top of it, when there is an error in one TypeSript file it throws errors in the other TypeScripts that reference the broken TypeScript file and most of the time after correcting the original error, the TypeScript compiler doesn't recognize the fixed code in the referencing TypeScript files until I comment those lines of code out and then remove the comments. Weird.",
      "PostedDate": "2013-08-12T09:38:33.67-07:00",
      "Id": 109454
    },
    {
      "Message": "RyanCavanaugh\n\nYou closed this issue as a duplicate and you referenced this same issue as the duplicate. Can you please provide the duplicate issue # or link?",
      "PostedDate": "2013-08-12T12:26:46.73-07:00",
      "Id": 109501
    },
    {
      "Message": "Sorry, clipboard error. Correct link is https://typescript.codeplex.com/workitem/1465",
      "PostedDate": "2013-08-12T13:09:30.557-07:00",
      "Id": 109510
    }
  ]
}