{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "Can you try updating to the latest Web Essentials and see if you still have the same problem? Please re-open if so. Thanks!",
    "ClosedDate": "2013-01-03T15:20:52.14-08:00",
    "CommentCount": 7,
    "Custom": null,
    "Description": "Hi,\r\n\r\nI have the folowing software:\r\n- Windows 8\r\n- Visual Studio 2012 + TFS\r\n- Web Eseentials 2.2\r\n- Typescript 0.8.1.1\r\n\r\nHere's my problem:\r\nI have Number.ts checked-out and no Number.js generated yet.\r\n\r\nWhen I compile Number.ts for the first time (just by saving it in Visual Studio) is generates the Number.js file (as expected).\r\n\r\nHowever any other attempt to compile Number.ts will not generate a new Number.js and throw off a tsc error \"Write to file failed\". The same happens if I try to compile Number.ts from the command prompt.\r\n\r\nI've already googled this bug had no luck. My colleague has the same software and versions as I (with the exception of the OS, Windows 7 in his PC) but he doesn't have this problem.\r\n\r\nIs this a known bug to be fixed in a soon to come release ? Or should I just install typescript and Web Essentials again ? Any insight or solution is deeply appreciated.\r\n\r\nThanks,\r\nMigGoncalves\r\n\r\n\r\n\r\n\r\nWhen I save a ts file, and trying to generate the corresponding js file, I get the tsc compile error \"write to file failed\".\r\n\r\nIf I try to typescript compile witj tsc in command prompt I also get the same error.",
    "LastUpdatedDate": "2013-08-13T12:02:22.983-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "typescript",
    "ReportedDate": "2012-12-31T05:17:11.117-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "Write to file failed when saving ts file",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 581
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "I have found that when the TS file (Number.ts) is open in Visual Studio this can sometimes happen, but not predictably.\n\nTry turning off the Web Essentials compiler and building normally via Visual Studio.",
      "PostedDate": "2012-12-31T05:30:16.057-08:00",
      "Id": 85080
    },
    {
      "Message": "I have experienced the same issue when working with an inherited class.  By chance, I found that if I go to the file containing the ancestor and hit save there, then the file with the descendant class will now save.",
      "PostedDate": "2012-12-31T11:58:44.43-08:00",
      "Id": 85199
    },
    {
      "Message": "I got the same environment, and i got the latest of everything. Still get the error. Even tried restarting vs and recreating the file. But still the same problem.\nOther TS files compile perfectly... I think it happened when i checked in the last time, the file is not read only though",
      "PostedDate": "2013-01-15T23:29:15.503-08:00",
      "Id": 86216
    },
    {
      "Message": "I take it back that other files work...",
      "PostedDate": "2013-01-15T23:32:40.867-08:00",
      "Id": 86217
    },
    {
      "Message": "I did re-compile all TS files and that seemed to solve it. Must be a dependency that locks it up. I had checked out the bundle and the inherited class, but i'm thinking it might have to do with the references as well.",
      "PostedDate": "2013-01-15T23:36:30.137-08:00",
      "Id": 86218
    },
    {
      "Message": "This issue hasn't been resolved with the latest typescript plugin 0.8.3 and the latest Web Essentials 2.5.1.  Someone please fix this.",
      "PostedDate": "2013-02-27T14:22:53.417-08:00",
      "Id": 91730
    },
    {
      "Message": "\nI'm getting the exact same error when I use IntelliJ / grails.\n\nThe issue is that grails has a lock on the output JavaScript file.\n\nI can use [handle](http://technet.microsoft.com/en-us/sysinternals/bb896655.aspx) to confirm grails has some type of lock on the output JavaScript file.  I can use handle to manually kill the lock and invoke tsc manually and everything works.\n\n__What I need is a way to tell the tsc.exe to ignore any locks on the output JavaScript file and force re-compilation__",
      "PostedDate": "2013-04-03T12:49:24.12-07:00",
      "Id": 95782
    }
  ]
}