{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "Thanks for reporting this! The issue has been fixed and can be tried out in the upcoming 0.9.5 release. We also have a beta available (https://typescript.codeplex.com/wikipage?title=TypeScript%200.9.5%20beta) if you'd like to try it out.",
    "ClosedDate": "2013-11-19T13:25:47.837-08:00",
    "CommentCount": 5,
    "Custom": null,
    "Description": "Just installed latest \"develop\" branch and code that was compiling from Friday churns out dozens of the following error. The error doesn't seem to make sense (since the types it mentions are syntactically identical) and the error message contains a typo, so I assume it's a recent change with a bug.\r\n\r\nTypes '(t: App) => any' and '(t: App) => any' originating in inifinitely expanding type reference do not refer to same named type.\r\n\r\nI'll try to post a MWE if I can find one.",
    "LastUpdatedDate": "2014-01-10T10:34:33.287-08:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "typescript",
    "ReportedDate": "2013-10-28T07:12:26.037-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Fixed"
    },
    "Summary": "Spurious \"inifinitely [sic] expanding type reference\" errors",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 1845
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Looks like it's related to this commit:\n\nhttps://typescript.codeplex.com/SourceControl/changeset/652bf01260ee4dc5768d25883e4dc77f7fb75bac",
      "PostedDate": "2013-10-28T07:33:28.387-07:00",
      "Id": 119852
    },
    {
      "Message": "Seems to be impossible to repro in a single file.",
      "PostedDate": "2013-10-28T07:40:57.95-07:00",
      "Id": 119853
    },
    {
      "Message": "Infinitely expanding recursive types will in some cases cause types to be compared nominally rather than structurally. The error message experience has not been cleaned up yet though so you may see the results of the failed attempt to do a structural comparison when nominal comparison is what is failing. That may or may not be the case here since I can't see your exact code but food for thought while you're debugging issues. You can see the rules for this sort of comparison in section 3.8.7 Recursive Types in the language specification. ",
      "PostedDate": "2013-10-28T10:56:29.46-07:00",
      "Id": 119872
    },
    {
      "Message": "Thanks for reporting, I managed to get a single file repro. we're taking a look.",
      "PostedDate": "2013-10-28T11:08:18.95-07:00",
      "Id": 119877
    },
    {
      "Message": "Ok, that's good. For now I'm continuing with an earlier build from Friday.",
      "PostedDate": "2013-10-28T11:59:01.807-07:00",
      "Id": 119891
    }
  ]
}