{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "As part of our move to GitHub, we're closing our CodePlex suggestions and asking that people move them to the GitHub issue tracker for further discussion.  Some feature requests may already be active on GitHub, so please make sure to look for an existing issue before filing a new one.\n\nYou can find our GitHub issue tracker here:\nhttps://github.com/microsoft/typeScript/issues\n",
    "ClosedDate": "2014-07-28T15:18:09.313-07:00",
    "CommentCount": 11,
    "Custom": null,
    "Description": "When referencing an internal module the syntax:\r\n\r\n/// <reference path=\"someModule.ts\" />\r\n\r\nis utilized. This makes sense if you are using visual studio to modify your typescript files, but looks awkward when using vi or another editor as it is just a comment. This reference tag could be recreated with something more common in any editor like\r\n\r\ninclude SomeModule.ts;\r\n\r\nor even\r\n\r\nreference SomeModule.ts;",
    "LastUpdatedDate": "2017-11-27T11:51:33.707-08:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "typescript",
    "ReportedDate": "2014-06-02T14:20:39.383-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "External"
    },
    "Summary": "Change /// reference syntax",
    "Type": {
      "Name": "Unassigned",
      "Id": 5
    },
    "VoteCount": 3,
    "Id": 2539
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "> as it is just a comment.\n\nIt's just a comment in VS as well.\n",
      "PostedDate": "2014-06-02T14:56:06.95-07:00",
      "Id": 148623
    },
    {
      "Message": "It is more than just a comment to the tsc command line utility. If included, the tsc utility knows that the code references that file and needs to also convert it to javascript.",
      "PostedDate": "2014-06-02T15:21:54.53-07:00",
      "Id": 148626
    },
    {
      "Message": "I assumed that was already understood. I mean it renders like a comment.",
      "PostedDate": "2014-06-02T18:09:42.367-07:00",
      "Id": 148636
    },
    {
      "Message": "My concern is that users of TypeScript who are not using the Visual Studio IDE now have to type a comment in order to tell the TSC command line utility that their code references that file. Here is an example:\n\n```\n// example.ts\n/// <reference path=\"Animal.ts\" />\n\nmodule Zoo {\n\n  mostPopularAnimal: Animal;\n\n}\n```\n\nIf I then run\n\n```\ntsc example.ts\n```\n\nMy example.ts has now generated an example.js file and my Animal.ts has also generated an Animal.js file since I made reference to it. This only happens because of a comment tag which should have no impact on what get's generated. I would propose that instead of utilizing the comment tag to achieve this that the TypeScript language allows a non comment method to achieve this. As far as I can tell by looking at the documentation, \"import\" can be used, but only for modules that are exported, not internal modules like this.\n\n\n",
      "PostedDate": "2014-06-03T09:40:05.593-07:00",
      "Id": 148701
    },
    {
      "Message": "Adding a comment tag shouldn't affect what gets generated is just, like, your *opinion*, man.",
      "PostedDate": "2014-06-03T10:58:54.213-07:00",
      "Id": 148718
    },
    {
      "Message": "I can move this to the discussion forum about the language itself, I just found that link on the home page. It may just be an opinion, but it is an opinion formed out of frustration when my IDE shows the line as a comment but the line is of benefit to the compiler and can not be removed. It shouldn't be that hard to add to the language specification. I think this will help other users adopts TypeScript and use the language. Currently it seems more tailored to Visual Studio IDE users.",
      "PostedDate": "2014-06-03T11:23:02.853-07:00",
      "Id": 148724
    },
    {
      "Message": "_Discussion: https://typescript.codeplex.com/discussions/547457#post1252531\n(good to use links and tie things together for new readers)_\n",
      "PostedDate": "2014-06-03T11:41:18.637-07:00",
      "Id": 148726
    },
    {
      "Message": "I agree that the XML-ish references inside /// comments are a supremely poor design choice (especially, as jamesnw noted, javadoc syntax is used for /*\\* \\*/ comments).\n\nSemantically, not only can they have an effect on which files get compiled, they can have a real effect on the result (!) of the compilation, as I mentioned in https://typescript.codeplex.com/workitem/1693\n\nAll that aside, your core complaint seems to be that you don't like the rendering of the syntax of ///<reference> comments, which is easily worked around by extending the syntax highlighter (something you ought to be able to do in vim).  And/or it shouldn't be too hard to include a separate build step to strip out /// references after running tsc.",
      "PostedDate": "2014-06-03T16:40:16.68-07:00",
      "Id": 148764
    },
    {
      "Message": "Other discussions on this:\nhttps://typescript.codeplex.com/discussions/453886\nhttps://typescript.codeplex.com/discussions/448336\nhttps://typescript.codeplex.com/discussions/433456\n",
      "PostedDate": "2014-06-04T14:25:44.217-07:00",
      "Id": 148870
    },
    {
      "Message": "Keep in mind there are very real consequences to using up space in the available pool of expression level syntax. For example if a future version of JavaScript were to ever add include/reference with different semantics then what happens to all the old TypeScript code that uses this? \n\nWe have previously discussed alternative ways to encode this information though. ",
      "PostedDate": "2014-06-11T17:03:13.95-07:00",
      "Id": 149442
    },
    {
      "Message": "maybe something along the lines of the \"use strict\" bare string/pragma, like:\n\n    \"use:reference path=some/file/.ts\";\n\n",
      "PostedDate": "2014-06-27T11:29:08.31-07:00",
      "Id": 150962
    }
  ]
}