{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "See comments. Thanks!",
    "ClosedDate": "2013-11-22T14:38:41.467-08:00",
    "CommentCount": 4,
    "Custom": null,
    "Description": "Currently, maintaining a language service client works like this\r\n\r\n1. git pull\r\n2. try to build\r\n3. investigate reason for failure\r\n  - is it a bug/regression?\r\n  - is it a language change that requires a code change?\r\n  - is it an API change?\r\n  - hunt through git log for things that might be API changes\r\n  - hunt throught `tsc.ts` and `harness.ts` and ... changes for\r\n      hints on API changes and how to cope with them\r\n\r\nand so on. API changes are nowhere documented or flagged, not even in commit messages.\r\n\r\nIt would be really helpful to have a simple text file documenting API changes, eg:\r\n\r\n```\r\ncommit: <commit> \r\nchange: renamed Script to SourceUnit\r\nreason: because\r\nrequired actions in client code: rename Script to SourceUnit\r\n\r\n...\r\n```\r\n\r\nIf that isn't possible, at least have a standard flag in commit messages: `API change!` to make relevant commits easy to find.",
    "LastUpdatedDate": "2013-11-22T14:38:41.467-08:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "typescript",
    "ReportedDate": "2013-11-22T02:57:26.24-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Postponed"
    },
    "Summary": "source code: Please keep log of API changes",
    "Type": {
      "Name": "Unassigned",
      "Id": 5
    },
    "VoteCount": 2,
    "Id": 1939
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "The API is currently in flux, so we're not quite ready to document and support it.  Until then, the best way to track changes is to watch the check-ins for changes related to the API.\n\nAfter 1.0, we'll work towards a supported API for the language service so that tools can build against a consistent set of calls, which we'll also try to support and document.",
      "PostedDate": "2013-11-22T09:41:45.533-08:00",
      "Id": 123898
    },
    {
      "Message": "\n\r\n\r** Closed by jonturner 11/22/2013 9:41AM",
      "PostedDate": "2013-11-22T09:41:57.653-08:00",
      "Id": 123950
    },
    {
      "Message": "This item is not about documenting or freezing the API (still waiting for the former).\r\n\r\nI'm asking to make it possible to identify API changes in the check-ins (git log), without having to wade through the diff in every single commit.",
      "PostedDate": "2013-11-22T14:12:17.69-08:00",
      "Id": 123951
    },
    {
      "Message": "Often times we have breaking changes that don't affect the VS LS, but do affect other consumers, because the change is dependent on the call order. It's not something we have time or ability to do for the sake of the handful of people who are developing LS consumers pre-1.0.\n\nYour best bet is to check the checkin log for src\\harness\\fourslash.ts, because breaking changes to the language service API will almost always be impactful here.",
      "PostedDate": "2013-11-22T14:38:08.177-08:00",
      "Id": 123957
    }
  ]
}