{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "I'll remove the offending comment.\n\nThe comment above readFile says \"/** Reads a file under /tests */\". That's what it's for. I'm not sure what you expect to happen here.",
    "ClosedDate": "2013-06-05T10:58:17.39-07:00",
    "CommentCount": 2,
    "Custom": null,
    "Description": "I've been heavily using harness/harness.ts so I'm going to just use this thread to report every bug/oddity I find (right now I'm at two, excluding the one I reported yesterday).\r\n\r\nVIM ONLY (may affect other programs): Line 680 has a an unclosed brace in a comment.  Vim with the typescript plugin can't tell the difference and this messes up counting braces for a lot of the program.   This should probably be a bug in the vim plugin for typescript, but I haven't encountered it very much.\r\n\r\nFix:  Just add a commented brace below line 680.\r\n\r\n\r\nTypeScriptLS.addFile can only read files in tests:\r\n\r\naddFile calls readFile (located line 211).\r\nreadFile seems to append tests to any file that doesn't have it in the file path.  This seems unideal.\r\n\r\nProposed Fix: Just removed the lines which appends tests to any file.  This may break tests but I feel like the tests should be fixed instead.\r\n\r\n",
    "LastUpdatedDate": "2013-08-13T10:02:37.557-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "typescript",
    "ReportedDate": "2013-06-05T08:30:59.26-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Postponed"
    },
    "Summary": "More bugs in harness/harness.ts",
    "Type": {
      "Name": "Unassigned",
      "Id": 5
    },
    "VoteCount": 1,
    "Id": 1113
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "I'm curious as to why it's done that way.  \n\nI am using TypeScriptLS heavily in my project and I need to be able to read files anywhere, not just tests (my version of readFiles deals properly with both relative and global path files, but I digress).  This requires me to either change the call to readFiles, or change the readFiles function itself (I chose the latter).  Is there a better fix to enable TypeScriptLS?",
      "PostedDate": "2013-06-05T12:32:29.07-07:00",
      "Id": 102164
    },
    {
      "Message": "I'd really recommend not taking a dependency on the test harness; we often will add checks or behavior that would be undesirable in a non-test project.",
      "PostedDate": "2013-08-13T10:02:37.557-07:00",
      "Id": 109635
    }
  ]
}