{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "Thanks... even with the new detailed steps I've not been able to reproduce this.\n\nSince we made a bunch of fixed in the debugging area, I believe this will be fixed in the next release of the TypeScript extension.",
    "ClosedDate": "2013-10-14T10:56:32.037-07:00",
    "CommentCount": 2,
    "Custom": null,
    "Description": "Hello,\r\nI have installed Typescript 0.9.1.1 into visual studio 2012.\r\nI'm having a problem with statement completion. It is really good when it works,\r\nbut when I debug a part of my webpage the statement completion gets unchecked in the tools menu and I have to recheck auto list members and parameter information to get them working again.\r\nIt keeps on doing this almost every time. Can you think of something I have done which can result in this?\r\n\r\nI've also noticed a bug which I had right after installation.\r\nI could create a TypeScript project or a TypeScript file. But i couldn't right click on the project and add a new TypeScript File since the \"TypeScript File\" option wasn't in the menu (neither on right click -> add, nor in right click -> add ->new item  (were only c# was visible)) It did however work to in the add new option, search for typescript and add it to the project even though it wasn't visible. After I had done that the option \"TypeScript File\" also popped up in the right-click->add menu, so now it works fine. But it is still not visible in the add ->new item menu.  Should it be visible in add->new item?\r\n\r\nThank you for taking the time to read this. :)\r\n\r\n\r\n\r\nHello again, and thank you for your answer.\r\n\r\nI managed to reproduce this fault again when using a Typescript HTML app and implementing the greeter example from the tutorial: http://www.typescriptlang.org/Tutorial/\r\nThis time it got unchecked when I debugged it and introduced some error in the code: \r\n in function greeter(person: Person) I added the lines: \r\n\r\n\tperson.firstname = \"hej\";\r\n\tperson.lastname = +;\r\n\treturn \"Hello, \" + person.firstname + \" \" + person.lastname;\r\n\r\nI pressed run last successful build. (I also had some breakpoints in the code on the first (\"hej\") and third line, but the problem seems to appear anyway)\r\nAnd then when I next time changed the code I noticed that the statement completion was again unchecked.\r\n\r\nThe installed extensions in my Visual Studio are Microsoft Web Developer Tools, Nuget Package Manager and Visual Studio Extensions for Windows Library for JavaScript.\r\n\r\nHere is the complete greeter.ts:\r\n```\r\nclass Student {\r\n\tfullname: string;\r\n\tconstructor(public firstname, public middleinitial, public lastname) {\r\n\t\tthis.fullname = firstname + \" \" + middleinitial + \" \" + lastname;\r\n\t}\r\n}\r\n\r\ninterface Person {\r\n\tfirstname: string;\r\n\tlastname: string;\r\n}\r\n\r\nfunction greeter(person: Person) {\r\n\tperson.firstname = \"hej\";\r\n\tperson.lastname = +;\r\n\treturn \"Hello, \" + person.firstname + \" \" + person.lastname;\r\n}\r\n\r\nvar user = new Student(\"Jane\", \"M.\", \"User\");\r\n//document.getElementById(\"content\").innerHTML = greeter(user);\r\ndocument.body.innerHTML = greeter(user);\r\n```\r\n\r\nand greeter.html:\r\n```\r\n<!DOCTYPE html>\r\n<html>\r\n    <head><title>TypeScript Greeter</title></head>\r\n    <body>\r\n        <script src=\"greeter.js\"></script>\r\n    </body>\r\n</html>\r\n```\r\n\r\nThank you again.\r\n\r\n__New information:__\r\nHello again. Good to know ;)\r\nIt appears to happen all the time. I did a new test today.\r\nI created a new typescript project. \r\nI started by In the options->Text editor-> typescript check the boxes for \"Auto list members\" and \"Parameter information\" under statement completion as before. \r\nI pressed F6.  Added some erroneous code in app.ts (changed window.onload to):\r\n```\r\nwindow.onload = () => {\r\n\tvar el = document.getElementById('content');\r\n\tvar el = \"hej\";\r\n    var greeter = new Greeter(el);\r\n    greeter.start();\r\n};\r\n```\r\npressed F6 again. When I checked options again they were still checked. But when I removed \"var\" in front of the second el (=> el = \"hej\";) and pressed F6 again the statement completion boxes were unchecked again when I entered the tools menu. When I redid it in the same project they were sometimes still checked. But then i tried writing \"el.\" under the second el (=\"hej\")... which off course didn't work. Then I tried \"el.\" before the second one and it didn't work either. And when I then reopened the options to check the boxes they were unchecked again.\r\n\r\nIt seems that I can recreate this issue by just writing, building and sometimes trying to run erroneous code.\r\nIs there something else I can check which might help you?\r\n\r\n(__extra:__ ctrl + space seems to always work)\r\n\r\nThank you again :)",
    "LastUpdatedDate": "2013-10-14T10:56:32.037-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "typescript",
    "ReportedDate": "2013-10-03T06:09:38.903-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Need More Info"
    },
    "Summary": "visual studio - statement completion gets unchecked on debug",
    "Type": {
      "Name": "Unassigned",
      "Id": 5
    },
    "VoteCount": 1,
    "Id": 1750
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "I can't reproduce the 'statement completion' issue you're reporting. Which extensions do you have installed for Visual Studio? What kind of project do you use? An ASP.NET application C# or VB, or a TypeScript HTML app?\n\nThe second issue is fixed in the next release of the TypeScript extension.\n\nClosing the bug for tracking, if you added more information please re-open using the re-open bug button on top.\n\nThanks\n\r\n\r** Closed by paulb 10/04/2013 11:19AM",
      "PostedDate": "2013-10-04T11:19:28.047-07:00",
      "Id": 117772
    },
    {
      "Message": "I haven't been able to repro this either with your new steps. I tried a few other permutations mixing debugging and error producing code to no avail. Are you seeing it consistently happen with those steps? I've never encountered this issue before. Please re-open if you can add more. We just close it so that it's easy to notice when you re-open and add more info, not because we're trying to get rid of you :)\n\r\n\r** Closed by danquirk 10/09/2013 2:22PM",
      "PostedDate": "2013-10-09T14:22:19.097-07:00",
      "Id": 118303
    }
  ]
}