{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "As part of our move to GitHub, we're closing our CodePlex suggestions and asking that people move them to the GitHub issue tracker for further discussion.  Some feature requests may already be active on GitHub, so please make sure to look for an existing issue before filing a new one.\n\nYou can find our GitHub issue tracker here:\nhttps://github.com/microsoft/typeScript/issues\n",
    "ClosedDate": "2014-07-28T15:18:41.44-07:00",
    "CommentCount": 5,
    "Custom": null,
    "Description": "At the command line, the compiler outputs warnings such as \"The property 'src' does not exist on value of type 'HTMLElement'\" with no visual distinction from compiler errors. The only way you know if the error was a warning or error is if the output file is blank.",
    "LastUpdatedDate": "2017-11-27T11:51:33.707-08:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "typescript",
    "ReportedDate": "2012-10-02T12:19:20.72-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "External"
    },
    "Summary": "Compiler does not differentiate between warnings and errors",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 5,
    "Id": 40
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "I agree that sometimes should be flagged as errors rather than warnings, such as syntax errors. However your example should NOT be an error. There is nothing to say that another script on your page isn't setting `HTMLElement.src`.\n\nIt might be nice if we could adjust which warnings are errors for this scenario though.",
      "PostedDate": "2012-10-03T11:42:55.433-07:00",
      "Id": 78460
    },
    {
      "Message": "Couldn't you accomplish that this way:\n\nmodule base {\n  export class Game {\n  }\n}\n\nmodule tictactoe {\n  export class Game extends base.Game {\n  }\n}\n\nvar baseGame = new base.Game();\nvar tttGame = new tictactoe.Game();\n\nThis compiles fine.",
      "PostedDate": "2012-10-03T16:49:05.057-07:00",
      "Id": 78489
    },
    {
      "Message": "Sorry commented on the wrong issue :(",
      "PostedDate": "2012-10-03T16:49:45.51-07:00",
      "Id": 78490
    },
    {
      "Message": "I totally agree, and it sounds like a couple different issues (maybe we can open separate bugs to track).\n\n#1 - Type errors/warnings and bogus source (which produces no output) aren't the same kind of errors.  We should differentiate between them\n\n#2 - Would be awesome if we could opt-in and opt-out of certain kinds of warnings",
      "PostedDate": "2012-10-03T19:12:57.543-07:00",
      "Id": 78496
    },
    {
      "Message": "(sorry for the repost if this pops up twice)\n\nI totally agree that we need a way to adjust which errors/warnings are shown.  \n\nIn this case, like jpoehls says, you'd have to promise that nothing else has set it for the compiler to know for sure that it's an error.",
      "PostedDate": "2012-10-03T19:15:39.443-07:00",
      "Id": 78497
    }
  ]
}