{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "Thanks for logging this issue. We've moved to a new codebase on GitHub; please try your issue against the new compiler (once possible) and log an issue on the GitHub site if it still reproduces",
    "ClosedDate": "2014-07-21T11:54:45.82-07:00",
    "CommentCount": 23,
    "Custom": null,
    "Description": "Hi, \r\n\r\nAfter I update the VS2013 Ultimate from Update 2 RC to Update 2, I simply can not use TypeScript.\r\n\r\nBe more accurate, it will hang when I first active a ts file and try hit any key hang starts. After hang situation finish you could type some characters, then try to save the file hang starts again.\r\n\r\nThe similar situation happens on the VS2012 after I install the TypeScript 1.0.1 powertool. \r\n\r\n\r\nThanks, \r\nJing",
    "LastUpdatedDate": "2017-11-27T11:51:34.217-08:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "typescript",
    "ReportedDate": "2014-05-14T14:04:10.713-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "External"
    },
    "Summary": "TypeScript 1.0.1 hangs in VS2013 Update 2 & VS2012",
    "Type": {
      "Name": "Unassigned",
      "Id": 5
    },
    "VoteCount": 12,
    "Id": 2506
  },
  "FileAttachments": [
    {
      "FileId": 849871,
      "FileName": "installation.txt",
      "DownloadUrl": ".\\849871"
    }
  ],
  "Comments": [
    {
      "Message": "* Turned off all TypeScript auto formatting in Options Setting\n* No Web Essential \n* No Resharper \n\nStill the same.",
      "PostedDate": "2014-05-14T14:07:14-07:00",
      "Id": 146619
    },
    {
      "Message": "Do you have any other Visual Studio extensions installed? \n\nCan you go into Tools -> Options -> Text Editor -> TypeScript -> Formatting and fiddle with the options there? Are you only hanging on newline and ; but not } or paste? In any case that will hopefully unblock you for the moment.",
      "PostedDate": "2014-05-14T14:15:17.78-07:00",
      "Id": 146622
    },
    {
      "Message": "I created a new TypeScript project and it behavior normally when you have 1 ts file.\n\nAfter I dump all the over 150+ typescript files into that solution, suddenly it became not usable.",
      "PostedDate": "2014-05-14T14:21:34.063-07:00",
      "Id": 146626
    },
    {
      "Message": "Be more accurate, it will hang when I first active a ts file and try hit any key then hang starts. After hang situation finish you could type some characters, then try to save the file hang starts again.\n\n",
      "PostedDate": "2014-05-14T14:55:30.87-07:00",
      "Id": 146630
    },
    {
      "Message": "Ok, that's good to know. Are you able to share the project with us so we can debug it (it can be shared privately without a public link)? If not, perhaps a list of any major .d.ts files you're using could help us recreate a similar project.",
      "PostedDate": "2014-05-14T17:58:36.337-07:00",
      "Id": 146662
    },
    {
      "Message": "I am afraid I can not share the project, but I could provide the d.ts files we are using. Do you have an email address so I can send to you?\n",
      "PostedDate": "2014-05-14T18:23:31.127-07:00",
      "Id": 146667
    },
    {
      "Message": "Could you make a dump (using procdump or process explorer) of the process being hang and share it?",
      "PostedDate": "2014-05-14T22:44:08.89-07:00",
      "Id": 146698
    },
    {
      "Message": "Vladiam, here is a [dump.7z](https://dl.dropboxusercontent.com/u/5411442/dump.7z) file which contains 3 dump files. Each file about 60mb after unzip.",
      "PostedDate": "2014-05-15T00:15:33.29-07:00",
      "Id": 146708
    },
    {
      "Message": "I also have the same problem. After installing Update 2... Typescript totally disappears from Visual Studio 2013.\n\nI remove all extensions and .ts file are not recognized, no entries in \"Options\" settings. I'll try to completely reinstall Visual Studio...",
      "PostedDate": "2014-05-15T06:03:13.683-07:00",
      "Id": 146733
    },
    {
      "Message": "Seems that these delays are caused by oddities in TypeScript project system when handling events from AnkSvn. Can you try to disable this plugin and check if VS still hangs?",
      "PostedDate": "2014-05-15T10:40:48.223-07:00",
      "Id": 146763
    },
    {
      "Message": "Yes, you are right, the AnkSVN cause the hang. Good to know.",
      "PostedDate": "2014-05-15T13:27:22.07-07:00",
      "Id": 146785
    },
    {
      "Message": "I have the same issues as jingzheshan. But I don't know if it is related to typescript or vs update 2.\n\nUsing procexp.exe:\n\"devenv.exe!IsAssertEtwEnabled\" <- full cpu on a while after saving (even the simplest html file)\n\n\"clr.dll!GetMetaDataInterfaceInterfaceFromPublic\" and \"msvcrt.dll!_beginthereadex\" using normal.\n\nSearching: http://connect.microsoft.com/VisualStudio/feedback/details/873579/high-cpu-usage-possibly-after-updating-to-update-2\n\nBut I don't have any of those plugins (or any other).\n\nUpdate:\nI disabled Source Control -> Microsoft Git Provider. And it seems to run better (The IsAssertEtwEnabled cpu usage disappeared). Not sure if fixed. Still using lot of cpu while editing, but maybe that's normal. \nI didn't have any of these problem with VS Update 1.\n\nRegards.",
      "PostedDate": "2014-05-15T20:46:49.887-07:00",
      "Id": 146821
    },
    {
      "Message": "Same issue as soywiz, editing in VS impossibly slow until disabling Microsoft Git Provider (ProcExp also churning on IsAssetEtwEnabled).",
      "PostedDate": "2014-05-19T04:24:46.027-07:00",
      "Id": 147031
    },
    {
      "Message": "I also disabled Source Control -> Microsoft Git Provider, CPU still spikes but the editor seems more responsive (FYI I have Resharper 8.2 and StyleCop 4.7.9 enabled and no other third party extensions). ",
      "PostedDate": "2014-05-20T01:06:38.003-07:00",
      "Id": 147147
    },
    {
      "Message": "I am currently working on a large project with typescript files and visual studio stops responding as soon as I touch a typescript file. We are using ankhsvn so based on the comments above I have deinstalled ankhsvn and the problem went away. Still visual studio is using more CPU then say a c# project, but at least we can work with visual studio.\r\n\r\nWhen running Process monitor Visual studio seems to be generating the same set of events over and over again as it hangs when ankhsvn is installed and the typescript file is touched. When you wait a long time it can recover from 'no responding' however as soon as you save the file, it stops responding again.\r\nFor now we are working without a source control plugin in visual studio, but I must say it is miss, and hampers with speed of development.\r\n\r\nI voted this up so I hope you guys can reproduce the behavior.\r\n\r\nI have visual studio professional with update 2 installed with some plugins:\r\nResharper 8.2 \r\nStyleCop 4.7\r\n\r\nVisual studio 2012 is NOT installed on the machine. \r\nAttached is the complete setup of visual studio.\r\n\r\n\r\n\r\n ",
      "PostedDate": "2014-05-25T15:03:30.16-07:00",
      "Id": 147656
    },
    {
      "Message": "Not sure if helps a bit more, but I usually experience a long lag in the editor response after some time of development.  I usually have to restart VS, then it goes away.  This almost always seems to happen after I take my laptop out of a long sleep/hibernation.  I've also disabled extensions (I only have power tools added on top the defaults), but it seems to keep happening (eventually).  It may be due to a resource leak perhaps...?  Since a restart is required after disabling extensions, disabling them may only temporarily fix and delay the inevitable.",
      "PostedDate": "2014-05-29T18:47:15.373-07:00",
      "Id": 148326
    },
    {
      "Message": "_(BTW: This seems to happen to me in previous TS version as well)_",
      "PostedDate": "2014-05-29T18:48:19.283-07:00",
      "Id": 148327
    },
    {
      "Message": "I've the same problem, saving changes in ts files does not work in most cases. I've kinda similar setup like Jing. I've had no problems with VS2013 Update 2RC, but after installing Update 2 Release, thing get worse.\n\nI get this two events before crash:\n\n```\nApplication: devenv.exe\nFramework Version: v4.0.30319\nDescription: The process was terminated due to an unhandled exception.\nException Info: System.IO.IOException\nStack:\n   at System.Runtime.CompilerServices.AsyncMethodBuilderCore.<ThrowAsync>b__5(System.Object)\n   at System.Threading.QueueUserWorkItemCallback.WaitCallback_Context(System.Object)\n   at System.Threading.ExecutionContext.RunInternal(System.Threading.ExecutionContext, System.Threading.ContextCallback, System.Object, Boolean)\n   at System.Threading.ExecutionContext.Run(System.Threading.ExecutionContext, System.Threading.ContextCallback, System.Object, Boolean)\n   at System.Threading.QueueUserWorkItemCallback.System.Threading.IThreadPoolWorkItem.ExecuteWorkItem()\n   at System.Threading.ThreadPoolWorkQueue.Dispatch()\n   at System.Threading._ThreadPoolWaitCallback.PerformWaitCallback()\n\n```\n\nand then \n\n```\nFaulting application name: devenv.exe, version: 12.0.30501.0, time stamp: 0x5361f453\nFaulting module name: KERNELBASE.dll, version: 6.3.9600.17055, time stamp: 0x532943a3\nException code: 0xe0434352\nFault offset: 0x00011d4d\nFaulting process id: 0x1af4\nFaulting application start time: 0x01cf84eb05501cac\nFaulting application path: C:\\Program Files (x86)\\Microsoft Visual Studio 12.0\\Common7\\IDE\\devenv.exe\nFaulting module path: C:\\Windows\\SYSTEM32\\KERNELBASE.dll\nReport Id: f944da2f-f0ec-11e3-82dc-000c2929b030\nFaulting package full name: \nFaulting package-relative application ID: \n```",
      "PostedDate": "2014-06-10T15:32:41.93-07:00",
      "Id": 149320
    },
    {
      "Message": "Same issue here on 2 different PC's.  ~50% CPU use and massive delays trying to edit the TS files even on a code i7 16GB machine.  We didn't have this issue with 1.0RC.  Uninstalled Web essentials and resharper but that didn't help.\n\nI've had one member of staff unable to work all day because of this.",
      "PostedDate": "2014-06-30T11:56:38.777-07:00",
      "Id": 151168
    },
    {
      "Message": "I've tried this on various PC's now with completely fresh installations.  As soon as I open our large-ish typescript solution everything becomes unusable.\n\nI can provide remote access if needed to diagnose this.",
      "PostedDate": "2014-07-01T10:28:12.47-07:00",
      "Id": 151261
    },
    {
      "Message": "I already reported this issue as occurring on my old laptop. \n\nNow I am on a new system and the same issue with typescript on large projects. Editing a file that has not been touched before, or saving a file in a project with a more then a few typescript files (+/-150) with the ahnksvn source-control plugin enabled, takes some minutes to complete.\n\nDisabling the source control plugins also takes some time, when the plugin is disabled all works fine. \nThe problem also occurs with other source control plugins in combination with typescript.",
      "PostedDate": "2014-07-07T11:45:29.573-07:00",
      "Id": 151770
    },
    {
      "Message": "We have a fix for the original issue with source control extensions in VS2013 Update 3 RC. Please give it a try and let us know if you see any difference.\nVS2013 Update 3 RC is available for download at: [http://support.microsoft.com/kb/2933779](http://support.microsoft.com/kb/2933779)\n",
      "PostedDate": "2014-07-08T09:01:03-07:00",
      "Id": 151847
    },
    {
      "Message": "I installed Update 3 RC and the problem described above has been fixed. \n\nChanging the source control provider of the solution from ankhsvn to none would normally hang vs2013 update 2, but with update 3 RC it changes instantly. \nEditing a ts file would take a minute or 2 before you can actually edit, no the file is checkout instantly and we can immediatly begin editing.\n\nSo great stuff, thanks for the work!",
      "PostedDate": "2014-07-15T00:43:22.46-07:00",
      "Id": 152418
    }
  ]
}