{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "We have no way of correctly merging the 2 types, and in the general case that is probably not what the user intended.\n\nThe best way to show what you intend is to define the attr member in moo as containing both an x and y member.",
    "ClosedDate": "2013-04-10T16:19:52.127-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "When an interface extend two interfaces with overlapping object declarations something odd happens. Consider the following two simple interfaces:\r\n```\r\ninterface foo{\r\n    attr:{\r\n        x:number;\r\n    };\r\n}\r\ninterface bar{\r\n    attr:{\r\n        y:number;\r\n    };\r\n}\r\n```\r\nWhen making a third interface that extends both of these interfaces and using an object that implements it something odd happens. Consider the following piece of code:\r\n```\r\ninterface moo extends foo, bar{\r\n}\r\nvar z: moo;\r\nz.attr.x;\r\n```\r\nIf the interfaces are inherited in this order z.attr.x will be a valid property, but z.attr.y will not be valid. Stating that y does not exist on the object. If the orde was switched around and bar was extended first and then foo. The compiler will complain that z.attr.x does not exist.\r\n\r\nTo fix this the extending interface must declare the attr object itself. When this is done the compiler will complain when not all members of its extended interface are correctly defined. I understand why this is done for functions but objects should be able to merge and hand typing it is not really that great.\r\n\r\nThere is no error saying that you have done something wrong when extending the interfaces.\r\n\r\nIt would be great if the objects defined in interfaces could be merged and the previous code example would work. Or what would be less great butt still an improvement is throwing an error when the conflict arises.",
    "LastUpdatedDate": "2013-04-10T16:19:52.127-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "typescript",
    "ReportedDate": "2013-04-09T03:59:41.56-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "By Design"
    },
    "Summary": "Merging object interfaces",
    "Type": {
      "Name": "Unassigned",
      "Id": 5
    },
    "VoteCount": 1,
    "Id": 893
  },
  "FileAttachments": [],
  "Comments": []
}