{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "This should be fixed now",
    "ClosedDate": "2013-08-16T15:02:55.493-07:00",
    "CommentCount": 4,
    "Custom": "lukeh",
    "Description": "In Section 1.4, an example uses the constructor shorthand for populating an objects fields:\r\n\r\n```TypeScript\r\nclass CPoint {\r\n    constructor (public x: number, public y: number) { }\r\n} \r\n```\r\n\r\nThis shorthand is not introduced until much later in the document.  Problematically, one cannot understand this example (and is quite confused by it!) if one does not know that this constructor syntax will set the object's x and y field to numbers.",
    "LastUpdatedDate": "2017-11-27T11:51:34.097-08:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "typescript",
    "ReportedDate": "2013-01-16T11:57:42.227-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Fixed"
    },
    "Summary": "Dependency issue in Language Specification 0.8",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 612
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "You don't have to restructure the document.  Just don't use the shortcut that has not yet been documented and instead add two lines for a constructor that explicitly assigns the two fields and you're done.\n",
      "PostedDate": "2013-01-16T13:42:49.817-08:00",
      "Id": 86302
    },
    {
      "Message": "Thanks for reporting this. It's not worth the time investment that would be required to restructure the document to make sure it has no forward references. The spec isn't intended for casual audiences -- it's unlikely that anyone is going to actually understand it on their first read-through anyway.\n\r\n\r** Closed by RyanCavanaugh 01/16/2013 1:23PM",
      "PostedDate": "2013-01-16T13:23:30.783-08:00",
      "Id": 86370
    },
    {
      "Message": "The fix isn't as hard as was presumed is dismissing the issue..  It's a matter of replacing one line with two lines (see my other comment).  I'd even be happy to provide them.",
      "PostedDate": "2013-01-17T09:24:16.867-08:00",
      "Id": 86371
    },
    {
      "Message": "@StuartSchechter - The syntax in question is actually introduced 3 pages later during the 'classes' part of the introduction section.  But I agree that the initial example in 1.4 should be kept simpler so that it can focus on structural subtyping.  We'll plan to make this change.",
      "PostedDate": "2013-01-17T16:49:55.267-08:00",
      "Id": 86442
    }
  ]
}