{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "This bug has been fixed. If you're still seeing this issue, please re-open the bug (click \"Re-open Issue\" below the \"ISSUES\" tab). Thanks!",
    "ClosedDate": "2013-08-07T11:59:11.07-07:00",
    "CommentCount": 4,
    "Custom": null,
    "Description": "Hi,\r\n\r\nWhen using the Visual Studio plugin for a while, everything will keep taking longer and longer to complete. At startup Intellisense will show up immediately when I type a dot. However after some while it will take up to five seconds for Intellisense to show. It's not just Intellisense though. When typing some text I see a notable delay between the keypress and the character actually appearing on screen.\r\n\r\nI do not have this problem with C++ projects.",
    "LastUpdatedDate": "2014-01-10T10:34:33.287-08:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "typescript",
    "ReportedDate": "2013-07-13T15:02:55.383-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Fixed"
    },
    "Summary": "Visual Studio slowing down",
    "Type": {
      "Name": "Unassigned",
      "Id": 5
    },
    "VoteCount": 3,
    "Id": 1341
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Here's the main problem - VS will spawn multiple instances of TSC in parallel.\n\nhttps://typescript.codeplex.com/discussions/450232\n\n",
      "PostedDate": "2013-07-16T12:02:27.177-07:00",
      "Id": 106185
    },
    {
      "Message": "Yes, memory increases over time. When I start VS and open my project containing 14 .ts files and open all of the files, the memory usage is around 300 MB. Over time memory starts piling up to ~1000 MB. This is when VS starts slowing down.\n\nI don't see any tsc.exe instances running, though.\n\nI'm using Typescript v0.9.0.1 in combination with VS Ultimate 2012. This happens with and without Web Essentials 2.7 enabled. \n\n-----\n\nAs I am typing this, I have checked the Typescript version by clicking TOOLS > Extensions and Updates, and I've checked the VS version under HELP > About ... , and suddenly VS is lightning fast again.\n\nIt could be some garbage collector who just decided to run, but I'm reporting it anyway.",
      "PostedDate": "2013-07-20T13:16:49.147-07:00",
      "Id": 106771
    },
    {
      "Message": "And I don't know why that previous text is bold... :)",
      "PostedDate": "2013-07-20T13:17:51.547-07:00",
      "Id": 106772
    },
    {
      "Message": "Thanks for reporting this, we are actively working on mitigating the performance and memory consumption regressions we introduced. In order to verify this is a new or a know issue, we need a  little more information. \n\nDo you seen an increase in memory consumption at the same time? \n\nWhich exact version of the TypeScript plug-in are you using?\n\nAre you using any third-party extensions, e.g. Web Essentials, which version and which settings?\n\nWhich version of Visual Studio are you using? e.g. VS Ultimate 2012, or VS Web Express 2013 etc.\n\nWhat's the size of your project? How many TypeScript files, any particular large files?\n\nDo you extensively use external modules? (e.g. Do you use require.js in your project?)\n\nThanks again for reporting!\n\nClosing for more info, please re-open after adding the requested information. This helps us keep track of the active issues.\n\n\r\n\r** Closed by paulb 07/15/2013 9:50AM",
      "PostedDate": "2013-07-15T09:50:49.977-07:00",
      "Id": 106773
    }
  ]
}