{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "Yep, you may have to log off / log in in some cases for the updated PATH variable to get picked up correctly.",
    "ClosedDate": "2012-11-26T13:46:25.53-08:00",
    "CommentCount": 5,
    "Custom": null,
    "Description": "I have a project that compile fine with typescript 0.8.0 but with 0.8.1 the typescript compiler returns error code 9009..\r\nI created a new project, tried to compile and get the same error ...\r\n\r\n\r\n",
    "LastUpdatedDate": "2015-01-08T04:08:08.857-08:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "typescript",
    "ReportedDate": "2012-11-16T01:07:47.343-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "After update 0.8.1 , can not compile ",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 433
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "This is the compiler output\n\nTask \"Exec\"\n1>  tsc --sourcemap \"C:\\Projects\\VS2010\\Testen\\TypeScriptHTMLApp1\\TypeScriptHTMLApp1\\app.ts\"\ntsc is not recognized as an internal or externale command, program or batch file\n\nThe exec command in my project file :\n<Exec Command=\"tsc$(TypeScriptSourceMap) @(TypeScriptCompile ->'&quot;%(fullpath)&quot;', ' ')\" />",
      "PostedDate": "2012-11-16T05:26:49.297-08:00",
      "Id": 82598
    },
    {
      "Message": "Apparently, I had to sign off my user and sign on again, to have my PATH settings changed... after installation it still pointed to the 0.8.0 folder.",
      "PostedDate": "2012-11-16T06:29:49.967-08:00",
      "Id": 82608
    },
    {
      "Message": "I did sign off and sign in again and I still have the same error\n\nFor me the error is :\n\nError\t1\tThe command \"\"C:\\Program Files (x86)\\Microsoft SDKs\\TypeScript\\tsc\" --sourcemap  --target ES5  \"c:\\MyWork\\test\\test\\Test.ts\"\" exited with code 9009.\tc:\\MyWork\\test\\test\\test.csproj\t212\t5\ttest\n",
      "PostedDate": "2015-01-05T06:55:42.247-08:00",
      "Id": 169408
    },
    {
      "Message": "Hi geardoom3,\n\nThe CodePlex site is no longer used to track issues.  We've moved to GitHub: https://github.com/microsoft/typescript\n\nTaking a look at the error message, this looks like a very old project that was not migrated to a 1.0 compiler.  You can see it in the filepath: C:\\Program Files (x86)\\Microsoft SDKs\\TypeScript\\tsc.  More recent versions would have the version of TypeScript in the filepath (eg, for me it would be: C:\\Program Files (x86)\\Microsoft SDKs\\TypeScript\\1.4\\tsc)\n\nYou may need to create a new project and copy your existing files into it so that you have the updated configuration bits you need.",
      "PostedDate": "2015-01-06T08:18:39.523-08:00",
      "Id": 169547
    },
    {
      "Message": "Ah great it works thank you very much.",
      "PostedDate": "2015-01-08T04:08:08.857-08:00",
      "Id": 169692
    }
  ]
}