{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "As part of our move to GitHub, we're closing our CodePlex suggestions and asking that people move them to the GitHub issue tracker for further discussion.  Some feature requests may already be active on GitHub, so please make sure to look for an existing issue before filing a new one.\n\nYou can find our GitHub issue tracker here:\nhttps://github.com/microsoft/typeScript/issues\n",
    "ClosedDate": "2014-07-28T15:18:40.77-07:00",
    "CommentCount": 2,
    "Custom": null,
    "Description": "From: https://typescript.codeplex.com/discussions/454606\r\n\r\n\"I have discovered that there's a tsc.exe AND a tsc.js ... I take it the executable has come via the Visual Studio plugin. Now I have to decide what to do about it as both are in the path. Can we not simply add a watch flag to tsc.exe?\"",
    "LastUpdatedDate": "2017-11-27T11:51:33.707-08:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "typescript",
    "ReportedDate": "2013-09-09T08:27:46.04-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "External"
    },
    "Summary": "--watch missing from 0.9.1.1 build in Windows",
    "Type": {
      "Name": "Feature",
      "Id": 1
    },
    "VoteCount": 2,
    "Id": 1662
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Worth noting the workaround is super easy. Didn't occur to me I can simple enter \"tsc.cmd\" explicitly to get the powershell command running, and this provides a suitable solution at this time. Not sure if tsc.exe is faster than the node version, but if it is, I'll still put my vote in for a native watch switch.",
      "PostedDate": "2013-09-09T08:30:02.617-07:00",
      "Id": 112860
    },
    {
      "Message": "This is by design at the moment but I've marked it as a suggestion for Jonathan to handle. The basic issue is that node.js provides us easy free access to the ability to watch the file system and implement this easily on the command line, while other hosts do not.",
      "PostedDate": "2013-09-09T13:25:40.687-07:00",
      "Id": 112901
    }
  ]
}