{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "As part of our move to GitHub, we're closing our CodePlex issues and suggestions and asking that people move them to the GitHub issue tracker for further discussion.  Some issues and feature requests may already be active on GitHub, so please make sure to look for an existing issue before filing a new one.\n\nYou can find our GitHub issue tracker here:\nhttps://github.com/microsoft/typeScript/issues\n",
    "ClosedDate": "2014-07-28T15:20:16.38-07:00",
    "CommentCount": 3,
    "Custom": null,
    "Description": "Hi, love TypeScript but I'm running into a few problems in my first big project.\r\n\r\nEverything seemed to be working fine with regards to performance and intellisense until Visual Studio 2013 Update 2...  Since then TypeScript support is not working all the time.  Sometimes when you type \".\" and wait for 20 - 30 seconds it will popup, but most of the time not at all.\r\n\r\nResetting Visual Studio usually fixes it, but this happens multiple times per day which is disappointing to say the least.\r\n\r\nIt seems like the pre-release version of TypeScript I had installed seemed to work better than the 1.0 version that comes with Update 2.\r\n\r\nALSO something else I noticed was that it seemed the bigger my files got in code size the slower the editor is going.  (moving up a line with keyboard arrow takes 2 - 3 seconds or more).  This usually seems to be solved with a restart of VS as well.\r\n\r\nCan someone please help?  I'm losing valuable time on my project...\r\n\r\nThanks!\r\n\r\nJames",
    "LastUpdatedDate": "2014-07-28T15:20:16.38-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "typescript",
    "ReportedDate": "2014-06-24T11:01:27.667-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "External"
    },
    "Summary": "Intellisense not always working in VS 2013 Update 2",
    "Type": {
      "Name": "Unassigned",
      "Id": 5
    },
    "VoteCount": 2,
    "Id": 2576
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Do you have any Visual Studio extensions running? Are you using a source control plugin?",
      "PostedDate": "2014-06-24T12:19:26.013-07:00",
      "Id": 150636
    },
    {
      "Message": "Yes, I have Web Essentials and we are hooked up to TFS.\n\nALSO: When I was experimenting with this problem yesterday and closed ALL my VS windows (there were a few of them) intellisense started working right away again.  Maybe its just a memory issue...  Not sure.",
      "PostedDate": "2014-06-25T03:08:34.49-07:00",
      "Id": 150677
    },
    {
      "Message": "@jpscott, there is a [discussion item describing the same problem](https://typescript.codeplex.com/discussions/548271).\n\nWhen having to wait the 20-30 seconds you will probably see \"Refreshing...\" on the class list box (at the top of the editor), I guess.\n\nThis is a good description of the problem.",
      "PostedDate": "2014-06-25T09:47:36.197-07:00",
      "Id": 150701
    }
  ]
}