{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "Thanks for the info.. we believe we have a more robust installer for the next release of 0.9.5.",
    "ClosedDate": "2013-10-24T18:04:23.797-07:00",
    "CommentCount": 5,
    "Custom": null,
    "Description": "I've tried several times to get the latest build 0.9.1.1 to install into the newly released Visual Studio 2013 RTM with no luck.\r\n\r\nWhile installing, it says that it's setting everything up for visual studio, but nothing actually happens. The installer doesn't even install the typescript SDK. No tsc.exe can be found anywhere after installation, even though it says it was successful (I'm pulling my hair out at this point). When I uninstall it, it errors out and points me to the log, which I pasted here: http://pastebin.com/FfPnNJ1r\r\n\r\nAny ideas? I even tried re-installing Visual Studio. I should mention that before this install, it was working just fine when I had both VS 2012 and 2013 RC running side-by-side. I uninstalled both of those programs and the TypeScript plugin, to have a fresh install of the VS 2013 RTM version.\r\n\r\nAny ideas?",
    "LastUpdatedDate": "2013-10-24T18:04:23.797-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "typescript",
    "ReportedDate": "2013-10-22T16:12:07.287-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Fixed"
    },
    "Summary": "Does not install on VS 2013 RTM",
    "Type": {
      "Name": "Unassigned",
      "Id": 5
    },
    "VoteCount": 1,
    "Id": 1827
  },
  "FileAttachments": [
    {
      "FileId": 747812,
      "FileName": "VSSS.jpg",
      "DownloadUrl": ".\\747812"
    }
  ],
  "Comments": [
    {
      "Message": "Just to clarify, what OS is this on? To make sure I understand, this config worked:\n\n1. Install VS2012\n2. Install VS2013 RC\n3. Install TypeScript 0.9.1.0, no errors\n\nThen you tried:\n\n1. Uninstalling TypeScript 0.9.1.0?\n2. Installing TypeScript 0.9.1.1, error\n\nThen:\n\n1. Uninstall TypeScript 0.9.1.0?\n2. Uninstall VS2013 RC\n3. Uninstall VS2012\n4. Install VS2013 RTM\n5. Install TypeScript 0.9.1.1, error\n\nIs that right?\n\nThe log error is a little weird looking:\n\n```\n135.[0E8C:0A2C][2013-10-22T15:50:01]i000: MUX:  ExecuteError: Package (TypeScript_MSI.msi) failed: Error Message Id: 1316 ErrorMessage: A network error occurred while attempting to read from the file: C:\\Windows\\Installer\\TypeScript_MSI.msi\n```\n\nMaybe redownload the MSI and save it somewhere and run it from there.\n\n\n",
      "PostedDate": "2013-10-23T11:57:05.547-07:00",
      "Id": 119382
    },
    {
      "Message": "The first procedure to install is correct and then the 3rd. I upgraded to 0.9.1.1 successfully with both vs2012 and vs2013 RC installed. I only had the error on the 3rd procedure you mentioned.\n\nYes, that error bothered me as well... Why would it be a network error? You say download the MSI again, but the installer is not in an MSI format... The Installer is an exe which contains those packages. If I could get the MSI by itself, I would... Is that possible?",
      "PostedDate": "2013-10-23T15:32:59.037-07:00",
      "Id": 119424
    },
    {
      "Message": "Oh, and this is on Windows 7 Professional, 64-bit\nDidn't see that question till just now.",
      "PostedDate": "2013-10-23T22:07:50.133-07:00",
      "Id": 119468
    },
    {
      "Message": "Ok, so I just tried to do a repair on it and I have a program which monitors my filesystem so I found the TypeScript.msi at the following location after the repair:\r\nC:\\ProgramData\\Package Cache\\{DE7A8AA9-C951-4E6C-B87F-AA8FA53919FC}v0.9.1.1\\packages\\TypeScript_CORE\r\n\r\nEven after the repair said it was successful, it was not. I decided to execute the TypeScript.msi myself and see what happens. TypeScript installs into the Microsoft SDKs/TypeScript folder finally, with all the necessary files including the tsc.exe however it still does NOT install into Visual Studio. I repeatedly get this message (In the attached screen shot) when I go to create a typescript project in Visual Studio.",
      "PostedDate": "2013-10-23T22:24:09.687-07:00",
      "Id": 119469
    },
    {
      "Message": "I figured it out. Evidently there were traces of the old Visual Studio path within the registry. Once I removed those references, it installed correctly.",
      "PostedDate": "2013-10-24T12:04:57.767-07:00",
      "Id": 119566
    }
  ]
}