{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "",
    "ClosedDate": "2013-07-17T14:52:45.143-07:00",
    "CommentCount": 4,
    "Custom": null,
    "Description": "As requested the log info for the bug found when attempting to debug a web app containing TypeScript which causes VS2012 to crash.",
    "LastUpdatedDate": "2013-07-17T14:52:45.143-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "typescript",
    "ReportedDate": "2013-07-13T06:26:59.52-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Need More Info"
    },
    "Summary": "TypeScript Debug Engine - part 2",
    "Type": {
      "Name": "Unassigned",
      "Id": 5
    },
    "VoteCount": 1,
    "Id": 1337
  },
  "FileAttachments": [
    {
      "FileId": 704257,
      "FileName": "TypeScriptDebugEngineIssue.docx",
      "DownloadUrl": ".\\704257"
    },
    {
      "FileId": 704258,
      "FileName": "ActivityLog.xml",
      "DownloadUrl": ".\\704258"
    }
  ],
  "Comments": [
    {
      "Message": "Can you reproduce the issue while running `devenv` with the `/log` parameter, then upload those same files again? We might be able to get the crash data from what we have here, but it's not available yet from the reporting server. We need a call stack (or repro project we can run here) to diagnose the issue.\n\nPlease use the \"re-open\" button on this form once you have that data.\n\nThanks again for helping us with the issue - apologies that you're running into this",
      "PostedDate": "2013-07-15T15:36:35.823-07:00",
      "Id": 106105
    },
    {
      "Message": "(see comments - please reopen this issue when you can. Thanks!)\n\r\n\r** Closed by RyanCavanaugh 07/15/2013 3:36PM",
      "PostedDate": "2013-07-15T15:36:55.073-07:00",
      "Id": 106137
    },
    {
      "Message": "Hi Ryan,\r\n\r\nThe content I previously sent was produced running devenv with the /log parameter.\r\n\r\nWhile I can repeat the exercise I would prefer to understand how I can provide you with exactly the info you need.\r\n\r\nJust so you know this bug means that I cannot press F5 and debug where any component project contains TypeScript because VS2012 U3 blows up.  Instead I Start without debugging and debug using the browser...\r\n\r\nRegards\r\nAndy",
      "PostedDate": "2013-07-16T00:56:21.887-07:00",
      "Id": 106138
    },
    {
      "Message": "This fault looks identical to an issue we fixed quite a while back (see https://typescript.codeplex.com/workitem/551 ).  Can you confirm for me which TypeScript version you are running (from the ActivityLog.xml it appears to be the latest – 0.9.0.1).\n\nCould you please scan your drive to see if you have any older copies of TypeScriptDebugEngine.dll hanging around (the faulting DLL)? My concern is a prior upgrade or uninstall didn’t clean up properly, and you’re hitting an old bug, even if it appears you have a newer version installed.\n\nIf this doesn’t explain it, could you please detail for me the setup on your machine (i.e. any other VS extensions installed such as Web Essentials or ReSharper), and the exact steps you are taking when this problem occurs.  We are not seeing this ourselves in testing, and are not seeing this reported by other users, so it may be something very specific to your environment.  If you’re able to provide a project and/or build steps also this would help.  I expect this will be hard to repro for us, so any data to help narrow it down would be great.\n\nPlease reopen this same issue and attach the data when you have it.  It shouldn’t be necessary to create a brand new issue.  \n\nThanks!\n",
      "PostedDate": "2013-07-17T14:52:39.263-07:00",
      "Id": 106353
    }
  ]
}