{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "As part of our move to GitHub, we're closing our CodePlex suggestions and asking that people move them to the GitHub issue tracker for further discussion.  Some feature requests may already be active on GitHub, so please make sure to look for an existing issue before filing a new one.\n\nYou can find our GitHub issue tracker here:\nhttps://github.com/microsoft/typeScript/issues\n",
    "ClosedDate": "2014-07-28T15:18:56.38-07:00",
    "CommentCount": 2,
    "Custom": null,
    "Description": "Hi, here is the repro (using 0.8.2 and Visual Studio 2012):\r\n\r\n* Create a new TypeScript project.\r\n* Add a declarations file Foo.d.ts with content:\r\n\r\n```\r\ninterface IFoo {\r\n\r\n}\r\n```\r\n* Add a TypeScript file File A with content\r\n\r\n```\r\n/// <reference path=\"Foo.d.ts\" />\r\n\r\nclass Greeter {\r\n\r\n    private foo: IFoo;\r\n}\r\n```\r\n* Compile the project and it should compile fine.\r\n* Remove the <reference> include from File A.\r\n* Error in IDE: Red squiggly line under IFoo: \"The name 'IFoo' does not exist in the current scope\".\r\n* Compile the project, with the <reference> still omitted, and the project compiles in spite of the error.\r\n\r\n\r\nThere is a related problem where, in the Visual Studio IDE, types for a given file, say File A, are being resolved with recourse to sibling files already open in the document well. When these sibling files are closed then the missing types in File A are highlighted with the red line.\r\n\r\nIt has not been possible to reproduce this problem, but it is a common problem. We only discover the error when a file is opened in the absence of its siblings. \r\n\r\nIn all these cases the project normally builds without error.\r\n\r\nI believe the correct practice is to have the <reference> include in every file that requires it. If not that should be a compilation error.\r\n\r\nNoel",
    "LastUpdatedDate": "2017-11-27T11:51:33.707-08:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "typescript",
    "ReportedDate": "2013-01-24T05:12:37.65-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "External"
    },
    "Summary": "Mismatch between VS IDE and compiler",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 643
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Assigning to Jonathan - this is a basic outcome of our current project system design that we'll want to address if we make any changes there.",
      "PostedDate": "2013-01-28T09:40:53.477-08:00",
      "Id": 87517
    },
    {
      "Message": "I have noticed that tsc will only use the <reference> tag if --out is omitted. It might have something to do with that??",
      "PostedDate": "2013-02-15T12:33:30.213-08:00",
      "Id": 90500
    }
  ]
}