{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "As part of our move to GitHub, we're closing our CodePlex suggestions and asking that people move them to the GitHub issue tracker for further discussion.  Some feature requests may already be active on GitHub, so please make sure to look for an existing issue before filing a new one.\n\nYou can find our GitHub issue tracker here:\nhttps://github.com/microsoft/typeScript/issues\n",
    "ClosedDate": "2014-07-28T15:17:21.923-07:00",
    "CommentCount": 42,
    "Custom": null,
    "Description": "> The file Foo.js.map has changed since you opened it. Would you like to save the version you have open over the changes on disk?\r\n\r\n> The file Foo.js has changed since you opened it. Would you like to save the version you have open over the changes on disk?\r\n\r\nThese errors are getting old. I don't have these files opened.\r\n\r\nSteps to reproduce:\r\n1. Modify `Foo.ts` and save it.\r\n2. Refresh a page in the browser that uses `Foo.js`.\r\n3. Save `Foo.ts` again (with or without modifying it), you will get the errors.",
    "LastUpdatedDate": "2014-07-28T17:26:25.097-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "typescript",
    "ReportedDate": "2013-10-23T02:33:17.92-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "External"
    },
    "Summary": "\"Conflicting Modifications Detected\" error",
    "Type": {
      "Name": "Unassigned",
      "Id": 5
    },
    "VoteCount": 3,
    "Id": 1829
  },
  "FileAttachments": [
    {
      "FileId": 748202,
      "FileName": "Logfile.PML",
      "DownloadUrl": ".\\748202"
    },
    {
      "FileId": 750351,
      "FileName": "app.js copies.zip",
      "DownloadUrl": ".\\750351"
    },
    {
      "FileId": 784521,
      "FileName": "SearchResults.txt",
      "DownloadUrl": ".\\784521"
    }
  ],
  "Comments": [
    {
      "Message": "I've uploaded a video demonstrating it: http://www.youtube.com/watch?v=3YCQsWtQXro\nBe sure to pay attention to when I'm saving the file, it happens twice.\n\nIt looks like the browser step isn't necessary. I've restarted my PC, opened Visual Studio, made sure all extensions that could be disabled were disabled, restarted Visual Studio and then created a new project.",
      "PostedDate": "2013-10-24T05:21:06.8-07:00",
      "Id": 119502
    },
    {
      "Message": "I don't see this happening with our latest bits even if I've manually put the .js and .map files into my TypeScript project.\n\nI did the following:\n1. Launch default Typescript project site.\n2. Modify app.ts, save (triggers compile).\n3. Refresh page in the browser.\n4. Return to VS, see no warning dialog about files having changed.\n\r\n\r** Closed by danquirk 10/23/2013 11:32AM",
      "PostedDate": "2013-10-23T11:32:08.163-07:00",
      "Id": 119503
    },
    {
      "Message": "Just found this discussion, at least this means I'm not the only person with this issue: https://typescript.codeplex.com/discussions/461100",
      "PostedDate": "2013-10-24T05:39:49.407-07:00",
      "Id": 119505
    },
    {
      "Message": "Can you run Process monitor by Sys Internals [0] while you execute the steps in your scenario and see if some other process is trying to modify the file... \n\nIf you can share the log it creates that would be great.\n\n[0] http://technet.microsoft.com/en-us/sysinternals/bb896645",
      "PostedDate": "2013-10-24T18:09:02.38-07:00",
      "Id": 119604
    },
    {
      "Message": "Dropbox, Explorer and TortoiseHg (under the name of Explorer) are accessing a few directories, but `app.js` and `app.js.map` are only ever accessed by Visual Studio.\r\n\r\nI've attached the log.",
      "PostedDate": "2013-10-25T00:33:33.157-07:00",
      "Id": 119615
    },
    {
      "Message": "Thanks for the log, as you saw that doesn't tell us much.. can you block DropBox and TortoiseHG from accessing the folder?\n\nWhat extensions do you have installed in VS?\n\nThanks.",
      "PostedDate": "2013-10-25T12:30:04.613-07:00",
      "Id": 119716
    },
    {
      "Message": "I've disabled both DropBox and TortoiseHg, they no longer show up in Process Monitor but the issue remains.\n\nI have the following extensions installed, but disabled:\n- GuidInserter2 _2.1_\n- Indent Guides _14.0.0.0_\n- Mindscape Web Workbench _3.2.1035.22937_\n- t4 editor _2.2.3_\n- Web Essentials 2012 _3.2_\n- xUnit.net runner for Visual Studio 2012 and 2013 _0.9.5.4_\n\nI have the following extensions installed and enabled (can't be disabled)\n- Microsoft Web Developer Tools _1.2.40308.0_\n- NuGet Package Manager _2.7.40911.225_\n- Visual Studio Extensions for Windows Library for JavaScript _1.0.9200.20789_",
      "PostedDate": "2013-10-28T02:40:31.063-07:00",
      "Id": 119837
    },
    {
      "Message": "This is really weird. Can you upload the .js and .js.map files as they appear while that dialog is up? That might help us figure out what other tool is writing to those files.",
      "PostedDate": "2013-10-28T10:41:51.65-07:00",
      "Id": 119867
    },
    {
      "Message": "I've attached copies from 3 points:\r\n- first save after project creation\r\n- second save while the dialog is up\r\n- second save after going through the dialog\r\n\r\nFiles seem to be binary identical though.\r\n\r\nI've also disabled my anti-virus (Avira Free) to see if that made a difference, but it didn't.\r\nMy colleague who is running a near-identical set-up (hardware/software/configuration) doesn't have this issue. Very weird issue indeed.\r\n\r\nPerhaps I could run a debug build of `C:\\Program Files (x86)\\Microsoft Visual Studio 11.0\\Common7\\IDE\\CommonExtensions\\Microsoft\\TypeScript\\TypeScriptLanguageService.dll`? I'm guessing Compile on Save is handled by `TypeScriptLanguageService.Features.CompileOnSave.CompileOnSaveBackgroundTask`",
      "PostedDate": "2013-10-29T02:25:48.317-07:00",
      "Id": 120007
    },
    {
      "Message": "We're looking in to what we can do to track this down.",
      "PostedDate": "2013-11-04T13:26:15.377-08:00",
      "Id": 121758
    },
    {
      "Message": "This is bizarre.  Searching on problems with this message occurring has very few hits (for any file type, not just TypeScript related), so there is something funky going on.\n\nDiscussing this internally, several possibilities came up:\n1) Another plug-in is writing to the file, i.e. Web Essentials.  However is this is the case we'd expect a bunch of people to be hitting this issue.  Also, these typically spawn a separate process to compile (i.e. tsc.exe in Web Essential's case), and we're not seeing that in the ProcMon log.  So this seems unlikely.\n\n2) Something in Kernel mode is touching the file, i.e. anti-virus or backup software.  However if this was the case, it would affect all files (e.g. .csproj, .sln files), not just the compiled TypeScript files, and you'd be getting this everywhere.  I assume this isn't the case, so this seems unlikely.\n\n3) There are 2 TypeScript language services loaded somehow, and both of them are trying to 'compile on save'.  We've not seen this before, however this would make sense in that only the generated TypeScript files are affected, & devenv.exe is the process touching the files.\n\nHave you uninstalled/reinstall different TypeScript versions on this machine?  Do you recall if you hit any issues during install/uninstall.\n\nCould you search under \"C:\\Program Files (x86)\\Microsoft Visual Studio 11.0\\Common7\\IDE\\CommonExtensions\\\" and see if you have multiple copies of TypeScriptLanguageService.dll or TypeScriptLanguageService.pkgdef?  (Change the path as needed for 32-bit OS or VS 2013).\n\nThanks.",
      "PostedDate": "2013-11-12T11:03:35.28-08:00",
      "Id": 122783
    },
    {
      "Message": "Our first TypeScript commit was on 2013-05-07, so we started with TypeScript 0.8.3 and have been upgrading with each release. I don't recall having any issues.\n\nThese are the files I've found:\n\n* C:\\Program Files (x86)\\Microsoft Visual Studio 11.0\\Common7\\IDE\\CommonExtensions\\Microsoft\\TypeScript\\TypeScriptLanguageService.dll\n* C:\\Program Files (x86)\\Microsoft Visual Studio 11.0\\Common7\\IDE\\CommonExtensions\\Microsoft\\TypeScript\\TypeScriptLanguageService.pkgdef\n* C:\\Users\\Developer07\\AppData\\Local\\assembly\\dl3\\R8DET7G4.BQ8\\5CRX2ZD7.DRE\\02a05a6a\\00a05eea_c599ce01\\TypeScriptLanguageService.dll\n* C:\\Users\\Developer07\\AppData\\Local\\assembly\\temp\\2PY1Z4F1S8\\TypeScriptLanguageService.dll\n\nI've tried creating a project on a different hard drive (my main drive is an SSD) but it made no difference.\n\nI've run the uninstaller and picked 'Repair', but that didn't help. Then I've uninstalled and reinstalled, that also didn't help.\n\nI've now also checked with a different user profile, using the local Administrator account instead of my domain account. VS had never run on it before, and I wasn't able to reproduce the issue with that account.\n\nWhat I'll do next is run some anti-spyware tools and perhaps another anti-virus tool. I'll also try to end any non-essential process to see if that fixes it.",
      "PostedDate": "2013-11-13T00:31:32.06-08:00",
      "Id": 122892
    },
    {
      "Message": "Nothing suspicious found, terminating non-essential processes didn't help.",
      "PostedDate": "2013-11-13T01:11:36.2-08:00",
      "Id": 122899
    },
    {
      "Message": "Another update: I've installed a trial of VS 2013 and the issue doesn't happen in that one. It remains in VS 2012 however.\n\nI've then uninstalled VS 2013, VS 2012 and TypeScript. I also did a second uninstall of VS 2012 with `/uninstall /force`. An odd thing I noticed is that the `C:\\Program Files (x86)\\Microsoft Visual Studio 11.0\\Common7\\IDE\\CommonExtensions\\Microsoft\\TypeScript\\` was still intact (along with some Entity Framework related directories). Afterwards I've reinstalled VS 2012 and TypeScript. Unfortunately the issue is still there.\n\nWhen I uninstall TypeScript (always via Programs and Features), it does so successfully, but the directory is again still intact and I can still compile TypeScript files. Running the installer again offers to install TypeScript instead of Repair/Uninstall.\nI've removed the directory, then the installer failed to run. I restored the directory and could again install TypeScript. After doing so, I uninstalled again and only the `~IC` and `~PC` directories were left. At this point I cannot compile TypeScript any more.\nI've then installed TypeScript again, and the issue is still there.\nI'm guessing my installation is corrupted. Is there a way to remove every trace of TypeScript?\n\nMy apologies if this comment looks like a mess, I've been typing it up while I was doing the steps. I also really appreciate the time you are putting into this.",
      "PostedDate": "2013-11-13T03:45:31.44-08:00",
      "Id": 122907
    },
    {
      "Message": "It does sound like something went very awry in one of these install/uninstall processes. It's conceivable that you somehow have 2 versions of the language service running that are causing the conflicts if for some reason one was not registered/unregistered correctly during install/uninstall. At this point you probably need to uninstall TypeScript and manually remove all traces of it from the file system and registry before installing a new version and seeing if that fixes the issue once and for all.",
      "PostedDate": "2013-11-13T18:37:05.073-08:00",
      "Id": 123006
    },
    {
      "Message": "This issue is irritating me too, now. I believe I've wiped all trace of Typescript from my computer (revo uninstall on advanced mode got rid of a few temp files the uninstaller missed). Deleted the CommonExtensions\\Microsoft\\Typescript folder. Then reinstalled. On the second save and beyond, errors all round. \n\nAny help with this would be appreciated.",
      "PostedDate": "2013-12-16T03:18:29.65-08:00",
      "Id": 127598
    },
    {
      "Message": "This is happening to me in VS 2013 and I am really beyond tired of dealing with it. I had this same issue in VS 2012 after they made Web Essentials stop doing the compile - the silly thing is I never had this problem when Web Essentials was handling it.\n\nMy  2013 has only had the latest typescript compiler installed on it.\n\nIt happens every time I save or close the file.\n\nSeriously guys..this has to get fixed like six month ago.",
      "PostedDate": "2014-01-18T09:34:45.787-08:00",
      "Id": 130790
    },
    {
      "Message": "Seconding Dan's comment -- uninstall all TypeScript program entries, delete any copies of the language service DLL, and reinstall. You can try the 0.9.5 beta as well: https://typescript.codeplex.com/wikipage?title=TypeScript%200.9.5%20beta\n\r\n\r** Closed by RyanCavanaugh 11/19/2013 11:52AM",
      "PostedDate": "2013-11-19T11:52:11.313-08:00",
      "Id": 130867
    },
    {
      "Message": "I've reopened this because I'm not sure the TS team receives notifications on closed issues. (I was getting emails for these comments.)",
      "PostedDate": "2014-01-20T02:49:57.137-08:00",
      "Id": 130868
    },
    {
      "Message": "Thanks for reopening - we only look over closed issues occasionally.\n\nWe still have no information on how to reproduce the problem locally so we can work on a fix. We have a lot of internal users of TypeScript and none have reported the problem, so we need more information before we can proceed with a fix. If anyone can post anything that might be relevant or unusual about their machine configuration, that would be very useful.",
      "PostedDate": "2014-01-20T14:44:18.883-08:00",
      "Id": 130989
    },
    {
      "Message": "I don't know what to add.  It just happened to me three times on the same file.    I have un-installed and re-installed TypeScript.   This is an old project, so I suppose that could have something to do with it.     My frustration levels are so high I converted on of my TS files back to JS because it had become too onerous to work on it.",
      "PostedDate": "2014-01-28T17:29:23.9-08:00",
      "Id": 131972
    },
    {
      "Message": "This is the only entry in my project file for the file:\r\n\r\n <TypeScriptCompile Include=\"EZPay\\TicketSelect.ts\" />\r\n\r\nThere is a single install of typescript, 0.9.5.0\r\n\r\nI did a computer wide search for typescript*.dll and have attached the list.  I have VS 2012 & VS 2013 installed.  Can you see anything weird?",
      "PostedDate": "2014-01-28T17:40:21.017-08:00",
      "Id": 131973
    },
    {
      "Message": "Found a fix... goto tools > options > text editor > uncheck \"track changes\"",
      "PostedDate": "2014-02-06T07:26:34.857-08:00",
      "Id": 132818
    },
    {
      "Message": "ops... uncheck \"track changes\" didnt solve...my bad...",
      "PostedDate": "2014-02-06T07:31:04.55-08:00",
      "Id": 132819
    },
    {
      "Message": "Still hoping for any additional information here. We have several hundred internal users and none of them have reported seeing this, so we're hoping to find more clues about what might be causing the problem.",
      "PostedDate": "2014-02-17T12:10:48.62-08:00",
      "Id": 133862
    },
    {
      "Message": "I've suggested this a while ago:\n\n> Perhaps I could run a debug build of `C:\\Program Files (x86)\\Microsoft Visual Studio 11.0\\Common7\\IDE\\CommonExtensions\\Microsoft\\TypeScript\\TypeScriptLanguageService.dll`? I'm guessing Compile on Save is handled by `TypeScriptLanguageService.Features.CompileOnSave.CompileOnSaveBackgroundTask`\n\nIt might reveal the necessary information a lot sooner than hoping to accidentally bump useful information provided by users.",
      "PostedDate": "2014-02-17T12:39:08.483-08:00",
      "Id": 133868
    },
    {
      "Message": "Anyone having this problem - what add ons are you running?  \nI have:\nCodeRush\nDPack\nSQL Prompt 6\nTab Studio\nWeb Essentials\nProductivity Power Tools\nxUnit\nNuGet\n\nMaybe something is colliding - perhaps if list out our addons we'll see a pattern.  \n\n\n",
      "PostedDate": "2014-02-17T18:22:55.823-08:00",
      "Id": 133900
    },
    {
      "Message": "Did installing the 1.0rc make a difference? \n\nWe've seen issue with Web Essentials and TypeScript in the past, so disabling all TypeScript features there may be a solution? ",
      "PostedDate": "2014-03-05T13:26:13.71-08:00",
      "Id": 135963
    },
    {
      "Message": "Installing the RC made no difference.\n\nOn Oct 28, 2013 at 11:40 AM I posted here saying I had disabled all extensions that I could disable and the issue was still there.",
      "PostedDate": "2014-03-06T01:23:51.847-08:00",
      "Id": 136017
    },
    {
      "Message": "I am and have been having this problem as well.  Its not gone, needs to be reopened and corrected. Thisis either from Web Essentials or from TypeScript itself.  ",
      "PostedDate": "2014-03-06T07:02:23.123-08:00",
      "Id": 136044
    },
    {
      "Message": "Please reactivate if you're still seeing this on the 1.0 build. Thanks!\n\r\n\r** Closed by RyanCavanaugh 04/03/2014 2:19PM",
      "PostedDate": "2014-04-03T14:19:14.277-07:00",
      "Id": 140501
    },
    {
      "Message": "Still seeing this with the 1.0 build.",
      "PostedDate": "2014-04-04T00:20:31.64-07:00",
      "Id": 140502
    },
    {
      "Message": "I also have this problem.\nAt some point the message just stops poping up and the file isn't actually saved and the web page is still using the older js file.\n\nI have to restart Visual Studio after that",
      "PostedDate": "2014-04-25T08:22:27.963-07:00",
      "Id": 143062
    },
    {
      "Message": "I get this on VS2013 and it's a real pain.\n\nI can stop this from happening by deselecting the \"Combine JavaScript output into file\" option... but I would really like this option available to me.\n\nCould the TS guys give us an update on this issue... it's pretty important as the issue is so frustrating for developers where TS is their 9-5 day (yes, that's me included!)\n\nCheers",
      "PostedDate": "2014-04-30T02:36:39.883-07:00",
      "Id": 145177
    },
    {
      "Message": "Check that... has started happening again after I switched this off!  Sorry guys... thus is a really weird error!",
      "PostedDate": "2014-04-30T02:42:22.937-07:00",
      "Id": 145178
    },
    {
      "Message": "Just want to register this is happening to me too.  Started in mid-April: extremely irritating. \nVS 2013, 12.0.21005.1 REL, Typescript Version 0.9.7.0 (according to tsc -v)\n I've stopped using \"Combine JavaScript\" but that doesn't help: now it alerts modification on each _individual_ js file instead.  Tried Suspending Resharper (8.2).  That didn't help.  Didn't uninstall Resharper completely, though.  Anybody else seeing this _without_ Resharper?  ",
      "PostedDate": "2014-05-27T09:20:09.953-07:00",
      "Id": 148029
    },
    {
      "Message": "I dont have Resharper installed and its happening to me...in my windows 7 / 8 machines with vs2013...",
      "PostedDate": "2014-05-28T12:43:40.717-07:00",
      "Id": 148171
    },
    {
      "Message": "My vs output window is constantly showing this msg:\n\n28/05/2014 17:10:53: Exception: Tried 500 times for reading, but the file 'myfile.ts' is still in use. Exiting gracefully.\n\nthis msg is not shown when I get \"Conflicting Modifications Detected\"",
      "PostedDate": "2014-05-28T13:11:24.023-07:00",
      "Id": 148173
    },
    {
      "Message": "I have VS2013 update2 with web essentials installed an I have got the same problem. It crashed VS completeley.",
      "PostedDate": "2014-06-03T07:34:05.683-07:00",
      "Id": 148677
    },
    {
      "Message": "Upgrading to Typescript Version 1.0.1.0 didn't help.  I think it's a problem in Visual Studio, not Typescript itself exactly?  \n\nIf I change TS file X, I think I get the \"Conflicting Modifications\" once for every other ts file Y in the project that references classes in file X.   It can be painful if I need to exit Visual Studio with some unsaved files open.\n\nThis happens whether or not the reference is explicit with /// <reference path=\".\n\nIf I start the project with no files open, then edit file X, it may not happen.  If I then load file Y, it may not happen.   If I use F12 in file Y to get to some definition in file X, then saving any change to X will once again get the warning popup.\n\n",
      "PostedDate": "2014-07-11T10:09:07.577-07:00",
      "Id": 152109
    },
    {
      "Message": "Just changed my source control provider from visual source safe to team foundation and no more annoying errors....",
      "PostedDate": "2014-07-24T11:02:15.783-07:00",
      "Id": 153414
    },
    {
      "Message": "Confirmed that having Visual SourceSafe as your source control provider causes this to happen.\n\nIs anyone *not* using Visual SourceSafe as their provider plug-in also seeing this? Please comment here or on the GitHub issue https://github.com/Microsoft/TypeScript/issues/277",
      "PostedDate": "2014-07-28T17:26:25.097-07:00",
      "Id": 153787
    }
  ]
}