{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "As part of our move to GitHub, we're closing our CodePlex issues and suggestions and asking that people move them to the GitHub issue tracker for further discussion.  Some issues and feature requests may already be active on GitHub, so please make sure to look for an existing issue before filing a new one.\n\nYou can find our GitHub issue tracker here:\nhttps://github.com/microsoft/typeScript/issues\n",
    "ClosedDate": "2014-07-28T15:20:16.973-07:00",
    "CommentCount": 2,
    "Custom": null,
    "Description": "tsc.js has always worked with JavaScript implementation included with Windows -- Windiws Script Host. However, in v 1.0 it does not work anymore.\r\n\r\nIt breaks because of Array.forEach call, which is not supported by WSH.\r\n\r\nIt's most problematic at build scenarios in unprepared environments. For example, CI builds may run on servers without node.js installed. Another example is rolling out a clean image of Windows XP/7/8/Server into a VM for a demo -- and having no node.js on that.\r\n\r\nI've got a simple patch that fixes it, by creating a new method in ArrayUtilities and redirecting all forEach calls into that.\r\n\r\n\r\nApparently I need to print and send you guys a CLA to submit a pull request. Fair enough, will do it tomorrow morning. Please approve the bug though. Many thanks!\r\n\r\n\r\nP.S. How about you get your unit tests running on WSH too?\r\n\r\nIf not all of them, at least do 'cscript.exe bin\\tsc.js compiler\\tsc.ts --out tsc.js' to build the compiler itself and compare that with the output node produces. That would exercise a whole lot of functionality and catch an odd weird edge case like this one.\r\n\r\nOleg.",
    "LastUpdatedDate": "2017-11-27T11:51:35.523-08:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "typescript",
    "ReportedDate": "2014-04-19T16:02:04.81-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "External"
    },
    "Summary": "tsc.js ceased to work in Windows Script Host",
    "Type": {
      "Name": "Unassigned",
      "Id": 5
    },
    "VoteCount": 3,
    "Id": 2450
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "We're on board with getting the compiler running on cscript again, but we'd like to do that by simply not using the ES5 APIs rather than shimming them in. It looks like there are only about a dozen uses of ES5-specific APIs that would need rewriting.",
      "PostedDate": "2014-04-21T10:18:16.093-07:00",
      "Id": 142477
    },
    {
      "Message": "That is exactly how I patched it: changing those handful of someArray.forEach(...) to ArrayUtilities.forEach(someArray, ...).\n\nBTW, I see you need a signature from my employer in order to accept patches -- will try to obtain that tomorrow, it's never easy to get a binding signature like that :-)",
      "PostedDate": "2014-04-21T15:35:43.197-07:00",
      "Id": 142539
    }
  ]
}