{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "This is an internal implementation detail for the compiler.",
    "ClosedDate": "2013-06-24T12:21:03.66-07:00",
    "CommentCount": 2,
    "Custom": null,
    "Description": "I'm using IHashTable (well, really StringHashTable) from the compiler's implementation but sometimes I need to delete key-data pairs from my table.  Right now I'm just doing \"addOrUpdate\" with the key the key I want removed and data is undefined, but this seems rather hacky.  I could write my own hashtable with all of the features fairly easily, but I feel like it's better to use the \"official\" one since having an official hash table seems like a good idea.  Is there a better way to do this, or a more official hashtable?\r\n\r\nEDIT: Thanks MgSam for helping me clarify that I'm using the compiler's implementation.",
    "LastUpdatedDate": "2013-06-24T12:21:03.66-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "typescript",
    "ReportedDate": "2013-06-24T08:01:50.543-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "By Design"
    },
    "Summary": "How to delete in IHashTable",
    "Type": {
      "Name": "Unassigned",
      "Id": 5
    },
    "VoteCount": 1,
    "Id": 1221
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "The \"Issues\" section of CodePlex is for bugs or feature requests. You should post a question like this on [Stack Overflow](stackoverflow.com) with the tag \"TypeScript\". You also will need to include your code so people will know what you're referring to.",
      "PostedDate": "2013-06-24T08:45:34.997-07:00",
      "Id": 103929
    },
    {
      "Message": "Update (since there's no edit button!): Ah ok, sorry, I see you're referencing the compiler's implementation of IHashTable. You should make your post a little more clear about that at least.",
      "PostedDate": "2013-06-24T08:48:40.603-07:00",
      "Id": 103930
    }
  ]
}