{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "Fixed in 0.9 branch",
    "ClosedDate": "2013-04-12T15:48:04.54-07:00",
    "CommentCount": 9,
    "Custom": null,
    "Description": "Basically i wanted to be able to do things like \"new window.Image()\", however \"Image\" is not defined on the \"Window\" interface, so the compiler throws an error.\r\n\r\nSo i tried to augment the interface:\r\n\r\n```TypeScript\r\ninterface Window {\r\n    Image: new(width?: number, height?: number) => HTMLImageElement;\r\n}\r\n```\r\n\r\nWhile this works on other interfaces, the Window interface seems kinda special, the line is being flagged as an error, saying \"Duplicate Identifier 'Image'\", in fact only function definitions aren't flagged, ie:\r\n\r\n```TypeScript\r\ninterface Window {\r\n    foo();\r\n}\r\n```\r\n\r\nInterestingly the compiler is fine with it, ie it compiles without throwing any error, it's only Visual Studio flagging it as an error.",
    "LastUpdatedDate": "2014-03-10T04:37:45.873-07:00",
    "PlannedForRelease": "TypeScript 0.9.0",
    "ReleaseVisibleToPublic": true,
    "Priority": {
      "Name": "High",
      "Severity": 150,
      "Id": 3
    },
    "ProjectName": "typescript",
    "ReportedDate": "2012-10-08T09:25:25.993-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Fixed"
    },
    "Summary": "\"Duplicate Identifier\" errors in Visual Studio when trying to augment the Window interface",
    "Type": {
      "Name": "Task",
      "Id": 2
    },
    "VoteCount": 31,
    "Id": 176
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Thanks for reporting this issue - extending types that came from lib.d.ts does result in some odd behavior in Visual Studio. We're currently working on this bug.",
      "PostedDate": "2012-10-09T14:37:03.033-07:00",
      "Id": 79245
    },
    {
      "Message": "I am having the same issue however the example I have is that the  WinJS.d.ts  extends  Element to add a property for winControl.  this can be seen in the windows 8 sample app. \n\n",
      "PostedDate": "2012-10-10T07:36:42.497-07:00",
      "Id": 79304
    },
    {
      "Message": "Can we raise the impact of this issue? I think it is a big bummer because it makes it impossible to extend types such as strings and arrays, preventing the porting of existing JavaScript code to TypeScript.",
      "PostedDate": "2012-12-06T15:47:48.9-08:00",
      "Id": 83736
    },
    {
      "Message": "@xps - I've bumped up the impact of this issue, as we are aware this is blocking some libraries from being used currently.",
      "PostedDate": "2013-01-18T16:56:13.043-08:00",
      "Id": 86582
    },
    {
      "Message": "It's not just Visual Studio - it happens in playground too. But curiously, when you refresh page the error goes away (valid errors are still highlighted) until you edit something.",
      "PostedDate": "2013-03-17T11:18:14.713-07:00",
      "Id": 93481
    },
    {
      "Message": "It seems to me that when the interface is inside a module, I'll get no errors.",
      "PostedDate": "2013-03-28T08:22:41.157-07:00",
      "Id": 94651
    },
    {
      "Message": "\"It seems to me that when the interface is inside a module, I'll get no errors.\" Please forget my previous message.\n\nI can make an extension to native Date object using an interface as a function, but not as an ordinal property without error messages in Visual Studio.",
      "PostedDate": "2013-03-28T13:59:03.643-07:00",
      "Id": 94710
    },
    {
      "Message": "I've created a quick gist with my current workaround/solution for using Sugar.js's static extensions.  I'm still pretty new to TypeScript, so I'm sure its not the best solution, but I did not see a workaround example in my own search so maybe this will help someone.\n\n- https://gist.github.com/vmadman/8034329",
      "PostedDate": "2013-12-18T20:28:36.693-08:00",
      "Id": 128030
    },
    {
      "Message": "Having the same problem when I add jasmine nuget into a project in 1.0 RC...\n\n",
      "PostedDate": "2014-03-10T04:37:45.873-07:00",
      "Id": 136383
    }
  ]
}