{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "Just tried it out and everything seemed to work fine. Can you provide any more details? Thanks!",
    "ClosedDate": "2014-03-10T13:08:33.9-07:00",
    "CommentCount": 2,
    "Custom": null,
    "Description": "VS 2013 with TS 1.0 RC\r\n\r\nI installed the Productivity Power Tools 2013 extension today. Shortly after installing the extension, i noticed that Compile On Save wasn't working. I tried many of my workarounds that have worked before:\r\n* Close and re-open the .ts file\r\n* Restart Visual Studio\r\n* Reboot the machine\r\nNone of these worked, so i removed the recent variable, Productivity Power Tools 2013. After disabling the extension and restarting VS, Compile On Save worked fine.\r\n\r\nIs there a known compatibility issue?",
    "LastUpdatedDate": "2014-04-01T13:03:25.227-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "typescript",
    "ReportedDate": "2014-03-07T20:29:09.647-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Need More Info"
    },
    "Summary": "Productivity Power Tools 2013 causes compilation issues",
    "Type": {
      "Name": "Unassigned",
      "Id": 5
    },
    "VoteCount": 1,
    "Id": 2277
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Yea, the relation to the extension may have been a fluke. After using it for a while since, compilation just quits working every once in a while. It becomes very flaky and I almost feel like I need to restart Visual Studio before I run my application just so I feel like it actually got compiled. \n\nI don't know how much testing you're doing on Windows Store apps, but compiling TypeScript with those has been consistently a problem. This has been an issue for me since day 1. What can I give you to help you figure out why? I can't give a reliable repro other than develop a Windows Store application with around 10k lines of code. It just quits compiling sometimes and it's really frustrating.\n\nOther than that, I love TypeScript :-)",
      "PostedDate": "2014-03-10T17:15:26.647-07:00",
      "Id": 136460
    },
    {
      "Message": "If you have a project you can share we're certainly happy to take a look (you can share it privately too, doesn't have to be posted here for all to see). Obviously it is hard to nail down issues like this. We do have some large Windows Store apps using TypeScript that at least verify that there isn't an endemic issue in that scenario.\n\nNote we don't have a great way of seeing comments on closed issues (hence my delayed response) so if you have more to add it's best to either re-open this issue, create a new one, or make a forum post and we'll see it quickly that way.",
      "PostedDate": "2014-04-01T13:03:25.227-07:00",
      "Id": 140210
    }
  ]
}