{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "As part of our move to GitHub, we're closing our CodePlex issues and suggestions and asking that people move them to the GitHub issue tracker for further discussion.  Some issues and feature requests may already be active on GitHub, so please make sure to look for an existing issue before filing a new one.\n\nYou can find our GitHub issue tracker here:\nhttps://github.com/microsoft/typeScript/issues\n",
    "ClosedDate": "2014-07-28T15:20:16.677-07:00",
    "CommentCount": 5,
    "Custom": null,
    "Description": "When a JavaScript file that is marked as DependentUpon in relation to a TypeScript file, and said JavaScript file is marked as Read Only, the build fails. The only reason the JavaScript file is Read Only is because of our company's source control, which has a plugin for Visual Studio (Perforce, via the P4VS plugin).\r\n\r\nThe TypeScriptCompile items should not fail the build when this does not occur (makes build server deployments a real pain). Within the Visual Studio build process, these items should be using the built-in source control APIs to \"unlock\" the file before writing new content (if it's even necessary).\r\n\r\nThis has already been reported as fixed in Issue 768 (https://typescript.codeplex.com/workitem/768), but since it's no longer 2013 and I'm still experiencing this issue, clearly it is not fixed.",
    "LastUpdatedDate": "2014-07-28T15:20:16.677-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "typescript",
    "ReportedDate": "2014-06-03T12:08:48.257-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "External"
    },
    "Summary": "Write to file failed",
    "Type": {
      "Name": "Unassigned",
      "Id": 5
    },
    "VoteCount": 2,
    "Id": 2541
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "This is indeed a duplicate of Issue 768, and is definitely still not fixed.",
      "PostedDate": "2014-06-04T08:35:19.733-07:00",
      "Id": 148816
    },
    {
      "Message": "This issue exists because you have both your TS and JS sources checked in yes? Is there a reason the JS needs to be checked in? In most other languages you generally would not be checking in the build results (ex DLLs in C#).",
      "PostedDate": "2014-06-11T17:09:04.46-07:00",
      "Id": 149444
    },
    {
      "Message": "Yes I appreciate that but there are valid reasons.  Our reason right now is because the tsc exe/task fails on our build server (presumably because it doesn't have the proper version of IE installed)",
      "PostedDate": "2014-06-11T17:36:28.88-07:00",
      "Id": 149448
    },
    {
      "Message": "Is it failing on the build server because you have xcopy'd a TypeScript install from a machine with VS + latest IE to a build server without VS + latest IE? If you install the standalone tools on the build server then tsc.exe should just work, ex http://www.microsoft.com/en-us/download/details.aspx?id=34790",
      "PostedDate": "2014-06-11T19:31:54.76-07:00",
      "Id": 149451
    },
    {
      "Message": "Yep, that's the problem.  Not allowed to install anything on the build server.\n\nBut that's not what this issue is about. :)",
      "PostedDate": "2014-06-11T21:38:36.553-07:00",
      "Id": 149453
    }
  ]
}