{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "",
    "ClosedDate": "2013-02-26T13:39:34.58-08:00",
    "CommentCount": 1,
    "Custom": null,
    "Description": "A fairly rough grouping, addressing the current issues (without longer term plans), would help:\r\n\r\n- ES6 features\r\n  - arrow 'this' is still completely broken; there is a simple fix; when will it be applied?\r\n  - modules are rudimentary (selective import, loaders, ..); what are the plans?\r\n  - any other ES6 features (let, destructuring, generators) on the near-term roadmap?\r\n\r\n- community involvement\r\n  - mailing lists (developer/tool builder/user) would help\r\n  - pull requests\r\n  - architecture walkthrough document, to make up for the lack of in-source documentation,\r\n    and to enable others to contribute to the project, or to build on it (tools)\r\n  - an official blog (I heard about 0.8.1 only indirectly, and I don't know whether\r\n    that blog post is part of the project); even a blog aggregator might work\r\n  - work items still do not have components attached, hindering easy search\r\n\r\n- who is on the project, what are they working on now?\r\n  why keep the team anonymous?\r\n\r\nOf course, fixing all of these would be preferred;-) But just stating which of these you are working on, and what is delaying work on the others, and what timeframes and developments can be expected would help.\r\n\r\nPS. If you need inhous advice on community involvement for open source language development, you could do worse than consult with the GHC team. Simon Peyton Jones has been running a very successful, very complex project with a very small inhouse team for over a decade, more and more relying on and supporting community contributions.",
    "LastUpdatedDate": "2017-11-27T11:51:34.097-08:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "typescript",
    "ReportedDate": "2012-11-19T08:14:20.137-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "Please post roadmap/roadblocks",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 4,
    "Id": 452
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "We've started posting a roadmap for the project here: http://typescript.codeplex.com/wikipage?title=Roadmap&referringTitle=Home\r\n\r\nOur goal is to discuss any issues/suggestions in the issue tracker.\r\n\r\nWe've also started blogging about TypeScript releases and plans at http://blogs.msdn.com/typescript.",
      "PostedDate": "2013-02-26T13:39:11.43-08:00",
      "Id": 91600
    }
  ]
}