{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "Closing this issue, since it's external to TypeScript.",
    "ClosedDate": "2013-04-01T10:12:57.45-07:00",
    "CommentCount": 17,
    "Custom": null,
    "Description": "I recently upgraded a large (50+ TS files) Azure MVC application using TypeScript from 0.8.1.1 to 0.8.2, and also upgraded my Web Essentials 2012 extension to Version 2.4.1. (I mention this as it's not impossible WE is the culprit).\r\n\r\nSince the upgrade, when testing the application using Start Without Debugging, devenv.exe's Private Working Set rises from an initial (and quite usual) 775MB to eventually consume, after an hour or so of work, more than 3GB of RAM, causing performance issues. This was not happening prior to the upgrade.\r\n\r\nProfiling isn't my area of expertise, so I'm not sure how to provide more info on this. Glad to do so if requested, though.\r\n\r\nMachine specs are Win 7 x64 with a quad core i7 and 8GB of RAM. VS2012 Ultimate + the Web Essentials extension.",
    "LastUpdatedDate": "2014-01-10T10:34:33.287-08:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "typescript",
    "ReportedDate": "2013-01-24T09:34:45.127-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "Possible Memory Leak in VS2012 0.8.2 Release",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 6,
    "Id": 644
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Just to add that I tried disabling WE2012 and the problem persists - memory usage climbs to an unacceptable level. This is only happening on the one solution where I use TS. Other azure solutions with the same setup run as normal.",
      "PostedDate": "2013-01-25T06:23:31.443-08:00",
      "Id": 87314
    },
    {
      "Message": "I am also observing this behavior with the new version 0.8.2 of TypeScript. Visual Studio even crashes if I work between 1,5 and 2 hours. However, I mostly restart it after one hour because it gets very slow.\n\nBtw.: My machine is configured equally.",
      "PostedDate": "2013-01-27T10:49:48.563-08:00",
      "Id": 87463
    },
    {
      "Message": "We've fixed this in the develop branch. I'll be posting instructions shortly on how to upgrade your existing installation so you can stop being affected by this.",
      "PostedDate": "2013-01-28T11:25:21.703-08:00",
      "Id": 87535
    },
    {
      "Message": "Fixed here. Thanks.",
      "PostedDate": "2013-01-30T01:41:25.77-08:00",
      "Id": 87765
    },
    {
      "Message": "This issue has returned for me. Did seem to be fixed before. I've just tried downloading the latest known good build of TS, and have replaced typescriptService with the one dated 01/02/2013 02:292:29\n\nNot even running debugging at the moment, just coding TS, and devenv has climbed rapidly through 1GB of memory. My impression is the leak is more rapid than previously.",
      "PostedDate": "2013-02-01T08:23:56.427-08:00",
      "Id": 88014
    },
    {
      "Message": "Please try updating your TypeScript language service file as described here\n\nhttp://blogs.msdn.com/b/typescript/archive/2013/01/29/trying-the-latest-typescript-build.aspx\n\nIf you're still seeing the leak after doing so, please reactivate. Thanks!\n\r\n\r** Closed by RyanCavanaugh 01/29/2013 5:03PM",
      "PostedDate": "2013-01-29T17:03:03.593-08:00",
      "Id": 88015
    },
    {
      "Message": "",
      "PostedDate": "2013-02-01T08:24:33.41-08:00",
      "Id": 88016
    },
    {
      "Message": "Thanks for letting us know again, I'll mark this as active and our team will look into this further :)",
      "PostedDate": "2013-02-01T14:35:59.64-08:00",
      "Id": 88067
    },
    {
      "Message": "Just to chime in, the latest version of typescriptServices.js from the develop branch (as of today) didn't fix this for me. Memory continues to climb until VS stops working - on my 32-bit machine, this happens around 1.8GB of RAM. This is very reproducible on my machine - let me know if I can provide any memory dumps that might help.",
      "PostedDate": "2013-02-07T16:30:05.67-08:00",
      "Id": 88890
    },
    {
      "Message": "I actually need to revise my previous comment. The \"Last Known Good\" typescriptServices.js file that's included in the \"develop\" branch doesn't seem to fix this problem, but I built a new one from the sources yesterday, and since then the memory for VS2012 has stayed stable around 500-600MB.",
      "PostedDate": "2013-02-08T08:07:33.73-08:00",
      "Id": 88916
    },
    {
      "Message": "I've just updated again, to the typescriptServices.js in 92b70c5c83c1 and the issue seems fixed.",
      "PostedDate": "2013-02-14T06:10:17.627-08:00",
      "Id": 89291
    },
    {
      "Message": "It seems to be fixed for me as well.",
      "PostedDate": "2013-02-22T06:42:32.137-08:00",
      "Id": 91205
    },
    {
      "Message": "I commented on issue #779 in regards to the same issue. I am currently using 0.8.3 and it happens to me when editing my TS files overtime. Recently it VS quickly becomes unusable. It seems like it is definitely a memory leak. I upgraded to the most recent fix addressing issue 779, but this fix did not fix the problem I am having.",
      "PostedDate": "2013-03-12T07:50:19.403-07:00",
      "Id": 93032
    },
    {
      "Message": "WORKAROUND",
      "PostedDate": "2013-03-15T08:20:31.88-07:00",
      "Id": 93375
    },
    {
      "Message": "WORKAROUND\n\nEncase anyone else has the same problem with TypeScript's current scalability issue, what I did to work around this was I created a declaration file for each of my TS files and referenced the declaration files instead of the actual TS file.",
      "PostedDate": "2013-03-15T08:22:03.467-07:00",
      "Id": 93376
    },
    {
      "Message": "I wanted to provide an update on my issue with the VS TS editor slowing down over time. I disabled the Web Essentials compile TS on save/build and enabled this functionality provided by TS and my issues have gone away. I even stopped referencing the declaration files I created and the TS editor still is performing good.",
      "PostedDate": "2013-03-29T06:08:22.563-07:00",
      "Id": 95250
    },
    {
      "Message": "Thanks for the update!",
      "PostedDate": "2013-03-29T09:47:01.62-07:00",
      "Id": 95278
    }
  ]
}