{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "Thanks for reporting this! The issue has been fixed and can be tried out in the upcoming 0.9.5 release. We also have a beta available (https://typescript.codeplex.com/wikipage?title=TypeScript%200.9.5%20beta) if you'd like to try it out.",
    "ClosedDate": "2013-11-19T13:37:12.763-08:00",
    "CommentCount": 3,
    "Custom": null,
    "Description": "I write a lot of my typescript code while the Azure emulator that hosts those files is running and VS is in debug mode. This worked fine in VS2012 + Web Essentials, since after every save the corresponding js file was updated.\r\n\r\nWith VS2013 (and w/o Web Essentials), it seems to be that compile-on-save does only work when not currently running in debug mode. Since my distributed app takes a few moments to start, having it shut down for every small code change is not an option for me. \r\nIs there a way to have compile-on-save all the time?\r\n\r\nRegards",
    "LastUpdatedDate": "2014-01-10T10:34:33.287-08:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "typescript",
    "ReportedDate": "2013-09-10T09:30:49.607-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Fixed"
    },
    "Summary": "VS2013 compile-on-save not working while debugging in Azure emulator",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 3,
    "Id": 1668
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Thanks for reporting we'll take a look.",
      "PostedDate": "2013-09-13T14:32:03.78-07:00",
      "Id": 113532
    },
    {
      "Message": " Agree! This hinders productivity.  Especially when on is used to editing JS files at runtime.\n\nThe only thing is that I get this with VS2012 as well.",
      "PostedDate": "2013-10-04T03:08:02.797-07:00",
      "Id": 117459
    },
    {
      "Message": "> The only thing is that I get this with VS2012 as well.\nAre you using the Typescript addin/tools for compilation?\nMy guess would be that only Web Essentials (pre-3.0) allows for this kind of dynamic recompilation, so the same problem with VS2013 could occur in VS2012 when not using Web Essentials.\n\nNearly one month passed since this issue was created and it's hindering/stopping our upgrade to VS2013. A current official response would be appreciated.",
      "PostedDate": "2013-10-08T03:37:32.773-07:00",
      "Id": 117758
    }
  ]
}