{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "As part of our move to GitHub, we're closing our CodePlex suggestions and asking that people move them to the GitHub issue tracker for further discussion.  Some feature requests may already be active on GitHub, so please make sure to look for an existing issue before filing a new one.\n\nYou can find our GitHub issue tracker here:\nhttps://github.com/microsoft/typeScript/issues\n",
    "ClosedDate": "2014-07-28T15:18:11.753-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "This is a feature proposal in three parts. Parts 1-2 concern the typescript compiler. Part 3 concerns the visual studio integration (web essentials or built-in).\r\n\r\nMotivation:\r\nI have a nested project structure, and within typescript files in different directories, I must now use relative paths that differ depending on which nested directory the current typescript file is. I would like instead to reference files relative to a consistent, shared, \"root\" directory, in the same way that the current JavaScript language service in visual studio allows, using a tilde syntax to specify a path as relative to this root directory.\r\n\r\npart 1) optional Root Path command line option (option name/syntax not important).\r\ntsc -refroot=$PROJECTDIR\r\nor maybe just:\r\ntsc -root=$PROJECTDIR\r\n\r\nThis designates a particular directory as the \"root\" reference directory. If unspecified, the root reference directory is the current working directory at the time tsc is executed. Importantly, this option doesn't change the behavior of any existing typescript references. In order to make use of this root directory, see part 2.\r\n\r\npart 2) A new tilde syntax for the /// <reference path=\"~/path/relative/to/root/path.d.ts\" />\r\n\r\nWhen the tilde is used in the reference path, that makes the path relative to the current reference root directory, rather than relative to the file being compiled. When the tilde is not used, typescript's pathing behavior is exactly as it is now.\r\n\r\npart 3) Modification to visual studio integration to make the project directory the default reference root path for compile on save and compile on build, with the option to change it to a difference path (perhaps on a per-build-configuration basis? e.g. debug/release builds, etc..?)\r\n\r\nAgain, this doesn't break any existing code, because no existing code is using the tilde syntax for file references. However, following this convention would bring the typescript language service and compiler into consistency with the VS javascript language service, which supports the same tilde syntax for /// <reference path=\"~/Scripts/etc.js\" />, though in JavaScript, such reference paths are always relative to the project directory so far as I know.",
    "LastUpdatedDate": "2017-11-27T11:51:33.707-08:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "typescript",
    "ReportedDate": "2013-11-30T17:36:57.56-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "External"
    },
    "Summary": "root reference path command line option and <reference> path tilde syntax",
    "Type": {
      "Name": "Unassigned",
      "Id": 5
    },
    "VoteCount": 6,
    "Id": 1959
  },
  "FileAttachments": [],
  "Comments": []
}