{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "As part of our move to GitHub, we're closing our CodePlex suggestions and asking that people move them to the GitHub issue tracker for further discussion.  Some feature requests may already be active on GitHub, so please make sure to look for an existing issue before filing a new one.\n\nYou can find our GitHub issue tracker here:\nhttps://github.com/microsoft/typeScript/issues\n",
    "ClosedDate": "2014-07-28T15:17:22.44-07:00",
    "CommentCount": 6,
    "Custom": null,
    "Description": "I recently converted my Windows Store app to a Universal App with a Windows Phone and a Shared project. I moved all of my TS files to the Shared project, but TypeScript doesn't behave the way that it used to in a regular JS project. I can't get it to generate source maps and i can't get the JS file nested under the TS file (VS hangs and won't load the project). I basically tried coping the TS configurations from the Windows Store JS project to the *.Shared.shproj and the S*.Shared.projitems files. I realize that 2013.2 is RC currently, but i'm hoping there is a supported way of adding TS support to a Universal Shared project.\r\n\r\nAlso, this really scenario really begs support for cross project support since Universal Apps assume you'll have files spread across the different projects.",
    "LastUpdatedDate": "2017-11-27T11:51:33.707-08:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "typescript",
    "ReportedDate": "2014-04-23T20:09:58.6-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "External"
    },
    "Summary": "TypeScript support for Universal App Shared project",
    "Type": {
      "Name": "Unassigned",
      "Id": 5
    },
    "VoteCount": 14,
    "Id": 2459
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Thanks for the report. Unfortunately this stuff just isn't supported by TypeScript yet, the project systems are just not wired up to do the things you want with JS files and sourcemaps. It is on our radar for future releases. Others can upvote this to help inform the priority of work.",
      "PostedDate": "2014-04-24T12:38:36.653-07:00",
      "Id": 142915
    },
    {
      "Message": "That's a bummer. I'll have to hold off on the Universal apps until that is supported.",
      "PostedDate": "2014-04-24T16:56:58.13-07:00",
      "Id": 142939
    },
    {
      "Message": "When can we expect full TypeScript support in universal apps?",
      "PostedDate": "2014-05-17T13:05:32.507-07:00",
      "Id": 146968
    },
    {
      "Message": "Wow, this sucks.  Really makes me reconsider using WinJS for store apps... :(",
      "PostedDate": "2014-06-02T14:10:00.973-07:00",
      "Id": 148615
    },
    {
      "Message": "It would be great if this also worked with the stand alone shared project templates (available via the recently released extension for visual studio) as well as universal apps.  Assuming both systems are built on the back of the same MSBuild stuff hopefully it will come as part of the fix for this.  \n\nI just had a go to see if I could use this to share some TS files between an ASP.NET MVC project, an cordova project and a HTML and Type script project, a library project (for jasmine/Hutzpah tests)  and couldn't get it to work.  Boohoo.  Here's hoping a fix comes along soon..",
      "PostedDate": "2014-06-16T18:23:13.347-07:00",
      "Id": 149881
    },
    {
      "Message": "We need this urgently. :(",
      "PostedDate": "2014-06-25T01:39:32.397-07:00",
      "Id": 150671
    }
  ]
}