{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "We won't be doing anything special here; use of polyfill libraries is recommended",
    "ClosedDate": "2013-06-13T11:20:38.917-07:00",
    "CommentCount": 1,
    "Custom": null,
    "Description": "The TypeScript compiler has a option to indicate whether you are targeting ECMAScript 3 or 5. using some of the language constructs, like property descriptors, which are part of the ECMAScript 5 specification while targeting ECMAScript 3 will cause a compile error. However other constructs added to the ECMAScript 5 specification, like Array.forEach(), Array.map() etc are not flagged as errors even though they will cause a run time error when the resulting JavaScript code is run in an older browser.\r\n\r\nPlease validate these as well as any other function added in the ECMAScript 5 specification and flag them either as errors when targeting ECMAScript 3. When targeting ECMAScript 3 only permit these functions when a library like SugarJS is referenced and maybe suggest adding this or a similar library in the error message.\r\n\r\nAn alternative approach could be to do something like CoffeeScript does and generate a for loop instead of the original code or have the TypeScript compiler monkey patch the relevant object. However I would prefer the first approach mentioned myself.",
    "LastUpdatedDate": "2014-01-10T10:34:33.287-08:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "typescript",
    "ReportedDate": "2013-02-21T05:48:03.723-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "By Design"
    },
    "Summary": "Targeting ECMAScript 3 and not supported functions",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 4,
    "Id": 746
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Thanks for the report, I've marked this as active and it will be investigated.",
      "PostedDate": "2013-02-21T13:00:38.283-08:00",
      "Id": 91114
    }
  ]
}