{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "Please re-open if you see any issues with the 0.9.5 beta installing. I'll add this to our list of setup scenarios to try out. Thanks!",
    "ClosedDate": "2013-11-19T10:18:57.89-08:00",
    "CommentCount": 2,
    "Custom": null,
    "Description": "I have Visual Studio 2013 (Ultimate) (not preview or release candidate, the real thing) on Windows 8.1, and I clicked the \"Install the Latest TypeScript for Visual Studio\" project type.  The download and set setup went fine to the end with no error.\r\n\r\nHowever after reopening Visual Studio 2013 (after closing all instances of it first), there's only the same \"Install the Latest TypeScript for Visual Studio\" project type in Visual Studio... also I don't see \"TypeScript file\" in add file inside a Web project.\r\n\r\nAppears while the install completed with no error, Visual Studio 2013 just doesn't see that TypeScript got installed.\r\n\r\nAny ideas/help?\r\n\r\nThanks!",
    "LastUpdatedDate": "2013-11-19T10:18:57.89-08:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "typescript",
    "ReportedDate": "2013-11-16T19:38:17.937-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Fixed"
    },
    "Summary": "Install issue with Visual Studio 2013?",
    "Type": {
      "Name": "Unassigned",
      "Id": 5
    },
    "VoteCount": 1,
    "Id": 1901
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "A couple of related issues:\n\nhttps://typescript.codeplex.com/workitem/1815\nhttps://typescript.codeplex.com/workitem/1827",
      "PostedDate": "2013-11-17T01:53:39.707-08:00",
      "Id": 123297
    },
    {
      "Message": "Thanks!\n\nFound it out that issue was because I installed Visual Studio 2013 in a __non standard location__ (E drive) and the TypeScript installer installs everything to the C: drive.  A comment noted in: \n\nhttps://typescript.codeplex.com/workitem/1815\n\nsaid that this is a known bug and will be fixed in the next release (0.9.5?).\n\nFor details for anyone else that has this issue:\n\nI was able to find the TypeScript templates in the C: drive at the following locations:\n\nC:\\Program Files (x86)\\Microsoft Visual Studio 12.0\\Common7\\IDE\\ProjectTemplates\nC:\\Program Files (x86)\\Microsoft Visual Studio 12.0\\Common7\\IDE\\ItemTemplates\nC:\\Program Files (x86)\\Microsoft Visual Studio 12.0\\Common7\\IDE\\VWDExpress\\ItemTemplates\nC:\\Program Files (x86)\\Microsoft Visual Studio 12.0\\Common7\\IDE\\VWDExpress\\ProjectTemplates\n\nI then copied the TypeScript folder to the analogous locations in my real install location.\n\nI then opened a command prompt in administrative mode and ran the following command:\n\n\"[path to actual Visual Studio 2013 install]devenv.exe\" /installvstemplates\n\nThen I opened Visual Studio 2013 again and it paused a while it was \"initializing templates\".  After that TypeScript showed up correctly!\n\nThanks for the help!  It directly solved my issue.  Also glad to know it is being fixed in the next release.  TypeScript is AWESOME.  ;)\n",
      "PostedDate": "2013-11-17T07:37:00.9-08:00",
      "Id": 123314
    }
  ]
}