{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "",
    "ClosedDate": "2013-09-24T09:17:41.123-07:00",
    "CommentCount": 3,
    "Custom": null,
    "Description": "It's not easy from an internet search to locate an up-to-date, \"official\" version of typescript-mode.el. Shouldn't this be part of the TypeScript project? (Apologies if it is and I couldn't find it.)",
    "LastUpdatedDate": "2013-10-04T11:55:22.69-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "typescript",
    "ReportedDate": "2013-09-23T12:39:59.657-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "External"
    },
    "Summary": "Official typescript-mode.el",
    "Type": {
      "Name": "Unassigned",
      "Id": 5
    },
    "VoteCount": 1,
    "Id": 1716
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "There is no 'official' Emacs or Vim support.  There were some initial versions at TypeScript release created by a partner team, but the TypeScript team does not maintain or ship support for these editors.  \n\nThere are a great number of excellent and popular editors out there.  This is an area where we'd love to see the community help provide support.",
      "PostedDate": "2013-09-24T09:17:27.943-07:00",
      "Id": 115494
    },
    {
      "Message": "The community is active, but we're lacking information/coordination from the TypeScript team.\n\nAs far as I know, the \"partner team\" editor support for TS was limited to syntax highlighting. Still, since they were released, I had hoped that they would be maintained, following the TS language development.\n\nThe typescript-tools project is making the (nice, if underdocumented) TS language services available to editor plugins for Vim, Emacs and Sublime (https://github.com/clausreinke/typescript-tools). This gives us IDE-style functionality on top of the basic syntax highlighting.\n\nAre you saying that the syntax highlighting is completely abandoned/unsupported? Or is that partner team still active and reachable somewhere? I don't want to duplicate existing work, and I don't recall seeing a license (it was distributed as a \"sample\").",
      "PostedDate": "2013-09-24T11:08:30.61-07:00",
      "Id": 115505
    },
    {
      "Message": "Worth also mentioning that the existing Emacs modes are not only out of date, but baroque (3.5k lines of Elisp, probably enough to write a compiler :) and buggy (see [this issue](http://stackoverflow.com/questions/18968095/functioning-up-to-date-emacs-mode-for-typescript) I raised on Stack Overflow).",
      "PostedDate": "2013-09-24T12:06:48.94-07:00",
      "Id": 115513
    }
  ]
}