{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "This appears to be working in some scenarios. In others it does not but the bug does not meet our triage bar to fix it at this point in the schedule.",
    "ClosedDate": "2013-08-28T10:02:58.587-07:00",
    "CommentCount": 3,
    "Custom": null,
    "Description": "This caused a problem for me with the compiler did not pick up some types correctly. It simply did not realize the type definition was a typescript file. (File properties : BuildAction = Content instead of TypeScriptCompile)\r\n\r\nI noticed this both in a real project and when I was experimenting to try to reproduce.\r\n\r\nI even tried to exclude and include the file repeatedly with no change. First when I excluded the file, closed the proj, opened it again, and included the file VS finally got it right.\r\n\r\nUnfortunately I can not create steps to reproduce. This happens, but not all the times... :/\r\n\r\nNow I know I need to double check BuildAction for my files if they are not being picked up by the compiler.\r\n\r\nPerhaps \"include file\" in Visual Studio is a bit flakey when it comes to typescript file types?",
    "LastUpdatedDate": "2014-01-10T10:34:33.287-08:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "typescript",
    "ReportedDate": "2013-08-22T02:11:14.203-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "By Design"
    },
    "Summary": "Strange: Included typescript file was not added with TypeScriptCompile",
    "Type": {
      "Name": "Unassigned",
      "Id": 5
    },
    "VoteCount": 1,
    "Id": 1559
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Followed up privately, we can re-open this once I get access to your project.\n\r\n\r** Closed by danquirk 08/22/2013 1:17PM",
      "PostedDate": "2013-08-22T13:17:06.147-07:00",
      "Id": 110798
    },
    {
      "Message": "Whoops, wrong issue, investigating...",
      "PostedDate": "2013-08-22T13:17:38.033-07:00",
      "Id": 110799
    },
    {
      "Message": "I'm able to repro this with Add -> Existing item, marked as active. Thanks for the report.",
      "PostedDate": "2013-08-22T15:54:48.53-07:00",
      "Id": 110830
    }
  ]
}