{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "",
    "ClosedDate": null,
    "CommentCount": 4,
    "Custom": null,
    "Description": "I ran into an issue, regarding the resize on scroll. I have to make a web application, that has a list of products. On scroll, the header receives a new class \"small\" and resizes. I tried to make the list of products receive a class  called \"large\" and it adds up, but the header doesn't resize anymore if I add this class. I am working with PureMVC, and I have 3 different components, one for the header, one for the products list and one that renders both header and product list in order to display them correctly.  Do you have any ideas how can I fix this? ",
    "LastUpdatedDate": "2015-04-22T22:01:29.043-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "typescript",
    "ReportedDate": "2015-04-22T00:30:51.883-07:00",
    "Status": {
      "Name": "Proposed",
      "Id": 1
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "Resizing div on scroll",
    "Type": {
      "Name": "Unassigned",
      "Id": 5
    },
    "VoteCount": 1,
    "Id": 2666
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "I don't think this is the place to ask how to build/fix a website.  Try Stack Overflow.",
      "PostedDate": "2015-04-22T11:39:17.593-07:00",
      "Id": 183252
    },
    {
      "Message": "Well, there is a section called Issues, and I had an issue with this super duper TypeScript, and I thought I could ask here if I had one (you know, an issue).  But, thanks anyways. Apparently on Stack Overflow are not so many people who know typescript. So yeah, I found this place more suitable to ask such a question. Sorry if i bothered you :) ",
      "PostedDate": "2015-04-22T13:56:30.597-07:00",
      "Id": 183259
    },
    {
      "Message": "Sorry, just trying to help point you in the right direction.  You haven't mentioned anything related to TypeScript at all.  Your classes sound like CSS classes, not TS.  You get better help by posting what you've done so far (some code), hopefully which already has an idea of what you want to accomplish.",
      "PostedDate": "2015-04-22T21:59:56.767-07:00",
      "Id": 183270
    },
    {
      "Message": "Also, this is better in a discussion, and not as a TS issue.",
      "PostedDate": "2015-04-22T22:01:29.043-07:00",
      "Id": 183271
    }
  ]
}