{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "I'm unable to reproduce this with the latest bits in the develop branch. I have 2 files with a number of lines of code and comments of different styles (//, ///, /** */) and they're all preserved in the single output file when I use the --out flag. \n\nThe --out flag does not try to do anything clever like group /// references from between different files into one block. It is just blindly concatenating the input files in the order they are provided, which is why the order they're provided is important (as you've noticed).",
    "ClosedDate": "2013-08-29T12:34:07.383-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "\r\nHi,\r\n\r\nStruggling with the order of included files in a single output file, i  have now a file that references all files in the project in the correct order, and each other file referencing this master file. This comes as a suggestion from kind users on this forum.\r\n\r\nNow the ouput file is correct. But, i could not stop to notice that the reference comments are not grouped at the start of the output file but spread in the entire file. My comments from the start of the file are included in the ouput only for the first file...\r\n\r\nAny ideas how to configure this to work properly?",
    "LastUpdatedDate": "2013-08-29T12:34:07.383-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "typescript",
    "ReportedDate": "2013-08-29T00:14:41.397-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Fixed"
    },
    "Summary": "comments and output as single file problem",
    "Type": {
      "Name": "Unassigned",
      "Id": 5
    },
    "VoteCount": 1,
    "Id": 1617
  },
  "FileAttachments": [],
  "Comments": []
}