{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "I believe this is fixed in our latest (internal) sources -- we've made some stability improvements and also have better user feedback (you'll see status in the status bar). Once the next release comes out please give it a try; apologies for not having any good workaround in the meantime.",
    "ClosedDate": "2013-10-07T09:55:09.793-07:00",
    "CommentCount": 4,
    "Custom": null,
    "Description": "Hello\r\n\r\nWe are currently using TS 0.9.1.1 with Web Essentials 3.1. The problem we face is that compile on save does not work. What's strange is that if I create a brand new \"HTMLApplication with TS\" project, compile on save works perfectly fine. It's just one particular solution for which compile on save does not work. We have verified numerous times that the project file contains the content necessary for compile on save to work, as laid out here: https://typescript.codeplex.com/wikipage?title=Compile-on-Save. The only thing I will say is that this project has many many TS files with references between them. I wonder if this could be the cause of compile on save not working. In the past we have had other issues relating to too many TS files, like for example http://stackoverflow.com/questions/17574540/project-with-many-typescript-files-fails-with-could-not-find-file-xxxx-error. Finally, please note that compile on save does not work at all for this project. This is not the same issue that's out there whereby compile on save sometimes works and sometimes does not (https://typescript.codeplex.com/workitem/1611). \r\n\r\nWhat troubleshooting steps should I take? The first thing I would like to know is if whether the process that does the compile on save is even invoked whenever I save a TS file inside this problematic solution. Thank you for your help",
    "LastUpdatedDate": "2013-10-07T09:55:09.793-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "typescript",
    "ReportedDate": "2013-10-03T13:20:19.75-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Fixed"
    },
    "Summary": "compile on save does not work",
    "Type": {
      "Name": "Unassigned",
      "Id": 5
    },
    "VoteCount": 2,
    "Id": 1752
  },
  "FileAttachments": [
    {
      "FileId": 741282,
      "FileName": "Fng.Space.Web.csproj",
      "DownloadUrl": ".\\741282"
    }
  ],
  "Comments": [
    {
      "Message": "In the properties for the file ensure \"BuildAction\" is \"TypeScriptCompile\".\nI've had this a couple of times. Depending on how you added the TS file to the project, this can sometimes not be set correctly.",
      "PostedDate": "2013-10-04T02:45:03.077-07:00",
      "Id": 117458
    },
    {
      "Message": "hi martinsgill... thank you for your response... but as i mentioned above, we have made sure to follow the instructions laid out here: https://typescript.codeplex.com/wikipage?title=Compile-on-Save... so the buildaction is covered...",
      "PostedDate": "2013-10-04T06:08:32.757-07:00",
      "Id": 117468
    },
    {
      "Message": "hello paulb... thank you for responding... i have attached the cs project file... please note that one setting we know is incorrect in this project file is the \"typescriptincludecomments\" setting... we know that it should be \"typrescriptremovecomments\"... but we've verified fixing this does not fix the problem... anyway... i also tried adding a simple ts file to the project... the compile on save appears to work the first time around... in other words, the first time i make a change and then save, the js file is updated... however it stops working after that... i have to reopen the solution in order for it to work again the first time around... seeing this i thought maybe my files would also compile on save the first time around but no luck... even if i reopen the solution, changing and saving one of my ts files does not update the js file... it's all very strange... the last time compile on save worked consistently was with web essentials... if there's anything else you would like me to try or additional info you need, please let us know... thank you",
      "PostedDate": "2013-10-07T08:05:23.853-07:00",
      "Id": 117646
    },
    {
      "Message": "Can you share your project file (not the entire project), so we can take a look.\n\nA way to verify this, is to add a simple .ts file with no references and make sure compile on save works for that file... \n\nClosing for tracking, please re-open using the button on top when you've updated the bug. \n\nThanks\n\r\n\r** Closed by paulb 10/04/2013 10:12AM",
      "PostedDate": "2013-10-04T10:12:17.607-07:00",
      "Id": 117647
    }
  ]
}