{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "As part of our move to GitHub, we're closing our CodePlex suggestions and asking that people move them to the GitHub issue tracker for further discussion.  Some feature requests may already be active on GitHub, so please make sure to look for an existing issue before filing a new one.\n\nYou can find our GitHub issue tracker here:\nhttps://github.com/microsoft/typeScript/issues\n",
    "ClosedDate": "2014-07-28T15:18:42.69-07:00",
    "CommentCount": 1,
    "Custom": null,
    "Description": "Based on the discussion at http://typescript.codeplex.com/discussions/447786\r\n\r\nCurrently, it's not possible to subclass primitive types (off of which number and strings could be very useful).\r\n\r\nFor instance, Date.now() returns a number. (new Date()).getMonth() also returns a number. In theory, they can be manipulated together; in practice, it doesn't make sense to add them up. It would be nice if these were numbers could be subtyped and constraints listed so that the compiler would raise an error when trying to sum Date.now() and (new Date()).getMonth().\r\n\r\nThe web platform defines atob and btoa functions [1], both of which signature is String => String. However, in applications, usually, a function will only manipulate a string or its base64 representation, but not choose between both. It'd be nice if strings were subtypable so that people can put constraints on which string subtypes they wish to accept.\r\n\r\nThe list of cases where the (runtime) types are string and numbers, but applications puts more semantics to them goes on and on.\r\n\r\nWhat I'm proposing is only compile-time checks (most of the type checking infrastructure work is already in place I believe). It wouldn't impact the runtime that would manipulate raw JavaScript primitive numbers and strings.\r\n\r\n[1] http://www.whatwg.org/specs/web-apps/current-work/multipage/webappapis.html#atob",
    "LastUpdatedDate": "2017-11-27T11:51:33.707-08:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "typescript",
    "ReportedDate": "2013-06-24T14:35:54.747-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "External"
    },
    "Summary": "Primitive subtyping",
    "Type": {
      "Name": "Feature",
      "Id": 1
    },
    "VoteCount": 1,
    "Id": 1226
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Thanks for the suggestion.  Assigning to Jonathan who tracks our feature requests.",
      "PostedDate": "2013-06-25T14:50:09.44-07:00",
      "Id": 104130
    }
  ]
}