{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "If you're adding a new file to a project, you'll be given a set of valid files for that project type. So in a VB project you would not see 'Add New Item' present Typescript files, much like you wouldn't see it offer C# files. In a C# project you will not see Typescript files in the 'Add New Item' dialog either.\n\nFile -> New -> File adds a new file of any type, it doesn't care about what project you currently have loaded. That's why the left sidebar in that dialog lets you filter by various types (like C# vs VB items). That doesn't mean adding that file type to your current project type makes any sense though.\n\nTypescript items currently just show up as C# in the places you noted because we use the C# project format and don't have our own project system at the moment. ",
    "ClosedDate": "2013-06-06T15:04:38.09-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "Tried add new file in the dialog in VS12 and even with searching didnt find anything looking like a \".ts\" file. Then started a new Project, this one \"Html Application with TypeScript\" something... There a \".ts\" shows up, but under \"c#\"... \r\n\r\nBut if I create a new file using CTRL-N and type then \"type\" it shows up... Strange...?",
    "LastUpdatedDate": "2013-06-06T15:04:38.09-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "typescript",
    "ReportedDate": "2013-06-05T15:42:31.887-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "By Design"
    },
    "Summary": "New Ts File not shown in VB Projects",
    "Type": {
      "Name": "Unassigned",
      "Id": 5
    },
    "VoteCount": 1,
    "Id": 1116
  },
  "FileAttachments": [],
  "Comments": []
}