{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "Thanks for replying. Closing this as fixed.",
    "ClosedDate": "2013-12-26T11:12:06.333-08:00",
    "CommentCount": 2,
    "Custom": null,
    "Description": "After updating to the latest 0.9.5 I am still having the issue where the JS output files (which are excluded from project) are not being included in publishes. I created a brand new C# empty web project from scratch and added one TS file. I noticed by default though the output JS file is part of the project. So, I excluded the JS file from the project (this is especially required for projects using TFS b/c projects fail to build when TS's output JS file are apart of TFS and not checked out).\r\n\r\n I have attached my simple solution w/ one TS file and if you publish you will see the JS files do not publish still. This seems to be an ongoing issue that isn't getting fixed. Not sure why this is not working still.",
    "LastUpdatedDate": "2013-12-26T11:12:06.333-08:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "typescript",
    "ReportedDate": "2013-12-19T05:48:58.527-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Fixed"
    },
    "Summary": "JS files do not publish still",
    "Type": {
      "Name": "Unassigned",
      "Id": 5
    },
    "VoteCount": 1,
    "Id": 2037
  },
  "FileAttachments": [
    {
      "FileId": 769603,
      "FileName": "TypeScriptTfsTest_2013-12-19 08-48-20Z.zip",
      "DownloadUrl": ".\\769603"
    }
  ],
  "Comments": [
    {
      "Message": "From your comment\n_“I noticed by __default though the output JS file is part of the project. So, I excluded the JS file from the project__ (this is especially required for projects using TFS b/c projects fail to build when TS's output JS file are apart of TFS and not checked out).”_\n\nThis should not be the case for TypeScript 0.9.5. In 0.9.5, the JS will not be part of the project by default but will be published when you do so. I'm guessing the update to 0.9.5 did not go correctly.\nI have a follow up question:\n- What version of Visual Studio are you using? 2012/2013, WebExpress/Ultimate ... ?\n- Did you publish locally (on file system)?\n- Could you check the version of the TypeScript DLL? You can do so by running the following command from Developer Command Prompt\n__ildasm \"C:\\Program Files\\Microsoft Visual Studio 12.0\\Common7\\IDE\\CommonExtensions\\Microsoft\\TypeScript\\TypeScriptLanguageService.dll\"__ or change according to the path Visual Studio is installed. The version should be at the bottom of the window like this\n.assembly TypeScriptLanguageService\n{\n  .ver 0:9:5:0\n}\n",
      "PostedDate": "2013-12-20T11:42:12.917-08:00",
      "Id": 128178
    },
    {
      "Message": "After you stated that by default, the JS files should not be apart of the project, I uninstalled TS, deleted any left over files (which there were quite a lot) and then did a refresh install of it and after doing so my JS files now publish. So, the issue must have been a bad install initially. Just so you know, when I upgraded to the 0.9.5 Beta Alpha, I uninstalled 0.9.1.x and installed 0.9.5 Beta Alpha and when I upgraded to the 0.9.5 Alpha, I just ran the install.\n\nThank you very much for your help.",
      "PostedDate": "2013-12-23T06:30:51.627-08:00",
      "Id": 128311
    }
  ]
}