{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "As part of our move to GitHub, we're closing our CodePlex suggestions and asking that people move them to the GitHub issue tracker for further discussion.  Some feature requests may already be active on GitHub, so please make sure to look for an existing issue before filing a new one.\n\nYou can find our GitHub issue tracker here:\nhttps://github.com/microsoft/typeScript/issues\n",
    "ClosedDate": "2014-07-28T15:18:28.94-07:00",
    "CommentCount": 1,
    "Custom": null,
    "Description": "I want to point out the use case where a generated .js file is used as an embedded resource for a web control.   There has been some discussion about excluding generated .js files from the project.  This will make embedding the files as a resource more difficult.  \r\n\r\nPlease allow the dependent .js file to remain in the project or give the option for including/excluding from the project.   When included in the project please have it work with TFS much the same way that an aspx code behind works, checking out when its dependency (parent) is checked out, and not on every project build.\r\n\r\n\r\n",
    "LastUpdatedDate": "2017-11-27T11:51:33.707-08:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "typescript",
    "ReportedDate": "2013-02-16T15:03:52.777-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "External"
    },
    "Summary": "Using generated .js files as an embedded resource",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 7,
    "Id": 731
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "I am currently setting up an MVC project under TFS source control which uses the MvcContrib EmbeddedResourceController to pull script/css resources from MVC Area dll's.  The fact that typescript requires you to either add the file to the project (and therefore be included in TFS) or have it excluded from the project altogether, prevents me from using Typescript in this arrangement altogether if I wish to not have my generated JS files in TFS.\n\nWhile this is possibly an advanced environment I've created here, I don't think it can be all that uncommon.  I'm sure you don't want to alienate your advanced developers, so I request that you give higher priority to this feature for me and others in my situation.",
      "PostedDate": "2013-04-02T10:23:32.183-07:00",
      "Id": 95632
    }
  ]
}