{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "We could use some more information here (either code or repro steps); we haven't seen this error before. Thanks!",
    "ClosedDate": "2013-07-29T10:04:25.223-07:00",
    "CommentCount": 3,
    "Custom": null,
    "Description": "We're working on an Eclipse plug-in for TypeScript (https://github.com/palantir/eclipse-typescript). I recently noticed that a release-0.9.1 branch was created so I wanted to try it out to see how much better the performance is over 0.9.0.1.  The new version seems to speed up a lot of common operations (especially getScriptLexicalStructure).  \r\n\r\nThe one issue I've encountered is that sometimes the code completion logic throws an exception when attempting to get completion entry details for parameters to a function.  Here is a slightly redacted stack trace showing the issue:\r\n```\r\nTypeError: Cannot call method 'setUnresolved' of null\r\n\tat TypeScriptCompiler.pullGetDeclInformation\r\n\tat CompilerState.pullGetDeclInformation\r\n\tat LanguageService.getCompletionEntryDetails\r\n\r\n```\r\n\r\nI think the most likely explanation is that I've implemented something about the language service host incorrectly for this new version, but on the off chance this is a compiler bug I thought I should report it now since it looks like 0.9.1 is being prepared to release soon.\r\n\r\nPlease let me know if you'd like any additional information to diagnose this (such as full stack traces or reproduction instructions via the plug-in I'm working on).",
    "LastUpdatedDate": "2013-08-27T09:41:30.593-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "typescript",
    "ReportedDate": "2013-07-27T15:51:07.447-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Need More Info"
    },
    "Summary": "setUnresolved exception in 0.9.1",
    "Type": {
      "Name": "Unassigned",
      "Id": 5
    },
    "VoteCount": 1,
    "Id": 1402
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Thanks for the quick response.  Actually, I made a pretty big change over the weekend to load all the TypeScript files in a project vs. just the ones referenced by the currently loaded file and now the issue won't reproduce.  That was probably it - sorry to bother you.",
      "PostedDate": "2013-07-29T11:34:45.977-07:00",
      "Id": 107806
    },
    {
      "Message": "for repro, see https://typescript.codeplex.com/workitem/1592",
      "PostedDate": "2013-08-26T14:55:21.547-07:00",
      "Id": 111217
    },
    {
      "Message": "Thanks Claus!",
      "PostedDate": "2013-08-27T09:41:30.593-07:00",
      "Id": 111303
    }
  ]
}