{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "Closing for bookkeeping. Please re-open with the sample code -- thanks!",
    "ClosedDate": "2014-04-28T10:19:49.95-07:00",
    "CommentCount": 2,
    "Custom": null,
    "Description": "We'd like to start exporting definition files for external modules we compiled from TypeScript (commonJS/AMD for npm/bower) but the exporter generates bad definition files that seem to ignore the fact that they were generated for external module code.\r\n\r\nThis is easily seen if you make a small app with a few interdependent imports and then compile with modules an declarations. If you then inspect the generated `.d.ts` files you see that don't reflect the typing of the modules at all and there is no clear path to making them work.\r\n\r\nThe main types are there, but the module structure and imports are non-existent or don't; reflect the real code and its usage as external module.\r\n\r\nI'd expect to see many `declare module './foo/bar' {}`, and interrelated `imports`. \r\n\r\nWe have tried post processing them but it become a huge mess in larger projects.\r\n\r\nThis is a blind-spot in the feature coverage (eg: it is blocking growth), and at this point declaration generation is near useless for external module code.",
    "LastUpdatedDate": "2014-04-28T10:19:49.95-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "typescript",
    "ReportedDate": "2014-04-24T07:05:23.463-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Need More Info"
    },
    "Summary": "Exporting definitions for external modules is borked",
    "Type": {
      "Name": "Unassigned",
      "Id": 5
    },
    "VoteCount": 2,
    "Id": 2461
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Could you post some repro code? We've certainly tested that the simple scenarios here work as expected.",
      "PostedDate": "2014-04-25T18:19:21.017-07:00",
      "Id": 143143
    },
    {
      "Message": "Sure, I will try to make some demos soonish.",
      "PostedDate": "2014-04-25T19:55:05.76-07:00",
      "Id": 143145
    }
  ]
}