{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "The playground is optimized for trying out TypeScript and quickly presenting the TS -> JS idea; changing contents the right pane would impede that goal. This is especially true when you consider how the as-you-type experience would look (randomly switching between code and errors as each new character came in).",
    "ClosedDate": "2013-07-01T10:07:47.517-07:00",
    "CommentCount": 2,
    "Custom": null,
    "Description": "The Typescript Playground shows generated Javascript code, even if there are errors in the Typescript code. I suggest you do not write any Javascript into the Typescript pane on errors, but output the error messages there.\r\n\r\nThe error is only shown with the bad code being underlined in red (maybe outrside the window and not visible at all) and a red dot inside the scrollbar. This can easily be overseen, when just looking at the output pane.",
    "LastUpdatedDate": "2013-07-01T10:07:47.517-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "typescript",
    "ReportedDate": "2013-06-29T00:29:25.217-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "By Design"
    },
    "Summary": "Typescript Playground should not output Javascript on errors",
    "Type": {
      "Name": "Unassigned",
      "Id": 5
    },
    "VoteCount": 1,
    "Id": 1278
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Just my 2 cents: I personally hate that feature of web essentials.\n\nI use Playground just to get an idea of what kind of code will be generated, or to get an idea of how to use certain features - the code that I type in there is not always correct, but that's not the intent. The intent is to learn and understand Typescript.\n\nWith that goal in mind, I believe that the Playground is simply a place for fast prototyping to get an idea of the language, and should allow people to experiment and learn - not to enforce it's restrictions.\n\nOn that note, perhaps there should be some other method of showing errors? Like a red balloon that you can click on to show an error pane for those people who desire?",
      "PostedDate": "2013-06-30T00:16:10.083-07:00",
      "Id": 104677
    },
    {
      "Message": "Most of the time I use the Playground for testing, whether a potential bug that I found in my environment, is really a bug. With this scenario it is bad, if errors are not shown clearly and output is generated in all cases. For example, look at...\n\n```\nfunction test(n: number): string {\n\treturn true;\n}\nvar x: goofy = test(\"\");\n```\n\nwhich is full of errors and nevertheless Javascript is generated.",
      "PostedDate": "2013-06-30T00:49:39.787-07:00",
      "Id": 104680
    }
  ]
}