{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "I'm very confused here. If you're getting TS Intellisense, the plugin has to have been installed. Can you upload two projects, one that works, one that doesn't, so we can investigate? Thanks!",
    "ClosedDate": "2013-08-26T14:46:13.663-07:00",
    "CommentCount": 2,
    "Custom": null,
    "Description": "I am unable to get the Typescript extension to install in Visual Studio 2012.  When I run the install, the tools are installed, but no Extension appears in Visual Studio.\r\n\r\nIs there support for getting the VSIX installed?  Is the VSIX file itself available someplace?  (I see older versions)  Is there some way to manually install or to verify the Visual Studio portion??\r\n\r\nI have 1 project with no TS intellisense, and another that does have it.  Is there something configured into the solution or project files, since the working project may have been from an install a while ago.\r\n\r\nThanks",
    "LastUpdatedDate": "2013-09-06T15:27:18.33-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "typescript",
    "ReportedDate": "2013-08-26T10:00:36.08-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Need More Info"
    },
    "Summary": "9.1.1 VSIX doesn't install",
    "Type": {
      "Name": "Unassigned",
      "Id": 5
    },
    "VoteCount": 1,
    "Id": 1594
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Ryan,\n  I don't have the project that didn't have Intellisense working -- I had to pull all the problem parts out because it is headed for production.\n  I have a project (TypescriptHtml proj) where I was getting the --module not set.  This appears to be coming from WebEssentials, which seems to have it's own settings.  I uninstalled W.E. and the TS is now building.\n  I'm still confused by the fact that I don't see Typescript listed as an Extension.  I thought had seen it in the list a few releases back.  That helped confuse me.\n  I uninstalled and reinstalled WebEssentials.  I guess they just pulled TS support out (I'd heard they were going to)\n  I'm in better shape then I thought.  \n  Is there a TS VSIX someplace?  How can I tell it's installed??\n\nThanks",
      "PostedDate": "2013-08-27T20:10:26.46-07:00",
      "Id": 111365
    },
    {
      "Message": "If you get colorization when you open a ts file, the plugin is installed.",
      "PostedDate": "2013-09-06T15:27:18.33-07:00",
      "Id": 112736
    }
  ]
}