{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "",
    "ClosedDate": "2014-05-20T16:48:56.487-07:00",
    "CommentCount": 5,
    "Custom": null,
    "Description": "I have installed 12.0.30324.00 Update 2 RC and when going to File > New Project, there is no TypeScript node nor any TypeScript related templates to select.\r\n\r\nIgnoring that and taking an existing Javascript project and renaming a .JS file to .TS did not show the dialog to enable TypeScript for the project (as seen in Ander's BUILD presentation).",
    "LastUpdatedDate": "2014-05-20T16:48:56.487-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "typescript",
    "ReportedDate": "2014-04-21T02:13:44.45-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Fixed"
    },
    "Summary": "VS Express 2013 for Web with Update 2 RC does not provide TypeScript new project templates",
    "Type": {
      "Name": "Unassigned",
      "Id": 5
    },
    "VoteCount": 1,
    "Id": 2452
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "We'll need some additional information to figure out what happened here. Did you have a previous version of TypeScript installed? Are there no visible errors of any kind during setup, Visual Studio startup, etc? Have you tried repairing your Visual Studio install?",
      "PostedDate": "2014-04-22T18:06:33.463-07:00",
      "Id": 142695
    },
    {
      "Message": "Closing for now -- please re-open if you can provide the requested information. Thanks!\n\r\n\r** Closed by RyanCavanaugh 04/28/2014 10:49AM",
      "PostedDate": "2014-04-28T10:49:48.91-07:00",
      "Id": 145829
    },
    {
      "Message": "Sorry for the long delay in getting back to you.\r\n\r\nI did not have a previous version of TypeScript installed, in fact this is installed on a clean install of Windows 8 (upgraded to 8.1).\r\n\r\nThere are no visible errors of any kind during setup or startup.  I have just now performed a repair on VS Express for Web, but it has not resolved this issue.\r\n\r\nI do have the Node.js Tools Beta installed, and I don't recall if I put that on before or after Update 2 RC.",
      "PostedDate": "2014-05-07T12:40:43.01-07:00",
      "Id": 145831
    },
    {
      "Message": "Another update, I've just installed the final Update 2 package overtop of the Update 2 RC, and it has restored the Typescript node as expected.  This is resolved.",
      "PostedDate": "2014-05-14T23:40:07.29-07:00",
      "Id": 146707
    },
    {
      "Message": "Good to hear. Hopefully it was just an RC issue then.",
      "PostedDate": "2014-05-20T16:48:52.897-07:00",
      "Id": 147275
    }
  ]
}