{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "I'm going to close this as a duplicate of https://typescript.codeplex.com/workitem/1611 since that item is a little cleaner and easily for folks to find via search given the actual nature of the bug here. Compile On Save should be working in general but we're aware of some issues with it not working at times which we are trying to pin down.",
    "ClosedDate": "2013-08-29T18:41:42.517-07:00",
    "CommentCount": 6,
    "Custom": null,
    "Description": "Having just reinstalled my system, I find that the latest version of Web Essentials 2012 has removed all TypeScript support:\r\n\r\nhttp://vswebessentials.com/changelog\r\n\r\nAccording to the docs there, one should use the \"compile on save\" setting installed with main TypeScript plugin:\r\n\r\nhttp://blogs.msdn.com/b/typescript/archive/2013/01/21/announcing-typescript-0-8-2.aspx\r\n\r\nHowever, at least in 0.9.1.1 on my system, this does not seem to do anything. No js files are changed/generated. What am I missing?",
    "LastUpdatedDate": "2013-08-29T18:41:42.517-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "typescript",
    "ReportedDate": "2013-08-27T05:15:55.75-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Duplicate"
    },
    "Summary": "Visual Studio 2012 does not compile ts to js",
    "Type": {
      "Name": "Unassigned",
      "Id": 5
    },
    "VoteCount": 4,
    "Id": 1603
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Are you sure they're not generated? Web Essentials had an additional feature: it added the generated files to your project so they'd be visible in the Solution Explorer. Vanilla TS does not do that.",
      "PostedDate": "2013-08-27T05:38:33.853-07:00",
      "Id": 111278
    },
    {
      "Message": "Yes, if I delete the existing .js file, edit the .ts file and save from VS, then no new .js file is created.\n\nAny idea how I'd go about debugging this for you?",
      "PostedDate": "2013-08-27T06:42:02.69-07:00",
      "Id": 111282
    },
    {
      "Message": "I can confirm I have \"Automatically compile TypeScript files which are part of a project\" set.\n\nThis is an almost pristine installation of VS2012 so I'm surprised to see these problems...",
      "PostedDate": "2013-08-28T02:15:39.157-07:00",
      "Id": 111377
    },
    {
      "Message": "Do you have the options under Tools -> Options -> Text Editor -> TypeScript -> Project enabled? Please re-open if so. Thanks!\n\r\n\r** Closed by RyanCavanaugh 08/27/2013 1:58PM",
      "PostedDate": "2013-08-27T13:58:59.923-07:00",
      "Id": 111378
    },
    {
      "Message": "The interesting thing is that the Error pane shows errors/warnings for the .ts files, so it's obviously working to some extent.",
      "PostedDate": "2013-08-28T03:19:04.01-07:00",
      "Id": 111383
    },
    {
      "Message": "I had the same problem until just now - see [this blog post](https://typescript.codeplex.com/wikipage?title=Compile-on-Save). Just ensure that when you add the import, don't use notepad.exe or you may accidentally put the <import/> into a comment section like I did at first.\n\nI have this working now with 0.9.1.1 but it seems sporadic. Sometimes, changes aren't picked up. I can't find a reliable repro but it's definately patchy.",
      "PostedDate": "2013-08-28T03:37:12.61-07:00",
      "Id": 111384
    }
  ]
}