{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "It sounds like you're using the old version of either a project file or the TypeScript Targets file. An up-to-date version won't show that message. The latest version of the TypeScript build task uses an @file behind the scenes automatically.\n\nYou should be able to update your project to use the latest TypeScript.targets to fix the problem; see a new default TS project for how to do this. Feel free to open a StackOverflow question or discussion forum post on this if you need more details. Thanks!",
    "ClosedDate": "2013-10-11T14:00:40.587-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "When a project has either a lot of .ts files, long file paths or both the compilation command line becomes too long and the build fails.\r\n\r\n\r\n> Error\t13\tThe command \"\"C:\\Program Files (x86)\\Microsoft SDKs\\TypeScript\\tsc\" \r\n{REALLY LONG COMMAND LINE OF ALL {path}\\*.ts FILES HERE}\"\"  \r\nexited with code 1\r\n\r\n\r\nOne developer on our team has a deep path for his repository:\r\n(ie. c:\\users\\johnathan doington\\documents and settings\\my projects\\projectx\\src\\Website\\Scripts\\App\\Module\\Component\\SomeSpecificLibrary.ts)\r\n\r\nWe may have 60+ .ts files.  Recently he added a new .ts file and began getting compilation errors.  For now I've asked him to move his repo so that his full path is shorter... but this workaround won't last long.\r\n\r\nThere are two other TypeScript bugs reported and closed that are related.  In 1695 the workaround suggests we use the @file command line option but does not specify how to automate this as part of our build.  Is the suggested workaround really that we manually generate a file of all the .ts files to build?  Is there an easy way to do this?\r\n\r\n__Also, it seems that for TypeScript to grow in usage this issue needs to be addressed.  Our project is big but probably a \"medium size\" web application.  Others will surely encounter this as adoption grows.__\r\n\r\n__Related (but closed) issues:__\r\nhttp://typescript.codeplex.com/workitem/1695\r\nhttp://typescript.codeplex.com/workitem/597",
    "LastUpdatedDate": "2013-10-11T14:00:40.587-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "typescript",
    "ReportedDate": "2013-10-11T08:13:59.437-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "External"
    },
    "Summary": "Build fails when TSC command line too long",
    "Type": {
      "Name": "Unassigned",
      "Id": 5
    },
    "VoteCount": 2,
    "Id": 1779
  },
  "FileAttachments": [],
  "Comments": []
}