{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "We are aware of some issues with intellisense in some scenarios with large projects. \n\nAre you seeing this in all projects (even single file). Can you run devenv /setup from the developer command prompt to re-configure the typescript extension.",
    "ClosedDate": "2013-01-30T12:31:33.88-08:00",
    "CommentCount": 17,
    "Custom": null,
    "Description": "So I have the typescript extension installed and I can see the new project type (\"HTML App with TypeScript\" and the \".ts\" file type). Everything seems to work (compilation, error highlighting etc.) but I am not able to get IntelliSense to work correctly. Hovering over a parameter displays its type but code completion and \"list members\" do not work. Doesn't matter if I press Strg + Space or select List Members from the menu, nothing happens.\r\n\r\nI tried to disable/enable \"auto list members\" in the options, I even reset all the options. IntelliSense works fine in C# projects and it even works fine in the .js file that is generated.",
    "LastUpdatedDate": "2014-06-06T05:56:32.483-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "High",
      "Severity": 150,
      "Id": 3
    },
    "ProjectName": "typescript",
    "ReportedDate": "2012-10-02T04:34:36.787-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "External"
    },
    "Summary": "TypeScript IntelliSense not working in VS2012",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 7,
    "Id": 24
  },
  "FileAttachments": [
    {
      "FileId": 663586,
      "FileName": "myExtensions.png",
      "DownloadUrl": ".\\663586"
    }
  ],
  "Comments": [
    {
      "Message": "Hi\n\nFollowing this worked for me.\n\nhttp://blogs.msdn.com/b/timart/archive/2012/10/02/typescript-project-in-visual-studio-2012.aspx",
      "PostedDate": "2012-10-03T23:44:55.347-07:00",
      "Id": 78518
    },
    {
      "Message": "Hi, as I said, I can see the project type and everything is working fine - only IntelliSense is not. The blog describes how to install the plugin.",
      "PostedDate": "2012-10-04T10:44:57.49-07:00",
      "Id": 78578
    },
    {
      "Message": "I'm having the same issue. The plugin installed and typescript files compile. I get error's underlined in the editor but intellisense doesn't work.",
      "PostedDate": "2012-11-11T17:08:14.53-08:00",
      "Id": 82206
    },
    {
      "Message": "I'm having the same issue.  Everything works fine but Intellisense!  It do works one time.  After I restart Visual Studio 2012, all the Intellisense feature was just missing forever.  The others like Go To Definition, Rename (Refactoring) are working fine.",
      "PostedDate": "2013-01-06T09:29:26.127-08:00",
      "Id": 85439
    },
    {
      "Message": "Is there anyway could fix this Intellisense problem?  I even reset all user settings which still can't made Intellisense back to work. :(",
      "PostedDate": "2013-01-10T12:46:01.247-08:00",
      "Id": 85727
    },
    {
      "Message": "Please reopen if you're still seeing this on 0.8.2.0. Thanks!\n\r\n\r** Closed by RyanCavanaugh 01/28/2013 5:08PM",
      "PostedDate": "2013-01-28T17:08:26.347-08:00",
      "Id": 87638
    },
    {
      "Message": "still the same issue with 0.8.2",
      "PostedDate": "2013-01-29T01:44:31.97-08:00",
      "Id": 87639
    },
    {
      "Message": "I'm also not getting intellisense.  INstalled TS 0.8.2.0 today.  It definitely used to work.\nMight be related: when I press \"(\" on the keyboard at the end of a function, it brings up the function's parameters.  Just no auto-complete or member-listings when I press \".\" or  ctrl-space...",
      "PostedDate": "2013-01-29T03:11:34.627-08:00",
      "Id": 87648
    },
    {
      "Message": "After updating to 0.8.2 today I'm not not seeing Intellisense, even for language keywords (export, class, etc), however as briekie experienced, if I type in a function I get the tooltip of the function arguments. Earlier today on version 0.8.0 Intellisense was working fine.\nAlso, I'm not sure if it's related, but Visual Studio's theme and \"Font and Colors\" settings seem to have reset to default as well.",
      "PostedDate": "2013-01-31T11:26:52.863-08:00",
      "Id": 87923
    },
    {
      "Message": "MySQL Tools for VS2012 caused the breakout for me!!!!\n\nhttps://rhnatiuk.wordpress.com/2013/03/08/typescripts-intellisense/#comment-1173",
      "PostedDate": "2013-03-13T23:57:33.78-07:00",
      "Id": 93225
    },
    {
      "Message": "This still happens for me (using the latest language pack) when referencing large typescript files.  For instance when I reference: https://github.com/NTaylorMullen/EndGate/blob/master/EndGate/tests/EndGate.Core.Client.JS.Tests/Scripts/endGate.core.client.ts in any of my files my intellisense completely dies.  It picks up when something is invalid but it does not provide auto completion.  Ex: if I start typing \"window.\" I get no drop down for potential options.  But if I type window.foo = 1234 I get red squiggly saying that the property \"foo\" does not exist on the object window.\r\n\r\nAs a side note, that \"large\" typescript file is generated from a custom (super hacked & poorly coded) powershell script.  It's all valid typescript however.  If I reference the generated js version in one of my js files I get full intellisense support.\r\n\r\nAttached a SS of the addons that I have (not many).\r\n",
      "PostedDate": "2013-04-13T22:32:28.363-07:00",
      "Id": 96919
    },
    {
      "Message": "Just figured out what's causing the failed Intellisense.  If you modify the prototype of any of the primitive objects the intellisense just dies, after commenting out my primitive type extensions the intellisense is back.",
      "PostedDate": "2013-04-14T22:03:58.59-07:00",
      "Id": 96984
    },
    {
      "Message": "Confirmed DotNetWise's report mentioned in http://rhnatiuk.wordpress.com/2013/03/08/typescripts-intellisense\n\nIn \"Programs and Features\", locate MySQL Connector Net 6.6.5, and click Change; follow the prompts, and uncheck those boxes for VS integration.\n\nPlease make sure you close all instances of VS before removing the VS integration.\n\nIntelliSense then works like a charm.",
      "PostedDate": "2013-05-09T18:02:26.58-07:00",
      "Id": 99873
    },
    {
      "Message": "I had the same issue, with typescript 0.9 and Visual Studio 2012 Update 3.\n\nThe problem was caused by MySQL extensions.",
      "PostedDate": "2013-06-28T12:17:16.473-07:00",
      "Id": 104566
    },
    {
      "Message": "I also confirm DotNetWise's report\n\n> In \"Programs and Features\", locate MySQL Connector Net 6.6.5, and click Change; follow the prompts, and uncheck those boxes for VS integration.",
      "PostedDate": "2013-06-29T22:28:21.363-07:00",
      "Id": 104667
    },
    {
      "Message": "I had the same issue. Removing VS integration in MySQL Connector .NET worked for me too, thanks",
      "PostedDate": "2013-07-03T05:10:25.157-07:00",
      "Id": 104971
    },
    {
      "Message": "Same issue here, removing the MySQL shizzle worked. Thanks for the helpful post.",
      "PostedDate": "2014-06-06T05:56:32.483-07:00",
      "Id": 149049
    }
  ]
}