{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "As part of our move to GitHub, we're closing our CodePlex issues and suggestions and asking that people move them to the GitHub issue tracker for further discussion.  Some issues and feature requests may already be active on GitHub, so please make sure to look for an existing issue before filing a new one.\n\nYou can find our GitHub issue tracker here:\nhttps://github.com/microsoft/typeScript/issues\n",
    "ClosedDate": "2014-07-28T15:20:16.707-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "One optimization that has a significant effect on compiler performance in other managed-code compilers like Scala is the use of a compiler server. The speedup comes from the runtime's ability to keep \"hot\" code in JIT'ed form. Like the CLR or the JVM, many javascript runtimes have optimizations that only become active after the code has been executed a certain number of times. However, without a compiler server, all of that information is thrown away each time the compiler runs. While the situation is improved somewhat for large projects by batch compiling files in one command, an even larger optimization might occur by hosting a typescript compiler server that keeps all of the typescript code executing continuously. This would greatly speed up, for example, watch tasks in grunt that compile typescript files on save, or the corresponding compile-on-save feature of visual studio.\r\n\r\nOne of the barriers to implementing a compiler server might be the extensive use of static fields throughout the compiler code. For example, TypeScript.Debug.currentAssertionLevel. It may be necessary to refactor code like this to use a dependency injection container or similar pattern instead of static state that would otherwise have to be reset to the defaults each time the compiler server started a new job.",
    "LastUpdatedDate": "2014-07-28T15:20:16.707-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "typescript",
    "ReportedDate": "2014-06-06T09:50:32.197-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "External"
    },
    "Summary": "TypeScript compiler server, related changes",
    "Type": {
      "Name": "Unassigned",
      "Id": 5
    },
    "VoteCount": 1,
    "Id": 2546
  },
  "FileAttachments": [],
  "Comments": []
}