{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "Please re-open this if you can provide more details to help us track down exactly what errors you're seeing. What exactly is the error about the map files? What settings do you have in your project as far as source maps go?",
    "ClosedDate": "2014-03-26T17:28:10.85-07:00",
    "CommentCount": 1,
    "Custom": null,
    "Description": "We have a relatively small typescript codebase that we've been developing since version 8.0 or so of TS.  We recently received VS2013, so we thought it was a good time to upgrade to the latest TS and Web Essentials.  We had been holding off because of the breaking changes.  We felt they would be manageable with this upgrade.  We were apparently mistaken.\r\n\r\nWe're encountering all sorts of problems.  There are many compilation errors (which was expected) and we're working our way through them. \r\n\r\nIn the past, TS was generating the .js file, the .map file, and the min.js file.  In the latest version, it seemed to only update the .js file inside of Visual Studio, so we went and deleted the .map and .min files.  we weren't using the mapping, and the minification is handled by bundler anyway.  Unforunately, this seems to blow up everything.  Everything seemed to be working.  We could make changes to our files, and the js file would be updated.  Now we're getting errors related to the map file not being found.  I can't find an option anywhere to tell TS not to generate or worry about .map files.  I don't know why it's even looking at them.\r\n",
    "LastUpdatedDate": "2014-03-26T17:28:10.85-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "typescript",
    "ReportedDate": "2014-03-25T15:31:28.6-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Need More Info"
    },
    "Summary": "Upgrading to 1.0 RC",
    "Type": {
      "Name": "Unassigned",
      "Id": 5
    },
    "VoteCount": 1,
    "Id": 2355
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "See here for language changes: https://typescript.codeplex.com/wikipage?title=Known%20breaking%20changes%20between%200.8%20and%200.9&referringTitle=Documentation\n\nThe option to generate Source Maps is in Project Properties -> TypeScript Build -> Debugging -> Generate Source Maps.\n\nIt's not clear from your description exactly what's going on. ",
      "PostedDate": "2014-03-25T16:07:35.68-07:00",
      "Id": 138820
    }
  ]
}