{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "As part of our move to GitHub, we're closing our CodePlex suggestions and asking that people move them to the GitHub issue tracker for further discussion.  Some feature requests may already be active on GitHub, so please make sure to look for an existing issue before filing a new one.\n\nYou can find our GitHub issue tracker here:\nhttps://github.com/microsoft/typeScript/issues\n",
    "ClosedDate": "2014-07-28T15:18:10.91-07:00",
    "CommentCount": 11,
    "Custom": null,
    "Description": "This issue was raised once on WebEssentials ([here](https://github.com/madskristensen/WebEssentials2013/issues/1032)) already but they told me it's an issue of TypeScript.\r\n\r\n- - - - - - -\r\n\r\nWhen I save a TypeScript file it generates the javascript and map file as it should be. The problem is that the generated files are NOT automatically added to the project file references. This is a big problem since we're using T4MVC which doesn't create links to those files. Another problem is that the web-publish doesn't publish js files since they are unknown (not in project).\r\n\r\nAre there any plans to nest the .js and .map files under the .ts files on generation?",
    "LastUpdatedDate": "2017-11-27T11:51:33.707-08:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "typescript",
    "ReportedDate": "2014-05-09T04:12:53.593-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "External"
    },
    "Summary": "Add option for nesting TypeScript output in project",
    "Type": {
      "Name": "Unassigned",
      "Id": 5
    },
    "VoteCount": 7,
    "Id": 2497
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Our experience has been the complete opposite. When TypeScript projects nested the .js output in an earlier version we had a lot of problems with these files ending up in source control.\n\nFor the publishing etc. I would consider writing a powershell script that copies the .js files to the necessary folder.",
      "PostedDate": "2014-05-09T09:44:50.067-07:00",
      "Id": 146075
    },
    {
      "Message": "I had this issue also.  There's are VS plugins to allow nesting, but it became a pain to work with at times.  In the end I just wrote a build event script.  If using GIT, it doesn't matter if the .js files are in the project tree or not, they will all be picked up via the file system itself (I had to use .gitignore).  If nesting is an issue, it's only with TFS.  IMHO TS should have an option to nest .js files for GIT users.\n\n",
      "PostedDate": "2014-05-09T10:38:12.85-07:00",
      "Id": 146082
    },
    {
      "Message": "__I would welcome an option to choose if it should be nested or not.__\n\nThere is another problem that devs have to face if they are using azure web service as deployment platform:\nThe deployment package will ONLY contain files that are referenced in the project file, nothing more, nothing less.",
      "PostedDate": "2014-05-09T12:05:34.573-07:00",
      "Id": 146088
    },
    {
      "Message": "We used to do this and had to change it for a few good reasons (source control support comes to mind) but I'm marking this as a suggestion for others to upvote if it's a priority.",
      "PostedDate": "2014-05-09T18:15:01.57-07:00",
      "Id": 146149
    },
    {
      "Message": "Thank you to at least consider adding it.",
      "PostedDate": "2014-05-11T00:32:22.703-07:00",
      "Id": 146205
    },
    {
      "Message": "Btw, this is not a TS issue. This is about how you structure your project file. We do not think this is the best way to organize your TS project for the reasons outlined above. But if you want to do it, just use the dependantupon tags in your project file:\n   <Content Include=\"file.js\">\n     <DependentUpon>file.ts</DependentUpon>\n   </Content>",
      "PostedDate": "2014-05-18T12:03:40.867-07:00",
      "Id": 146992
    },
    {
      "Message": "Thats why I reported it to the WebEssentials Team because they will deal with the project structure and nest those files. Could please someone talk to them directly? I'm just a guy from outside that likes to get a clarification if this vital feature will be added or not.\nThank you.",
      "PostedDate": "2014-05-19T05:56:28.497-07:00",
      "Id": 147037
    },
    {
      "Message": "Personally, I think making it difficult for people to open the generated .js files by forcing them to enable \"view all files\" is terrible idea (Web Essentials split screen is just annoying for me).  At the very least, I would suggest adding the ability to right-click the .ts file, or edit window, and have the menu command to open the resulting .js file.  ",
      "PostedDate": "2014-05-19T20:57:53.167-07:00",
      "Id": 147130
    },
    {
      "Message": "To me, type-script is like coffee-script. There is a .ts file and there has to be a .js file which is usable. beside that, there is a .ts.map file as support for the browser.\n\n@mhegazy:\nIt's not an option for me or my team to add these files as nested manually because it's too error prone and T4MVC won't work anymore (which is very vital for us).\n\n@jamesnw:\n#1: I don't like the split view either (which can be disabled).\n#2: Adding the files as nested would be enough. People are used to look at nested files. It works for coffee-script, why not for type-script as well?\n\nI think it's not good to block a feature that people ask for (my whole company, 200+). Why not just sitting together with the WebEssentials Team and make it possible instead blaming the other team for beeing reluctant?\n\nI hope it's possible to work on that, thanks.",
      "PostedDate": "2014-05-20T01:09:32.093-07:00",
      "Id": 147148
    },
    {
      "Message": "superb, can't even modify my comment... sorry for the headliner-style, should be \"hash-1:\" ...",
      "PostedDate": "2014-05-20T01:10:59.313-07:00",
      "Id": 147149
    },
    {
      "Message": "1. I know. ;)\n2. I agree - which is why I said \"At the very least...\".  My original comment is clearly FOR nesting. ;)",
      "PostedDate": "2014-05-20T09:57:24.497-07:00",
      "Id": 147211
    }
  ]
}