{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "",
    "ClosedDate": "2013-04-18T10:16:36.057-07:00",
    "CommentCount": 2,
    "Custom": null,
    "Description": "Hi,\r\n\r\nI've noticed that it works to either define something of type \"string\" or type \"String\". I don't really know what the difference is, but i've tripped myself up by accidentally referring to the uppercase one.\r\n\r\nShould just the lowercase version be allowed, or does the uppercase one have a purpose as well?",
    "LastUpdatedDate": "2013-08-13T09:56:06.447-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "typescript",
    "ReportedDate": "2013-04-17T02:12:47.563-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "By Design"
    },
    "Summary": "String / string casing",
    "Type": {
      "Name": "Unassigned",
      "Id": 5
    },
    "VoteCount": 1,
    "Id": 919
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "\"string\" is a keyword that refers to the \"String\" primitive type.  Section \"3.2.3 The String Type\" of the language specification covers this, namely:\n\n_The String primitive type corresponds to the similarly named JavaScript primitive type and represents sequences of characters stored as Unicode UTF-16 code units.\n\nThe string keyword references the String primitive type and string literals may be used to write values of the String primitive type.\n\nFor purposes of determining type relationships (section 3.8) and accessing properties (section 4.10), the String primitive type behaves as an object type with the same properties as the global interface type ‘String’._\n\n\nSection \"3.6.1 - Predefined types\" also states:\n\n_The any, number, bool, string, and void keywords reference the Any type and the Number, Boolean, String, and Void primitive types respectively._",
      "PostedDate": "2013-04-18T10:16:04.777-07:00",
      "Id": 97376
    },
    {
      "Message": "That all makes perfect sense.\n\nI'll just give the feedback that it's an easy mistake to make (especially if not using an editor that syntax colors \"string\" but not \"String\"). It seems like it would be an error 99.999% of the time to specify something as type \"String\" instead of \"string\".",
      "PostedDate": "2013-04-18T18:20:37.34-07:00",
      "Id": 97452
    }
  ]
}