{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "As part of our move to GitHub, we're closing our CodePlex suggestions and asking that people move them to the GitHub issue tracker for further discussion.  Some feature requests may already be active on GitHub, so please make sure to look for an existing issue before filing a new one.\n\nYou can find our GitHub issue tracker here:\nhttps://github.com/microsoft/typeScript/issues\n",
    "ClosedDate": "2014-07-28T15:18:28.377-07:00",
    "CommentCount": 1,
    "Custom": null,
    "Description": "Non-standard JavaScript extensions which are only supported by a single browser or small number of browsers should be moved to a separate .d.ts file. There should be a compiler option to optionally include this new .d.ts file.\r\n\r\nThis would make it easier to create standards-compliant JavaScript code.\r\n\r\n\r\nUse case example:\r\n\r\nWe are currently migrating an old JavaScript code base that currently only supports IE quirks mode to TypeScript. We are also refactoring the code to support other browsers.\r\n\r\nIf we could optionally turn off declarations for non-standard JavaScript methods, then TypeScript would be a great tool to help us find code that is not standards compliant yet.",
    "LastUpdatedDate": "2017-11-27T11:51:33.707-08:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "typescript",
    "ReportedDate": "2013-07-25T01:13:30.217-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "External"
    },
    "Summary": "remove non-standard JavaScript declarations from lib.d.ts",
    "Type": {
      "Name": "Unassigned",
      "Id": 5
    },
    "VoteCount": 9,
    "Id": 1390
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Thanks for the suggestion. We have talked in the past about possible ways to refactor lib.d.ts into multiple files. This is one useful axis to think about.",
      "PostedDate": "2013-07-25T12:07:35-07:00",
      "Id": 107426
    }
  ]
}