{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "Thanks for logging this issue. We've moved to a new codebase on GitHub; please try your issue against the new compiler (once possible) and log an issue on the GitHub site if it still reproduces.",
    "ClosedDate": "2014-07-21T13:36:34.757-07:00",
    "CommentCount": 6,
    "Custom": null,
    "Description": "It would be nice if the debugging worked the same for Windows 8 apps like it does for IE apps. For example, when I am working with typescript on a web project I can set a breakpoint in the ts file. With Windows 8 projects I have to open the js file and set the break point.",
    "LastUpdatedDate": "2017-11-27T11:51:34.217-08:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "typescript",
    "ReportedDate": "2013-02-21T23:05:35.497-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "External"
    },
    "Summary": "Debugging doesn't work the same with Win8 apps",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 752
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Can you upload a simple repro project? This scenario is already supported. The Encyclopedia sample, for example, is a Win8 app where you can set breakpoints in the TypeScript.\n\r\n\r** Closed by RyanCavanaugh 02/25/2013 10:09AM",
      "PostedDate": "2013-02-25T10:09:45-08:00",
      "Id": 94498
    },
    {
      "Message": "I don't have a repro, however I have observed that this happens with remote debugging.",
      "PostedDate": "2013-03-26T22:37:43.747-07:00",
      "Id": 94499
    },
    {
      "Message": "Thanks for following up. Can you be more specific?  Is this totally broken and never works for you?  Or is there certain actions that fail or a general randomness you are seeing when trying to remote debug a Windows app?\n\nIf you are able to provide a project we can repro with this would be helpful.  Thanks!",
      "PostedDate": "2013-03-27T11:03:57.873-07:00",
      "Id": 94554
    },
    {
      "Message": "Please re-open if you're able to follow up with some answers to Bill's questions.\n\r\n\r** Closed by danquirk 03/28/2013 7:26PM",
      "PostedDate": "2013-03-28T19:26:23.803-07:00",
      "Id": 95430
    },
    {
      "Message": "Sorry for the delay, I wanted to make sure it wasn't isolated to just my one machine and that it never works rather than just an occasional issue.\n\nI am happy to share my project with you, although I would prefer send it to you offline. I'd rather not post it out in the public ... the form isn't clear on the attachments visibility. My email is steven at ischyrus.com.\n\nI have repro'd remote debugging to a Surface RT not working with ts files.  That is, it's not working with my two machines. It works locally just fine.\n\nBoth of my machines are fresh installs, with Update 1, and the latest Typescript 0.8.3.1.\n\n",
      "PostedDate": "2013-03-31T15:55:29.047-07:00",
      "Id": 95432
    },
    {
      "Message": "Thanks for the follow up.  We'll try and reproduce this ourselves before asking for your project.  We'll update this issue when we have results.  Thanks!",
      "PostedDate": "2013-04-03T10:43:09.193-07:00",
      "Id": 95764
    }
  ]
}