{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "",
    "ClosedDate": "2014-04-08T18:32:30.32-07:00",
    "CommentCount": 8,
    "Custom": null,
    "Description": "I have a project that I've been building using VS2013 with Update 2 CTP 2.  This morning I updated to Update 2 RC.  When I next attempted to build, the web project gave an error:\r\n\r\n\"Build: Unsupported locale: 'en-US'.\"   File VSTC\r\n\r\nA brand new TypeScript project does not have have error.\r\n\r\nA brand new MVC project with Typescript does not have this error.\r\n\r\nThe mvc project with the problem does have translations and is localizable, though I don't see how that could possibly be interacting with the TS compiler.\r\n\r\nThe Typescript configuration is:\r\n\r\nECMAScript 5\r\nCompile on Save enabled\r\nAllow implicit 'any' types enabled\r\nModule system: AMD\r\nNo other options selected.",
    "LastUpdatedDate": "2014-04-16T03:01:41.61-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "typescript",
    "ReportedDate": "2014-04-04T09:40:17.043-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Fixed"
    },
    "Summary": "Unsupported locale: 'en-US'",
    "Type": {
      "Name": "Unassigned",
      "Id": 5
    },
    "VoteCount": 1,
    "Id": 2382
  },
  "FileAttachments": [
    {
      "FileId": 823719,
      "FileName": "EMT.Monitor.Web.zip",
      "DownloadUrl": ".\\823719"
    }
  ],
  "Comments": [
    {
      "Message": "Are you able to share the affected project?\n\nI take it from your comments about translations that this project has files with Unicode characters in it. Is it possible that some of those files are saved with the wrong file encoding?",
      "PostedDate": "2014-04-04T13:43:07.6-07:00",
      "Id": 140602
    },
    {
      "Message": "I can't share this project easily.  The translations are stored in resx files in a separate project, so I don't think that would be the case.  I would need to see about getting permission.  I've tested some of our other projects, and they have the same problem. I have one of those projects that I can send, and I've attached it.\r\n\r\nI had to remove a bunch of code.  I hit the error in question as soon as I try to compile.",
      "PostedDate": "2014-04-04T14:23:45.927-07:00",
      "Id": 140608
    },
    {
      "Message": "Hm, I do not see that error on my machine. I have 6 errors and 34 warnings prior to upgrading the TypeScriptToolsVersion for the project, and after that I just have 35 warnings. The warnings are all related to missing references/assemblies. But you see the locale error even with these present?",
      "PostedDate": "2014-04-04T16:33:48.453-07:00",
      "Id": 140623
    },
    {
      "Message": "Okay had no idea you needed to go in and manually change the TypeScriptToolsVersion.  I opened the csproj file, and changed the xml.\n\n```\n<TypeScriptToolsVersion>0.9</TypeScriptToolsVersion>\n```\nto\n```\n<TypeScriptToolsVersion>1.0</TypeScriptToolsVersion>\n```\n\nIs this documented somewhere?  I think a lot of people could run into this problem.",
      "PostedDate": "2014-04-07T12:23:54.737-07:00",
      "Id": 140855
    },
    {
      "Message": "You should automatically be prompted by Visual Studio upon opening an old project that the tools version is behind the current version and it'll fix the project file for you if you say yes. It's possible that dialog somehow had focus stolen away from it by something else. Did upgrading the tools version resolve the errors for you though?",
      "PostedDate": "2014-04-07T18:59:05.283-07:00",
      "Id": 140908
    },
    {
      "Message": "I never got the dialog.  Did you when you opened the project?  Manually changing the tools version did work.",
      "PostedDate": "2014-04-08T07:05:45.757-07:00",
      "Id": 140946
    },
    {
      "Message": "Yes, I did get it automatically, that's the only reason I noticed that the tools version was behind. Hard to know what might have happened if you didn't see it. I recently did test a bunch of different variations of project upgrades between different TypeScript versions to ensure it was smooth and did things like automatically detect and upgrade the ToolsVersion as necessary. At least in the simple cases everything was working correctly. \n\nSince the upgrade did fix your issue I'm just going to close this since we don't have anything else to go on right now. As a quick test you could make a copy of your project and manually change the ToolsVersion to something < 1.0. When you open that project you should see the upgrade prompt. If you don't do re-open this and we can try to figure out what might've happened with your install that it isn't detecting this properly.",
      "PostedDate": "2014-04-08T18:32:25.47-07:00",
      "Id": 141040
    },
    {
      "Message": "+1  \nI think I dismissed the dialog by accident and didn't relate it to the error until I saw this thread.",
      "PostedDate": "2014-04-16T03:01:41.61-07:00",
      "Id": 142064
    }
  ]
}