{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "As part of our move to GitHub, we're closing our CodePlex suggestions and asking that people move them to the GitHub issue tracker for further discussion.  Some feature requests may already be active on GitHub, so please make sure to look for an existing issue before filing a new one.\n\nYou can find our GitHub issue tracker here:\nhttps://github.com/microsoft/typeScript/issues\n",
    "ClosedDate": "2014-07-28T15:18:55.987-07:00",
    "CommentCount": 2,
    "Custom": null,
    "Description": "Currently a file used in \"path\" of a reference comment is searched relative to the current file, which is fine for most situations. \r\n\r\nUnfortunately it makes it complicated to use module declarations that describe the globals like \"node.d.ts\". Currently you have to specify the relative path to \"node.d.ts\" which is obviously dependent on your folder-hierarchy. For a reference that is needed in every file of a node-project, this is rather complicated.\r\n\r\nIdeally I would like to use \r\n\r\n///<reference path='node.d.ts' />\r\n\r\nin every file, no matter in which subfolder it is.\r\n\r\nAlternatively, it may also be enough to create a command-line option for adding globals, where the declaration file is in the working directory from where tsc is executed (assuming tsc will always be called from the same folder).\r\n\r\nFor node it could look like this:\r\ntsc --global \"node.d.ts\" app.ts",
    "LastUpdatedDate": "2017-11-27T11:51:33.707-08:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "typescript",
    "ReportedDate": "2012-11-03T06:27:57.843-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "External"
    },
    "Summary": "Let reference comment search parent folders",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 4,
    "Id": 365
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Assigning to Jonathan who is managing our suggestions.",
      "PostedDate": "2012-11-05T16:52:12.953-08:00",
      "Id": 81725
    },
    {
      "Message": "It would also help, if one could specify absolute paths (instead of just relative ones).\n\n(I would actually prefer this over the suggested solution, since it makes integration with other tools and IDEs much, much simpler)",
      "PostedDate": "2013-03-06T23:58:42.697-08:00",
      "Id": 92507
    }
  ]
}