{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "Might have been some Azure problems we were having -- please re-open if you're seeing this lately. Thanks!",
    "ClosedDate": "2013-02-25T16:16:25.603-08:00",
    "CommentCount": 4,
    "Custom": null,
    "Description": "Neither type tooltips nor completion seem to work with Opera (12.02, Windows 7). Completion after dot starts, then hangs. \r\n\r\nWith Opera as my default browser, I wasn't aware of these features until they were mentioned in a discussion!-) Which is a pity, given that these tools are somewhat central to Typescript's goals.",
    "LastUpdatedDate": "2017-11-27T11:51:34.097-08:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "typescript",
    "ReportedDate": "2012-10-25T09:02:59.017-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "External"
    },
    "Summary": "Playground features severly limited with Opera",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 330
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "I see both completion lists and tooltips working for me on Opera 12.02 1578 on Windows 8.  Do you see the lack of these consistently?  Do you have a different build of Opera?",
      "PostedDate": "2012-10-25T11:18:01.737-07:00",
      "Id": 81011
    },
    {
      "Message": "Strange, I have the same build. And, yes, the lack is consistent, even on minimal examples (eg, 'console.log'). On loading the playground, Opera's error console shows\n\n[25.10.2012 21:22:43] JavaScript - http://www.typescriptlang.org/Script/vs/base/worker/workerMain.js\nWeb Worker exception\nSyntax error processing script\n\nbut I don't see a way to pin this down (another argument for having the playground source in the repo?-).\n",
      "PostedDate": "2012-10-25T12:30:41.563-07:00",
      "Id": 81017
    },
    {
      "Message": "I have now been able to see both features by using a second Opera instance, with a fresh profile.\n\nStill no luck with my main instance and default profile - I've given your site all permissions, cleared all caches, cookies and persistent storage, restarted the browser, disabled caching in dragonfly. \n\nI was hoping for a caching header issue, but chances are increasing that this is an Opera or local settings issue. If it wasn't for the site not working, I'd say the www.typescriptlang.org-related settings are no longer\ndifferent in the two Opera profiles..\n\nFrom comparing the network protocols, there should be some workerservers loading that do not appear in the faulty sessions. If I had unminified code, I would try to instrument the web workers, but without that, I don't see how to pursue this further. If other Opera users are not affected, you might want to close the issue.",
      "PostedDate": "2012-10-29T14:53:27.25-07:00",
      "Id": 81218
    },
    {
      "Message": "I'm still seeing this with my main opera instance but suspect its some local profile issue (with opera not telling me which profile entry is causing its webworkers to fail on the site, though it could be related to the many non-standard tricks on the site). So I won't reopen unless I can confirm otherwise.\n\nBtw, your playground team should look at mobile browsers, too. On my Nexus 7, none of the browsers I tried (chrome, opera mobile) could successfully use the playground.",
      "PostedDate": "2013-02-26T14:00:00.43-08:00",
      "Id": 91602
    }
  ]
}