{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "This is fixed with a recent checkin, should be in the next release.",
    "ClosedDate": "2013-07-03T15:48:33.287-07:00",
    "CommentCount": 4,
    "Custom": null,
    "Description": "The \"Announcing TypeScript 0.8.3.0\" article on the TypeScript Blog page (release notes) claimed that:\r\n\r\n\"The Visual Studio support for source level debugging of TypeScript no longer requires that the files being debugged are part of the current project\".\r\n\r\nIn two different projects I have tried to include only the *.ts files in the VS project file (exclude the compiled *.js/*.map files). I compile using the AMD option and generate source map files.\r\n\r\nWhen excluding *.js/*.map files from the project files, the result is that the debugger never hits a breakpoint in the imported (AMD) modules. It hits breakpoints of the scripts that were not imported using AMD though.\r\n\r\nReally hoping for this to get fixed for Version 0.9.0.0, I really would appreciate to keep only the source code (*.ts files) in the source control. All the *.js/*.map files really pollutes the change log.",
    "LastUpdatedDate": "2014-01-10T10:34:33.287-08:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "typescript",
    "ReportedDate": "2013-04-25T07:11:29.767-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Fixed"
    },
    "Summary": "Debugging with AMD without *.js/*.map files as part of VS project file",
    "Type": {
      "Name": "Unassigned",
      "Id": 5
    },
    "VoteCount": 1,
    "Id": 949
  },
  "FileAttachments": [
    {
      "FileId": 669244,
      "FileName": "TypeScriptAmdDebugging.zip",
      "DownloadUrl": ".\\669244"
    }
  ],
  "Comments": [
    {
      "Message": "Could you attach a project where you're seeing this behavior and then re-activate this bug? AMD shouldn't have been affecting whether this feature worked correctly.\n\r\n\r** Closed by danquirk 04/25/2013 1:39PM",
      "PostedDate": "2013-04-25T13:39:45.643-07:00",
      "Id": 98580
    },
    {
      "Message": "Hello.\r\n\r\nPlease find attached a simple sample project that demostrates the problems I have.\r\nNuGet packages are not included an need to be restored for the project to work.\r\n\r\nI expect that you will find the same as me; when *.js/*.map files are not inlcuded in the project, the breakpoints in Visual Studio won't work.\r\n\r\nHoping for this to get fixed!!",
      "PostedDate": "2013-04-26T05:37:45.27-07:00",
      "Id": 98583
    },
    {
      "Message": "Thanks for the repro..\r\n\r\nIn the 0.9.0 build I'm using the breakpoints are hit, though they don't show as resolved (open circle) when I set the breakpoint. I marked this as active and we're taking a look. ",
      "PostedDate": "2013-04-26T10:43:48.387-07:00",
      "Id": 98606
    },
    {
      "Message": "Works like charm with 0.9.0.1! 😊",
      "PostedDate": "2013-07-05T11:25:15.707-07:00",
      "Id": 105203
    }
  ]
}