{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "Thanks for reporting this! The issue has been fixed and can be tried out in the upcoming 0.9.5 release. We also have a beta available (https://typescript.codeplex.com/wikipage?title=TypeScript%200.9.5%20beta) if you'd like to try it out.",
    "ClosedDate": "2013-11-19T13:38:01.063-08:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "I am trying to upgrade my solution which is composed of ~30 .ts files from 0.8.3 to 0.9.0.1. However, Visual Studio 2012 Update 3 is not reporting any errors which makes it impossible for me to upgrade. I can use tsc.exe in command line but the reported errors are so many that it would be too tedious of a task to try and fix them all in this way.\r\n\r\nHere are the steps to reproduce:\r\n1. Open attached solution in Visual Studio 2012 and open Problematic.ts,\r\n2. \"nonExistingMethod1() is underlined and reported in error list (View->Error List),\r\n3. make a slight modification to the document, for example: add a comment or remove a semicolon.\r\nFrom this point on, errors on this file are not reported anymore.\r\nTo get errors back you can either:\r\n- reopen the solution or\r\n- remove the reference to jquery.d.ts, wait for VS to repopulate Error list and add the reference back,\r\nHowever, again, any slight modification to the file will again break the Error list\r\n\r\nIf you comment out either \"problematic line 1\" or \"problematic line 2\" then all problems disappear, the problem exists only when both lines are present.\r\n\r\n```\r\n/// <reference path=\"jquery.d.ts\" />\r\n\r\n\r\n/*\r\nFor Error List to get populated in VS 2012, either problematic line 1 or problematic line 2 can be uncommented, but not both at the same time. If both are uncommented, VS stops reporting any\r\nerrors for the currently open file (this one) although running \"tsc ActionPerformer3.ts --comments --module AMD --sourcemap --target ES3\" in cmd produces the same erros in all cases\r\n*/\r\n\r\nexport class SomeClass {\r\n    \r\n    public static coldStart(actKey) {\r\n\r\n        SomeClass.nonExistingMethod1();  //an erroneous statement which should always be reported in the Error List\r\n        \r\n        var requestMsg: any = {};\r\n        requestMsg.SessionId = localStorage['SessionId'];   //problematic line 1\r\n\r\n        var formInit = $.Deferred();\r\n\r\n        return formInit.promise();                          //problematic line 2\r\n    }\r\n}\r\n```",
    "LastUpdatedDate": "2014-01-10T10:34:33.287-08:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "typescript",
    "ReportedDate": "2013-07-15T03:35:49.857-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Fixed"
    },
    "Summary": "Visual Studio Error List is broken with 0.9",
    "Type": {
      "Name": "Unassigned",
      "Id": 5
    },
    "VoteCount": 2,
    "Id": 1350
  },
  "FileAttachments": [
    {
      "FileId": 704609,
      "FileName": "TypeScriptHTMLApp4.zip",
      "DownloadUrl": ".\\704609"
    }
  ],
  "Comments": []
}