{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "Please do send us the whole project if you're able to and can't get a minimal repro. We definitely want to fix bugs of this nature so we can comb through the project ourselves for it if necessary. If you don't want to share it publicly you can send me a direct message on Codeplex with a link. Otherwise please re-open this issue with whatever additional details you can add/attach for us to repro it ourselves.",
    "ClosedDate": "2013-08-29T15:01:24.177-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "When I compile our not so large (a few tens of files, around 60 lines each) codebase, I see the compiler get into an infinite loop of some kind with ever growing memory consumption, until it crashes with an \"out of memory\" error message.\r\n\r\nI do not have a minimal repro, and I don't have the time to try to deduce it right now. I can send you my whole codebase if you're interested.\r\n\r\nSome more information:\r\n* I tried running the compiler under both NodeJS and tsc.exe (which ends up being Chakra, I guess?) with same result\r\n* I'm running Windows 8. Did not try it on any other OS.\r\n* Most of the files in the codebase are AMD modules, one or two are compiled as plain scripts (i.e. no modules of any kind)\r\n* I'm using jQuery (wuth UI), Knockout (with Mapping), RX, and Kendo, for all of which I have d.ts files, which originally came from DefinitelyTyped, but were subsequently modified by me.\r\n* This did not happen before I upgraded to 0.9.1.1\r\n* This stopped happening after I reverted back to 0.9.1.0",
    "LastUpdatedDate": "2013-08-29T15:01:24.177-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "typescript",
    "ReportedDate": "2013-08-27T15:21:28.133-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Need More Info"
    },
    "Summary": "Infinite loop with growing memory consumption introduced between 0.9.1.0 and 0.9.1.1 ",
    "Type": {
      "Name": "Unassigned",
      "Id": 5
    },
    "VoteCount": 1,
    "Id": 1605
  },
  "FileAttachments": [],
  "Comments": []
}