{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "It looks like most of the collapsible regions you're seeing in the js file are created by ReSharper.\n\nWe don't plan on adding collapsible regions outside the current supported constructs: classes, modules, top-level functions etc.",
    "ClosedDate": "2013-02-27T11:36:08.22-08:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "This is a minor one, also it relates to the Visual Studio plugin for TypeScript and not directly typescript it self.\r\nI don't know how the other editors behave either. They may or may not benefit from the same suggestion.\r\n\r\nWhen working with regular JavaScript, all sorts of blocks are collapsible, functions, objects, conditional statement blocks and so on, I don't know if this is something ReSharper brings to the table, in that case maybe ReSharper will add those ones 8.0 arrives as they seem to have scheduled TS support for then.\r\n\r\nAnyways, there isn't much that can be collapsed outside of modules, classes and root functions it seems.\r\n\r\nAs seen in the screenshot, the left hand code can only collapse the top level function.\r\nTo the right we have the corresponding js file open, note that a far greater amount of collapsible blocks exist.",
    "LastUpdatedDate": "2013-02-27T11:36:08.22-08:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "typescript",
    "ReportedDate": "2013-02-27T04:20:01.113-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "VS2012: Collapsable Blocks",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 765
  },
  "FileAttachments": [
    {
      "FileId": 631583,
      "FileName": "TypeScript Collapse.png",
      "DownloadUrl": ".\\631583"
    }
  ],
  "Comments": []
}