{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "As part of our move to GitHub, we're closing our CodePlex suggestions and asking that people move them to the GitHub issue tracker for further discussion.  Some feature requests may already be active on GitHub, so please make sure to look for an existing issue before filing a new one.\n\nYou can find our GitHub issue tracker here:\nhttps://github.com/microsoft/typeScript/issues\n",
    "ClosedDate": "2014-07-28T15:18:41.363-07:00",
    "CommentCount": 6,
    "Custom": null,
    "Description": "/// <reference path=\"typings/jquery/jquery.d.ts\"/>\r\nimport $ = require(\"jquery\");\r\n\r\n\r\nThe second line above seems to be causing itself problems:\r\n \"; expected\" with \"Expression statement is not assignment or call\" immediately following it.\r\n\r\nThe js however seems to be generated just fine.\r\n\r\n\r\n",
    "LastUpdatedDate": "2017-11-27T11:51:33.707-08:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "typescript",
    "ReportedDate": "2013-09-16T08:53:07.673-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "External"
    },
    "Summary": "Improve errors with incorrect require statements and AMD",
    "Type": {
      "Name": "Unassigned",
      "Id": 5
    },
    "VoteCount": 2,
    "Id": 1692
  },
  "FileAttachments": [
    {
      "FileId": 743888,
      "FileName": "workitem-1692.png",
      "DownloadUrl": ".\\743888"
    }
  ],
  "Comments": [
    {
      "Message": "I'm using the one from definitely typed and I'm pretty sure that's AMD. In either case this is still an issue as I get it on every single require statement I have.\n\nAlso I used an amd specific reference for knockout from definitely typed that yields the same result as above.\n",
      "PostedDate": "2013-09-17T07:30:18.957-07:00",
      "Id": 114785
    },
    {
      "Message": "It looks like you're trying to use a non-AMD jquery.d.ts file. You'll need to find or produce a .d.ts file that defines the jquery types for use in AMD to use 'import' with it\n\r\n\r** Closed by RyanCavanaugh 09/16/2013 4:44PM",
      "PostedDate": "2013-09-16T16:44:21.377-07:00",
      "Id": 114786
    },
    {
      "Message": "also even if it was non-AMD it should not be saying \"; expected\" or \"expression statement is not assignment or call\", it should be saying something more to the effect of the actual problem such as \"attempting to use non-amd module where amd module was expected.",
      "PostedDate": "2013-09-17T07:33:24.207-07:00",
      "Id": 114787
    },
    {
      "Message": "Changing to a suggestion and assigning to Jonathan. There are certainly no shortage of parser errors we would like to 'upgrade' to more actionable semantic errors.",
      "PostedDate": "2013-09-18T14:20:50.157-07:00",
      "Id": 114957
    },
    {
      "Message": "Just FYI, I only encounter this inside Visual Studio with my typescript code.",
      "PostedDate": "2013-10-15T07:38:09.44-07:00",
      "Id": 118480
    },
    {
      "Message": "another update: \nit didn't occur to me until today but when I disabled typescript support in resharper(didn't know this was available in resharper 8) the  \"; expected\" followed by \"expression statement is not assignment or call\" problem went away. Intellisense still doesn't completely work right but I think it has more to do with my setup because __I didn't see any of these issues on a fresh install of VS2012 with typescript only__.\n\nI think this was largely a conflict with resharper and so it shouldn't be considered an issue in typescript.\n\nI suggest closing the issue.",
      "PostedDate": "2013-10-16T17:48:37.4-07:00",
      "Id": 118666
    }
  ]
}