{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "As part of our move to GitHub, we're closing our CodePlex suggestions and asking that people move them to the GitHub issue tracker for further discussion.  Some feature requests may already be active on GitHub, so please make sure to look for an existing issue before filing a new one.\n\nYou can find our GitHub issue tracker here:\nhttps://github.com/microsoft/typeScript/issues\n",
    "ClosedDate": "2014-07-28T15:17:22.767-07:00",
    "CommentCount": 5,
    "Custom": null,
    "Description": "I would really like to be able to use a TypeScript version of the JavaScript code snippets when writing TypeScript in Visual Studio.",
    "LastUpdatedDate": "2017-11-27T11:51:33.707-08:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "typescript",
    "ReportedDate": "2013-04-22T21:08:06.037-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "External"
    },
    "Summary": "TypeScript snippets in VS",
    "Type": {
      "Name": "Feature",
      "Id": 1
    },
    "VoteCount": 23,
    "Id": 938
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Thanks for the suggestion.  We've had a few discussions on this internally, and something we'd like to add long term (not sure if it will make v1.0 though at this point).  Assigning to Jonathan to track this.",
      "PostedDate": "2013-04-23T20:09:59.447-07:00",
      "Id": 98283
    },
    {
      "Message": "Yes, please support Visual Studio Code Snippets in .ts files.   Thank you.",
      "PostedDate": "2013-11-02T18:58:36.5-07:00",
      "Id": 121598
    },
    {
      "Message": "I definitely wouldn't mind seeing this as well.  Could be useful on larger SPA applications.",
      "PostedDate": "2014-01-03T11:21:30.407-08:00",
      "Id": 129007
    },
    {
      "Message": "TypeScript code snippets for Visual Studio is a must when developing large applications. It would enhance developer productivity very much.",
      "PostedDate": "2014-02-17T03:20:50.757-08:00",
      "Id": 133791
    },
    {
      "Message": "Please add this feature as fast as you can! It would be a great improvement for our development team! We are building several spa-application in one project and reuse \"copy/paste\" much of our code across the whole solution.",
      "PostedDate": "2014-06-26T10:05:04.163-07:00",
      "Id": 150793
    }
  ]
}