{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "",
    "ClosedDate": "2012-10-03T14:29:44.76-07:00",
    "CommentCount": 3,
    "Custom": null,
    "Description": "class Collection extends Array {}\r\n\r\nResults in:\r\n\r\nA export class may only extend other classes, Array is an interface\r\n\r\n\r\nAssuming the class impl is primarily sticking to ES6 semantics, then this should be allowed",
    "LastUpdatedDate": "2013-11-04T14:32:18.057-08:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "typescript",
    "ReportedDate": "2012-10-01T14:46:48.607-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "Cannot subclass built-ins",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 13
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Yes - this is something we'd like to enable.  There are a few issues here:\n\n1) Of course, JavaScript doesn't allow correct subclassing of Array (you can't inherit the magic [[DefineOwnProperty]] behavior), and TypeScript won't help with that.\n\n2) TypeScript currently models the built-ins as interfaces instead of classes.  This is because none of the builtins satisfy exactly the same semantics as classes, though several are close.\n\n3) One current restriction in TypeScript classes relative to proposed ES6 classes, which is noted in the TypeScript spec section introducing classes, is that the extends clause expression must be a statically bound class name.  In the future, we expect to allow an arbitrary expression in this location, as ES6 classes would.  Once this is supported, any object whose type has a \"new()\" signature would be subclassable, including things like Array.\n\n",
      "PostedDate": "2012-10-02T03:32:51.157-07:00",
      "Id": 78261
    },
    {
      "Message": "@LukeH I'm with you on all 3 points, I guess I just hoped that you had crafted some magic for \"faking it\" :)",
      "PostedDate": "2012-10-02T12:41:54.79-07:00",
      "Id": 78334
    },
    {
      "Message": "I've been working on something for Errors [here](https://typescript.codeplex.com/discussions/465345).",
      "PostedDate": "2013-11-04T14:32:18.057-08:00",
      "Id": 121766
    }
  ]
}