{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "As part of our move to GitHub, we're closing our CodePlex suggestions and asking that people move them to the GitHub issue tracker for further discussion.  Some feature requests may already be active on GitHub, so please make sure to look for an existing issue before filing a new one.\n\nYou can find our GitHub issue tracker here:\nhttps://github.com/microsoft/typeScript/issues\n",
    "ClosedDate": "2014-07-28T15:17:21.72-07:00",
    "CommentCount": 2,
    "Custom": null,
    "Description": "Details:\r\n* https://typescript.codeplex.com/discussions/479411\r\n* https://github.com/facebook/react/issues/759\r\n\r\n> Is there a chance that this syntax (type assertion) will change? \r\n\r\n> While E4X was a failure, XML-like syntax extensions is a good and obvious idea, which perfectly might make it into some next ECMAScript version. But if it happens, it will be impossible to incorporate that syntax into TS because of type assertions.",
    "LastUpdatedDate": "2014-07-28T15:17:21.72-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "typescript",
    "ReportedDate": "2014-07-07T03:07:20.94-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "External"
    },
    "Summary": "Alternative syntax for type assertions to allow using React's JSX with TypeScript",
    "Type": {
      "Name": "Unassigned",
      "Id": 5
    },
    "VoteCount": 2,
    "Id": 2608
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "I think it's not really an issue, I have started to create a fork of the compiler that add jsx support and I just added a new syntax for typecast  syntax `<*string>myVar` in normal ts files both will works and in 'ts-jsx' files (files which have the jsx docblock) only the seconds syntax will work. ",
      "PostedDate": "2014-07-07T06:55:57.12-07:00",
      "Id": 151731
    },
    {
      "Message": "It is an issue as it was it which prevented the React team from adding TypeScript support to JSX.",
      "PostedDate": "2014-07-07T08:07:30.82-07:00",
      "Id": 151742
    }
  ]
}