{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "Please re-open if you're still seeing issues and are able to reproduce the steps.",
    "ClosedDate": "2013-02-14T15:52:13.933-08:00",
    "CommentCount": 5,
    "Custom": null,
    "Description": "After updating to 0.8.2 I'm not not seeing Intellisense, even for language keywords (export, class, etc), however if I type in a function I get the tooltip of the function arguments. Previously on version 0.8.0 Intellisense was working fine.\r\nAlso, I'm not sure if it's related, but Visual Studio's theme and \"Font and Colors\" settings seem to reset to default as well when I updated to 0.8.2.\r\nI've disabled Web Essentials, uninstalled/reinstalled the Visual Studio Typescript plugin, created a new VB project, created a new C# project, and created a new Typescript project with the same results.\r\n",
    "LastUpdatedDate": "2013-12-03T04:49:31.637-08:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "typescript",
    "ReportedDate": "2013-02-12T06:59:18.213-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "Typescript 0.8.2 Intellisense not working in Visual Studio 2012",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 718
  },
  "FileAttachments": [
    {
      "FileId": 631625,
      "FileName": "ActivityLog.xml",
      "DownloadUrl": ".\\631625"
    }
  ],
  "Comments": [
    {
      "Message": "Do you mean to say the IntelliSense stopped working for all languages?\n\nCan you uninstall Web Essentials and try without that, then try with Web Essentials installed?\n\nCan you take a look at the VS activity log (or attach it to the bug) to see if there are Errors in there?\n\nC:\\Users\\<yourname>\\AppData\\Roaming\\Microsoft\\VisualStudio\\11.0\\ActivityLog.xml",
      "PostedDate": "2013-02-13T11:04:08.387-08:00",
      "Id": 89206
    },
    {
      "Message": "No, I mean to say that IntelliSense no longer shows while editing Typescript files (.ts) even when they are added to an existing project, a new VB project, a new C# project, and a new Typescript project. All other files (vb, cs, etc) IntelliSense functions normally.\n\nI've uninstalled Web Essentials and tried with no luck.\nI've re-installed Web Essentials and tried with no luck.\n\nThe VS Activity Log doesn't provide any clues either (no entries since two weeks ago).",
      "PostedDate": "2013-02-14T07:53:32.413-08:00",
      "Id": 89302
    },
    {
      "Message": "I tried uninstalling Typescript 0.8.2 and installed Typescript 0.8.1.1, but unfortunately IntelliSense is still not working, despite having worked before on Typescript 0.8.1.1.\n\nI'm likely going to re-install Visual Studio 2012 in hopes that it will correct the problem. I'll report back after that.",
      "PostedDate": "2013-02-14T08:00:42.97-08:00",
      "Id": 89303
    },
    {
      "Message": "I have had the same issue for several weeks as well. The only remedy has been to perform a Visual Studio \"Repair\" from the installation disc, which can take well over an hour. After doing so the TypeScript intellisense returns. However as I have just experienced this morning performing any updates to installed extensions knocks intellisense offline again. Only for .ts files. Javascript, C3, CSS etc. all remain functional. \r\n\r\nAbout 20 minutes ago I updates my AnksSVN extension and lost my .ts intellisense as result. I have also seen this happen when updating CodeSmart and other extensions so I am not sure the problem is related to the extension but to the process of updating VS 2012.\r\n\r\nI have followed every offered solution I have found on the web. I have uninstalled/reinstalled TypeScript to the latest and earlier version, Removed every extension from Visual Studio, Unistalled/Reinstalled Web Essentials to the latest versions. etc. The only fix is a repair to Visual Studio.\r\n\r\nI have attached my activity log moments after losing intellisense from the extension update. Hopefully that may show something.\r\n\r\n",
      "PostedDate": "2013-02-27T07:30:48.27-08:00",
      "Id": 91682
    },
    {
      "Message": "Try disabling typescript intellisense for resharpen. You can find more info in this [Blog post](http://www.cloud-developer.eu/blog/2013/12/03/solved-intellisense-working-typescript-resharper-installed-using-visual-studio-2012/)\n\n",
      "PostedDate": "2013-12-03T04:49:31.637-08:00",
      "Id": 125930
    }
  ]
}