{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "We believe this is fixed in the TypeScript 0.8.2 release. Please reopen if you still experience this.",
    "ClosedDate": "2013-01-30T12:13:01.22-08:00",
    "CommentCount": 2,
    "Custom": null,
    "Description": "Periodically (but not consistently) when I'm debugging TypeScript (0.8.1) generated in Visual Studio, I'm unable to set breakpoints, by which I mean that the breakpoint shows up as a circle with a white center instead of red, and the breakpoint itself doesn't get hit when running the code. When I hover over the red circle, I get this message:\r\n\r\n\"The breakpoint will not currently be hit. Unexpected symbol reader error while processing AppData.js.map.\"\r\n\r\nGenerally, stopping my debug session, recompiling everything and then relaunching my project will fix the problem. \r\n\r\nI'm using WebEssentials to generate the compiled .js and associated .js.map files, though I don't know if that's related in any way or not.",
    "LastUpdatedDate": "2013-08-13T12:34:25.37-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "typescript",
    "ReportedDate": "2012-12-06T13:38:05.763-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "\"Unexpected symbol reader error\"",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 3,
    "Id": 537
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "I see something similar, except the tooltip message is \"The breakpoint will not currently be hit. No symbols have been loaded for this document\". Like you, stopping the debug session, doing a 'Rebuild Solution and restarting always resolves it.\nI think it's related to cross-class changes, i.e. if I make changes in a class then set a breakpoint where that class is used, I see this issue. Presumably an on-demand rebuild issue. Changes in the same or unrelated classes seem to be handled ok.\n[ VS2012SP1, TypeScript 0.8.1.1, Web Essentials 2.0 ]",
      "PostedDate": "2012-12-14T15:28:49.633-08:00",
      "Id": 84192
    },
    {
      "Message": "In case anyone else is having the \"The breakpoint will not currently be hit. No symbols have been loaded for this document\" problem and has been led here by Google:\n\nI had this problem for a few days.  Only typescript code had the 'no symbols loaded' problem, not my asp.net code, and it was happening in all of my projects, even ones I hadn't changed since this problem started happening.  None of the recommended stuff like rebuilding or cleaning projects or spending hours fiddling with debug settings or installing updates worked.\n\nStrangely, there were two Internet Explorers in the Visual Studio drop down browser list - I'm not sure how long that had been the case, but it had been more than a day, and I'm guessing it's exactly as long as this problem had been going on.  I tried running in another browser (even though breakpoints have never worked for me in any browser besides IE), then back to Internet Explorer (either of them), and suddenly breakpoints worked fine again, and next time I started VS, there was only one Internet Explorer in the browser list again.",
      "PostedDate": "2013-04-17T14:25:42.91-07:00",
      "Id": 97306
    }
  ]
}