{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "As part of our move to GitHub, we're closing our CodePlex suggestions and asking that people move them to the GitHub issue tracker for further discussion.  Some feature requests may already be active on GitHub, so please make sure to look for an existing issue before filing a new one.\n\nYou can find our GitHub issue tracker here:\nhttps://github.com/microsoft/typeScript/issues\n",
    "ClosedDate": "2014-07-28T15:17:23.173-07:00",
    "CommentCount": 4,
    "Custom": null,
    "Description": "If I rename a function/method parameter, I want the parameter's corresponding @param JSDoc tag to be updated with the new name. This currently doesn't occur in TypeScript 0.9.1.1 using Visual Studio 2010. (I don't currently have access to test this using the latest TypeScript release.)",
    "LastUpdatedDate": "2017-11-27T11:51:33.707-08:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "typescript",
    "ReportedDate": "2014-01-06T17:12:08.707-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "External"
    },
    "Summary": "Update @param JSDoc when renaming parameters",
    "Type": {
      "Name": "Feature",
      "Id": 1
    },
    "VoteCount": 10,
    "Id": 2075
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "This would be nice, but I don't think any of the other languages do that either, for example in C# you will get a warning if the param name is different from the argument, but no auto-renaming.\n\nI can't think of any reason why this should not be implemented.",
      "PostedDate": "2014-01-07T08:06:34.887-08:00",
      "Id": 129632
    },
    {
      "Message": "@nabog, I don't have experience with a lot of different languages, but I know that in Visual Studio 2010, if I rename a parameter or generic type parameter, the <param>, <paramref>, <typeparam> and <typeparamref> XML documentation elements are also updated.\n\nKeep in mind that I'm talking about using the built-in rename refactoring as opposed to manually editing the raw parameter name in the code.",
      "PostedDate": "2014-01-07T17:27:23.47-08:00",
      "Id": 129735
    },
    {
      "Message": "Great suggestion!  Definitely won't have time to put this in 1.0, but will assign to Jonathan who is handling feature suggestions for later releases.  Thanks!",
      "PostedDate": "2014-01-07T17:57:27.253-08:00",
      "Id": 129739
    },
    {
      "Message": "Ah! okay. That is a bit less interesting then. It looks like just a bug fix. I don't currently use the TypeScript renaming tool because it only works reliably within a specific file. \n\nC# files provide a much better renaming mechanism whereby when a parameter is edited a red underscore appears and control+(dot) brings up the context menu. Furthermore the C# renaming works reliably across multiple projects.",
      "PostedDate": "2014-01-08T05:23:31.82-08:00",
      "Id": 129789
    }
  ]
}