{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "This is fixed in the latest bits in the develop branch.",
    "ClosedDate": "2013-08-23T11:59:27.663-07:00",
    "CommentCount": 2,
    "Custom": null,
    "Description": "Originally from https://typescript.codeplex.com/workitem/1321\r\n\r\nI think I understand the logic behind that. Essentially the rule that should be followed could be stated as: If you want a comment preserved then don't place it before an ambient declaration or interface. \r\n\r\n I'll definitely bear this in mind as I'm structuring my TS from now on. Is this documented anywhere that I could refer back to? I've had a quick look at the spec but don't see any mention of this. If there is something to refer to then it might prevent me raising non-issues in future.\r\n\r\n By the way, this behaviour may have some bearing on your comment of May 17 at 12:01 AM on https://typescript.codeplex.com/workitem/995 : \"At the moment we don't intend to change the behavior here because some users rely on the /// reference being present in the JavaScript for some post processing by other tools.\"\r\n\r\n Effectively the presence of an ambient declaration or interface after the /// reference comments will strip them from the compiled JavaScript which will impact those other users that you mention. Maybe they're already aware of this behaviour but if not then perhaps they could be informed.\r\n\r\n All the best,\r\n John",
    "LastUpdatedDate": "2014-01-10T10:34:33.287-08:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "typescript",
    "ReportedDate": "2013-08-13T12:24:58.037-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Fixed"
    },
    "Summary": "Triple slash reference not emitted in JS if first statement is TS code which doesn't have emit output",
    "Type": {
      "Name": "Unassigned",
      "Id": 5
    },
    "VoteCount": 2,
    "Id": 1507
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Thanks for logging this Dan - by the way the link to the previous work item should be http://typescript.codeplex.com/workitem/1321 - ie without the \":\" at the end.",
      "PostedDate": "2013-08-14T01:34:37.967-07:00",
      "Id": 109818
    },
    {
      "Message": "Thanks, fixed.",
      "PostedDate": "2013-08-14T11:08:57.137-07:00",
      "Id": 109906
    }
  ]
}