{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "Believe this to be fixed. Please re-open if you're still seeing this happen with 0.8.2.0. Thanks!",
    "ClosedDate": "2013-01-30T14:04:38.04-08:00",
    "CommentCount": 6,
    "Custom": null,
    "Description": "I had the following code:\r\n\r\nmodule Client {\r\n  export class ClientInstance {\r\n\r\n    parser: Parser;\r\n\r\n    parse:(cmd: string) => void {\r\n        this.parser.parse(cmd);\r\n    }\r\n\r\n    handle:(cmd: string, data: any) => bool {\r\n      ...\r\n    }\r\n  }\r\n}\r\n\r\nI'm aware that this code is not syntactically correct -- I was in the middle of editing it -- when Visual Studio hung up on me. It had highlighted the \"parser.parse(cmd)\" portion as invalid, so had obviously parsed some of the code. Killing VS2012 and reloading led to the same freezing. \r\n\r\nCompleting my edit, externally, to\r\n\r\n        parse(cmd: string): void {\r\n            this.parser.parse(cmd);\r\n        }\r\n        handle(cmd: string, data: any): bool {\r\n          ...\r\n        }\r\n\r\nallowed VS2012 to restart and continue without issue.",
    "LastUpdatedDate": "2017-11-27T11:51:35-08:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "typescript",
    "ReportedDate": "2012-11-21T06:26:16.52-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "Malformed construct freezes Visual Studio",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 474
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Are you using 0.8.1.0? I see an internal error reported by the compiler, but not a hang.",
      "PostedDate": "2012-11-26T14:36:36.823-08:00",
      "Id": 83058
    },
    {
      "Message": "It was 0.8 before, I believe (I did the upgrade right around when I posted); now I'm running 0.8.1.0, and the hang does (now) let go after a minute or so, giving me enough time to click elsewhere (to try to quickly fix the code), wait for a minute... type something quick before it tries to parse again... wait for a minute...\n",
      "PostedDate": "2012-11-27T10:52:18.063-08:00",
      "Id": 83115
    },
    {
      "Message": "Do you have Web Essentials or any other plugin/extension installed that might be affecting things?",
      "PostedDate": "2012-11-27T14:55:33.13-08:00",
      "Id": 83137
    },
    {
      "Message": "I do indeed have Web Essentials installed. Figure that'll be the culprit?\n\nI'll try to give it a try tonight after uninstalling it.\n",
      "PostedDate": "2012-11-29T10:37:07.263-08:00",
      "Id": 83256
    },
    {
      "Message": "I don't have this issue in 0.8.1.1 but I do have an issue in 0.8.2. The hanging gets alot better if I disable Web Essentials 2.4.5. However, it still gets hung a little bit sometimes, (maybe half a second).",
      "PostedDate": "2013-02-13T10:54:22.387-08:00",
      "Id": 89203
    },
    {
      "Message": "Yes, I've started seeing it again now that I've upgraded my machines to 0.8.2, always after I change code that would lead to circular/duplicate/invalid definitions, calls or assignments. Copy-and-pasting code from one sourcefile to another seems to cause it most often for me, as I refactor code.\n\nI'm still using Web Essentials, but admit I haven't tried comparing when it's enabled or disabled.\n\nThis time is as bad as when I originally filed it; I've had to kill the VS process to get a response from it, but interestingly it responds immediately with a dialog asking if I want to save my work. If I cancel, it goes back to being very moody.\n",
      "PostedDate": "2013-02-13T12:29:34.207-08:00",
      "Id": 89231
    }
  ]
}