{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "As part of our move to GitHub, we're closing our CodePlex suggestions and asking that people move them to the GitHub issue tracker for further discussion.  Some feature requests may already be active on GitHub, so please make sure to look for an existing issue before filing a new one.\n\nYou can find our GitHub issue tracker here:\nhttps://github.com/microsoft/typeScript/issues\n",
    "ClosedDate": "2014-07-28T15:18:11.05-07:00",
    "CommentCount": 1,
    "Custom": null,
    "Description": "To install TypeScript 1.0 on VS2013, I have (as far as I know) to install VS2013 Update 2 RC.\r\n\r\nHowever, the VS2013 update 2 RC setup hangs during the Installation of Windows Phone SDK 8.1. Now I have to troubleshoot the Installation of the Windows Phone SDK that I don't even want or need, just to get TypeScript 1.0 support in VS2013. Please don't make me waste my time like that.",
    "LastUpdatedDate": "2017-11-27T11:51:33.707-08:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "typescript",
    "ReportedDate": "2014-04-05T10:02:31.547-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "External"
    },
    "Summary": "Provide a standalone TypeScript 1.0 setup for VS2013",
    "Type": {
      "Name": "Unassigned",
      "Id": 5
    },
    "VoteCount": 6,
    "Id": 2388
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Sorry to hear you're having setup trouble. An additional delivery vehicle does complicate the amount of work and setup testing we have to do which is part of why we avoided it. But if enough people find it useful we can investigate going this route. Marking as a suggestion for people to upvote.",
      "PostedDate": "2014-04-08T20:16:09.813-07:00",
      "Id": 141135
    }
  ]
}