{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "This is by design. Consider the scenario in a web-browser where you load several js files, each can reference classes in each other and we don't have a way to determine which are used and which are not. \n\n\nThe second issue you've reported about the ordering of classes. Can you open a new bug for that with a small repro.\n\nThanks!",
    "ClosedDate": "2013-05-17T10:00:45.02-07:00",
    "CommentCount": 1,
    "Custom": null,
    "Description": "In some languages (e.g. ActionScript3 where a lot of the new typescript devs are coming from) imports are the equivalent of typescripts ///<reference path='typescript.ts' /> references. \r\nThe --out parameter ist the equivalent of an swf compilation (put everything in one file)\r\n\r\nOne major advantage of the AS3 Compiler is, that it knows which classes are really used and only include these classes/files into the final package. It would be great if typescript had the same capabilities as i would make writing typescript for the browser a lot easier. ",
    "LastUpdatedDate": "2013-05-17T10:00:45.02-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "typescript",
    "ReportedDate": "2013-05-17T03:08:19.6-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "By Design"
    },
    "Summary": "Compilation with --out to only add files that are referenced in the code",
    "Type": {
      "Name": "Unassigned",
      "Id": 5
    },
    "VoteCount": 1,
    "Id": 1050
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "It would also be good if Typescript could put the referenced files in the right \"order\" as parent classes must be defined prior the child classes in Typescript",
      "PostedDate": "2013-05-17T03:35:35.903-07:00",
      "Id": 100441
    }
  ]
}