{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "As part of our move to GitHub, we're closing our CodePlex suggestions and asking that people move them to the GitHub issue tracker for further discussion.  Some feature requests may already be active on GitHub, so please make sure to look for an existing issue before filing a new one.\n\nYou can find our GitHub issue tracker here:\nhttps://github.com/microsoft/typeScript/issues\n",
    "ClosedDate": "2014-07-28T15:18:28.393-07:00",
    "CommentCount": 3,
    "Custom": null,
    "Description": "I would like to request the addition of an include-directive, e.g.:\r\n\r\n    /// <include path=\"...\" />\r\n\r\nUnlike `<reference>` which only references an external file, this would actually include the source code from the external file and compile it as though the included file was simple a chunk of content in the parent file.\r\n\r\nGenerated source-maps would need to be adjusted to correctly reflect the included file from which parts of the parent source were generated.\r\n\r\nThis has lots of uses, like first of all splitting a complex library across many files - down to very simple use-cases like including a copyright comment at the top of generated source-files.\r\n\r\nPlease see [this discussion](https://typescript.codeplex.com/discussions/466433) for further justification.\r\n",
    "LastUpdatedDate": "2017-11-27T11:51:33.707-08:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "typescript",
    "ReportedDate": "2013-11-08T06:41:18.6-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "External"
    },
    "Summary": "Feature: include directive",
    "Type": {
      "Name": "Unassigned",
      "Id": 5
    },
    "VoteCount": 3,
    "Id": 1874
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Reading the thread, I think the more general solution you're looking for are multifile modules. You can help vote that suggestion up: https://typescript.codeplex.com/workitem/759\r\n\r\nAlso marking this a suggestion for Jon to look at.",
      "PostedDate": "2013-11-08T10:17:14.43-08:00",
      "Id": 122422
    },
    {
      "Message": "Am I right in thinking that the planned improved support of -out in visual studio would cover this? See discussion here:\n\nhttps://typescript.codeplex.com/workitem/1799",
      "PostedDate": "2013-11-08T12:38:34.927-08:00",
      "Id": 122444
    },
    {
      "Message": "> Reading the thread, I think the more general solution you're looking for are multifile modules\n\nHow is it you think this is more generic?\n\nAnd include directive wouldn't just work for modules, so it seems more generic to me.\n\nAlso, I expect the language service (and IDEs) are going to benefit from this information being present in the actual source-files, as opposed to existing only fleetingly on the command-line where the language service and IDEs can't know about it.\n\n(unrelated, but this is something I already feel is a bit of a problem - the fact that things like `--out` and `--module` are command-line switches that actually affect the interpretation of the code... these ought to be directives, so the IDE can know about these settings, and so you don't need to explain in a README file how to build the project... don't most compiled languages have directives as well as command-line switch or build-files to specify these things?)\n\nAnyway, please also consider adding support for [incoming source-maps](https://typescript.codeplex.com/discussions/466433#PostContent_1120491) before making decisions - there are lots of ways to solve these problems, and rather than adding all of these features, I think it's in everybody's interest to get *one* feature that can address *as many* scenarios as possible, as opposed to many small solutions.\n",
      "PostedDate": "2013-11-08T13:03:16.507-08:00",
      "Id": 122447
    }
  ]
}