{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "Compile on save does not work currently for 0.9.0, you're seeing the compile on save behavior from web-essentials.\n\nFor the non-preview release of 0.9.0 we expect Compile on Save to work the same as 0.8.3.",
    "ClosedDate": "2013-04-26T11:44:26.527-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "\r\n\r\ni use hot page reloading (Chrome+\"LivePage\" Extension), hot unit testing (Karma test runner with \"autowatch\" turned on),  and the TS-to-JS hot preview (VS web-essentials preview window).\r\n\r\nIn each of these 3 situations, the user experience is greatly diminished due to the following once I press \"Save (Ctrl-S)\" for the typescript file I am editing in Visual Studio\r\n1. Compile-to-JS takes aprox 5 seconds\r\n2. About 10 seconds later, all .ts source-files in my project get recompiled (all .js files are resaved)\r\n\r\nThis causes the \"hot\" features to be delayed a considerable time, and also get double-reloaded due to the secondary full-project recompile.\r\n\r\nI have gone through my visual studio project settings (including web-essential settings) and it seems the #2 issue of full-project recompile can not currently be disabled.    \r\n\r\nRegression:  0.8.3.1 is much faster than 0.9.0 and doesn't always recompile everything (though it would be nice to be EVEN FASTER than 0.8.3.1)\r\n\r\n",
    "LastUpdatedDate": "2013-04-26T11:44:26.527-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "typescript",
    "ReportedDate": "2013-04-25T20:39:04.373-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "External"
    },
    "Summary": "0.9.0 alpha VS plugin: recompile-on-save is slow, + always recompiles all files",
    "Type": {
      "Name": "Unassigned",
      "Id": 5
    },
    "VoteCount": 2,
    "Id": 957
  },
  "FileAttachments": [],
  "Comments": []
}